char *szAppName="\307\301\270\256\275\272\305\346 \305\327\300\317";


char *mgRequestTrade = "%s\264\324\262\262 \260\305\267\241\270\246 \275\305\303\273\307\337\275\300\264\317\264\331";
char *mgRequestTrade2 = "%s\264\324\300\272 \260\305\270\256\260\241 \270\326\276\356\274\255 \260\305\267\241 \275\305\303\273\300\273 \307\322\274\366 \276\370\275\300\264\317\264\331";

char *mgDiconnect = "\274\255\271\366\277\315\300\307 \277\254\260\341\300\314 \262\367\276\356 \301\263\275\300\264\317\264\331";
char *mgDiconnect1 = "\274\255\271\366\277\315\300\307 \277\254\260\341\300\314 \262\367\276\356 \301\263\275\300\264\317\264\331 (1)";
char *mgDiconnect2 = "\274\255\271\366\277\315\300\307 \277\254\260\341\300\314 \262\367\276\356 \301\263\275\300\264\317\264\331 (2)";
char *mgDiconnect3 = "\274\255\271\366\277\315\300\307 \277\254\260\341\300\314 \262\367\276\356 \301\263\275\300\264\317\264\331 (3)";
char *mgDiconnect4 = "\274\255\271\366\277\315\300\307 \277\254\260\341\300\314 \262\367\276\356 \301\263\275\300\264\317\264\331 (4)";

char *mgCloseGame = "\260\324\300\323\300\273 \301\276\267\341 \307\325\264\317\264\331";
char *mgCloseWindow = "\273\347\277\353\301\337\300\316 \303\242\300\273 \264\335\260\355 \301\276\267\341 \307\317\275\312\275\303\277\300";
char *mgCloseBattle = "\300\374\305\365\301\337\277\241\264\302 \301\276\267\341\307\322\274\366 \276\370\275\300\264\317\264\331";
/*
char *mgQuestName[][4] = {
	{	"전업시험"	,	"전업시험 (완료)" , "ChangeJob1a.Msg" , "ChangeJob1b.Msg" },
	{	"전업시험 [로얄제리]"	,	"전업시험 (완료)" , "ChangeJob2a.Msg" , "ChangeJob1b.Msg" },
	{	"전업시험 [발모제]"		,	"전업시험 (완료)" , "ChangeJob3a.Msg" , "ChangeJob1b.Msg" },

	{	"전업시험 [두번째]"		,	"전업시험 [두번째]" , "ChangeJob3-1.msg" , "ChangeJob3-2.msg" },
	{	"전업시험 [두번째]"		,	"전업시험 (완료)" , "ChangeJob3-3.msg" , "ChangeJob3-4.msg" },

	//파이터 파이크맨 메카니션 나이트
	{	"전업시험 2차[1]"		,	"전업시험 2차[2]"		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-W1-2.msg" },
	{	"전업시험 2차[3]"		,	"전업시험 2차[4]"		, "Quest3\\ChangeJob3-W2-2.msg" , "Quest3\\ChangeJob3-W3-2.msg" },
	{	"전업시험 2차[5]"		,	"전업시험 2차[완료]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },

	//아쳐 아탈란타
	{	"전업시험 2차[1]"		,	"전업시험 2차[2]"		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-R1-2.msg" },
	{	"전업시험 2차[3]"		,	"전업시험 2차[4]"		, "Quest3\\ChangeJob3-R2-2.msg" , "Quest3\\ChangeJob3-R3-2.msg" },
	{	"전업시험 2차[5]"		,	"전업시험 2차[완료]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },

	//프리스티스 메지션
	{	"전업시험 2차[1]"		,	"전업시험 2차[2]"		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-M1-2.msg" },
	{	"전업시험 2차[3]"		,	"전업시험 2차[4]"		, "Quest3\\ChangeJob3-M2-2.msg" , "Quest3\\ChangeJob3-M3-2.msg" },
	{	"전업시험 2차[5]"		,	"전업시험 2차[완료]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },

	//레벨별 퀘스트
	{	"그녀들을 위하여"	,	"그녀들을 위하여(완료)" ,	"LevelQuest\\Quest30.Msg" , "LevelQuest\\Quest30a.Msg" },	//14
	{	"The Cave"	,	"The Cave(완료)" ,					"LevelQuest\\Quest55.Msg" , "LevelQuest\\Quest55a.Msg" },	//15
	{	"The Cave"	,	"The Cave(완료)" ,					"LevelQuest\\Quest55_2.Msg" , "LevelQuest\\Quest55_2a.Msg" }, //16
	{	"미켈레와의 우정"	,	"미켈레와의 우정(완료)" ,	"LevelQuest\\Quest70.Msg" , "LevelQuest\\Quest70a.Msg" },	//17
	{	"봉인된 퓨리",	"봉인된 퓨리(완료)" ,				"LevelQuest\\Quest80.Msg" , "LevelQuest\\Quest80a.Msg" },	//18
	{	"칼리아의 눈물","칼리아의 눈물(완료)" ,				"LevelQuest\\Quest85.Msg" , "LevelQuest\\Quest85a.Msg" },	//19
	{	"유라 빌리지","유라 빌리지(완료)" ,					"LevelQuest\\Quest90.Msg" , "LevelQuest\\Quest90a.Msg" },	//20

	//보너스 스텟 퀘스트
	{	"왕국의시험"	,	"왕국의시험(완료)" ,	"LevelQuest\\Quest_7State_1.msg" , "LevelQuest\\Quest_7State_end.msg" },	//21
	{	"왕국의시험"	,	"왕국의시험(완료)" ,	"LevelQuest\\Quest_7State_2.msg" , "LevelQuest\\Quest_7State_end.msg" },	//22
	{	"왕국의시험"	,	"왕국의시험(완료)" ,	"LevelQuest\\Quest_7State_3.msg" , "LevelQuest\\Quest_7State_end.msg" },	//23

	{	"어려운시련"	,	"어려운시련(완료)" ,	"LevelQuest\\Quest_10State_1.msg" , "LevelQuest\\Quest_10State_end.msg" },	//24
	{	"어려운시련"	,	"어려운시련(완료)" ,	"LevelQuest\\Quest_10State_2_1.msg" , "LevelQuest\\Quest_10State_end.msg" },//25
	{	"어려운시련"	,	"어려운시련(완료)" ,	"LevelQuest\\Quest_10State_2_2.msg" , "LevelQuest\\Quest_10State_end.msg" },//26
	{	"어려운시련"	,	"어려운시련(완료)" ,	"LevelQuest\\Quest_10State_2_3.msg" , "LevelQuest\\Quest_10State_end.msg" },//27

	//3차 전업 퀘스트
	{	"전업시험 3차[1]"	,	"전업시험 3차(완료)" ,	"Quest4\\ChangeJob4_1.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//28
	{	"전업시험 3차[2]"	,	"전업시험 3차(완료)" ,	"Quest4\\ChangeJob4_2.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//29
	{	"전업시험 3차[3]"	,	"전업시험 3차(완료)" ,	"Quest4\\ChangeJob4_3_1.msg" ,	"Quest4\\ChangeJob4_3_2.msg" },	//30
	{	"전업시험 3차[3]"	,	"전업시험 3차(완료)" ,	"Quest4\\ChangeJob4_3_3.msg" ,	"Quest4\\ChangeJob4_3_4.msg" },	//31
	{	"전업시험 3차[3]"	,	"전업시험 3차(완료)" ,	"Quest4\\ChangeJob4_3_5.msg" ,	"Quest4\\ChangeJob4_3_6.msg" },	//32
	{	"전업시험 3차[4]"	,	"전업시험 3차(완료)" ,	"Quest4\\ChangeJob4_4.msg" ,	"Quest4\\ChangeJob4_5.msg" }	//33

};
*/
char *mgRefuseWhisper = "\261\323\270\273\300\314 \260\305\272\316\265\307\276\372\275\300\264\317\264\331";
char *mgWeightOver = "\271\253\260\350\270\246 \303\312\260\372\307\337\275\300\264\317\264\331        ";

char *mgYahoo = "\276\337\310\243";
char *mgContinueChat = "%s : \263\312\271\253 \270\273\300\273 \270\271\300\314 \307\337\264\365\264\317 \307\364\260\241 \261\273\276\356 \271\366\267\310\264\331! \277\354\277\315 -_-;";
char *mgRecvItem = "   \276\306\300\314\305\333 ( %s ) \300\273 \271\336\276\322\275\300\264\317\264\331   ";

char *mgItemTimeOut = "\276\306\300\314\305\333 ( %s ) \273\347\277\353\261\342\260\243\300\314 \301\276\267\341 \265\307\276\356 \301\246\260\305\265\307\276\372\275\300\264\317\264\331";
char *mgSOD_Clear = " \303\340\307\317\307\325\264\317\264\331. \273\363\261\335 %d\277\370\300\273 \310\271\265\346\307\337\275\300\264\317\264\331 ";


char *mgBlessCrystal_01 = "  \274\322\310\257\307\322\274\366 \300\326\264\302 \260\271\274\366\270\246 \303\312\260\372\307\337\275\300\264\317\264\331  ";
char *mgBlessCrystal_02 = "   \274\322\310\257\300\272 \307\321 \271\370\276\277\270\270 \307\322\274\366 \300\326\275\300\264\317\264\331   ";
char *mgBlessCrystal_03 = "   \305\251\270\256\275\272\305\273\300\273 \273\347\277\353\307\322\274\366 \276\370\275\300\264\317\264\331   ";

char *mgGetQuestItem = "> (%s) \276\306\300\314\305\333\300\273 \310\271\265\346\307\337\275\300\264\317\264\331";

// Bellatra
char *g_lpBellatraTeamNameText[] = 
{
	"\271\260\300\307 \275\303\267\303",
	"\266\245\300\307 \275\303\267\303",
	"\271\331\266\367\300\307 \275\303\267\303",
	"\272\322\300\307 \275\303\267\303",
	"\305\302\276\347\300\307 \300\345",
	"\264\336\300\307 \300\345",
};

char *g_lpBellatraResult_Text1 = "%s \277\241";
char *g_lpBellatraResult_Text2 = "%s \260\372 %s \277\241";
char *g_lpBellatraResult_Text3 = "\302\374\260\241\307\321 \306\300\300\314";
char *g_lpBellatraResult_Text4 = "\273\363\300\247 \305\276\300\270\267\316 \301\370\303\342\307\317\277\264\275\300\264\317\264\331.";
