//ycy
//Message เกี่ยวกับ การสร้าง CLAN
char *szMsg1 =  "\340\313\305\350\322\274\331\351\241\305\351\322\267\325\350\301\325\315\330\264\301\244\265\324\340\313\301\327\315\271\241\321\271\n"  // เหล่าผู้กล้าที่มีอุดมคติเหมือนกัน\n
รวมตัวกันเพื่อสร้างกลุ่มชนที่ยั่งยืน\n
กลุ่มชนนี้เรียกว่า Clan\n
Clan รวมตัวกันเพื่อปกป้อง และ\n
ช่วยเหลือสมาชิกอย่างดีที่สุด อย่างไรก็ตาม\n
การจะมี Clan ได้ จะต้องจ่ายภาษีตามเกณฑ์ที่กำหนด\n
เพื่อให้ Clan ของตนเป็นที่ยอมรับ\n
ตามกฎหมาย..  สนใจจะลองตั้ง\n
Clan ดูบ้างหรือไม่? "  ;

//Message เกี่ยวกับค่าใช้จ่ายในการสร้าง CLAN
char *szMsg2 =  "\343\271\241\322\303\241\350\315\265\321\351\247 Clan \n \267\350\322\271\265\351\315\247\250\350\322\302 500,000 \340\273\347\271\244\350\322\300\322\311\325\n \267\350\322\271\276\303\351\315\301\267\325\350\250\320\250\350\322\302\313\303\327\315\344\301\350?\n "  ;  // ในการก่อตั้ง Clan \n ท่านต้องจ่าย 500,000 เป็นค่าภาษี\n ท่านพร้อมที่จะจ่ายหรือไม่?\n 


//Message เกี่ยวกับเงินค่าใช้จ่ายในการสร้าง  CLAN ไม่พอ
char *szMsg21 =  "\267\350\322\271\265\351\315\247\301\325 500,000\n\"  // ท่านต้องมี 500,000\n\
เพื่อจ่ายภาษีในการก่อตั้งแคลน\n\
โปรดกลับมาอีกรอบเมื่อท่านมีเงินเพียงพอ "  ;

//Message เกี่ยวกับการตั้งชื่อ CLAN
char *szMsg3 =  "\267\350\322\271\265\321\351\247\252\327\350\315 Clan \242\315\247\267\350\322\271\307\350\322\315\320\344\303?\n"  ;  // ท่านตั้งชื่อ Clan ของท่านว่าอะไร?\n

//Message เกี่ยวกับการอธิบาย CLAN Mark
char *szMsg4 =  "\340\301\327\350\315 Clan \266\331\241\265\321\351\247\242\326\351\271\341\305\351\307 \341\265\350\305\320 Clan\n\"  // เมื่อ Clan ถูกตั้งขึ้นแล้ว แต่ละ Clan\n\
สามารถที่จะเลือกใช้ข้อความอธิบายและเครื่องหมาย\n\
เพื่อเป็นสัญลักษณ์ของ Clan ได้\n\
กรุณาแวะไปที่โฮมเพจ PristonTale เพื่อลงทะเบียน\n\
ซึ่งข้อมูลที่ท่านให้ไว้สามารถแก้ไขได้ในภายหลัง\n\
ขอบคุณครับ\n "  ;


//Message เกี่ยวกับการอธิบายเงื่อนไขการสร้าง CLAN

char *szMsg5 =  "\343\271\241\322\303\250\320\267\320\340\272\325\302\271 Clan \315\302\350\322\247\340\273\347\271\267\322\247\241\322\303\n\"  // ในการจะทะเบียน Clan อย่างเป็นทางการ\n\
มีเงื่อนไขที่จำเป็นในการตั้ง Clan ดังต่อไปนี้\n\
*ต้องมีสมาชิกอย่างน้อย 6 คน(รวมหัวหน้าแคลน)\n\
*ท่านมีเวลา 10 วันในการหาสมาชิกให้ครบ\n\
หากท่านไม่สามารถทำตามข้อกำหนดข้างต้นได้\n\
Clan ของท่านที่ลงทะเบียนไว้ จะถูกยกเลิก\n\ 
ทันที\n "  ;

char *szClanMakeFinishMsg =  "\241\322\303\305\247\267\320\340\272\325\302\271 Clan \340\303\325\302\272\303\351\315\302\341\305\351\307\n\"  // การลงทะเบียน Clan เรียบร้อยแล้ว\n\
โปรดทำตามเงื่อนไขที่บอกไว้\n\
เพื่อทำให้ Clan ของท่านเป็นที่ยอมรับ และสมบูรณ์\n "  ;

//Message เตือนเกี่ยวกับคาแรคเตอร์ที่
char *szMsg254 = "\316\350\322\316\350\322\316\350\322.... \274\325\301\327\315\341\244\350\271\325\351 \244\324\264\250\320\301\322\265\321\351\247\n\"  // ฮ่าฮ่าฮ่า.... ผีมือแค่นี้ คิดจะมาตั้ง\n\
Clan ของตัวเองอย่างงั้นหรือ?\n\
ข้าว่าท่านเอาตัวเองจะยังไม่รอดเลย.. ฮ่าฮ่าฮ่า\n ";

//Message เกี่ยวกับการยกเลิก CLAN
char *szMsg15 =  "\267\350\322\271\265\351\315\247\241\322\303\250\320\302\330\272 Clan \315\302\350\322\247\271\321\351\271\313\303\327\315? "  ;  // ท่านต้องการจะยุบ Clan อย่างนั้นหรือ? 
char *szMark1 =  "\267\350\322\271\302\321\247\344\301\350\301\325\312\321\255\305\321\241\311\263\354 Clan \342\273\303\264\315\350\322\271\307\324\270\325\305\247\267\320\340\272\325\302\271\342\264\302\305\320\340\315\325\302\264 "  ;  // ท่านยังไม่มีสัญลักษณ์ Clan โปรดอ่านวิธีลงทะเบียนโดยละเอียด 
char *szMark2 =  "\267\350\322\271\265\351\315\247\241\322\303\343\252\351\312\321\255\305\321\241\311\263\354\271\325\351\340\273\347\271\312\321\255\305\321\241\311\263\354 Clan \343\252\350\313\303\327\315\344\301\350? "  ;  // ท่านต้องการใช้สัญลักษณ์นี้เป็นสัญลักษณ์ Clan ใช่หรือไม่? 
char *szMark3 =  "\267\350\322\271\265\351\315\247\241\322\303\340\273\305\325\350\302\271\312\321\255\305\321\241\311\263\354 Clan \343\252\350\313\303\327\315\344\301\350? "  ;  // ท่านต้องการเปลี่ยนสัญลักษณ์ Clan ใช่หรือไม่? 


//Message เกี่ยวกับการเข้าร่วม CLAN
char *szJoin =  "\252\327\350\315 Clan: %s\nClan Master : %s\n\n \344\264\351\242\315\340\252\324\255\267\350\322\271\340\242\351\322\303\350\307\301 Clan\n\"  // ชื่อ Clan: %s\nClan Master : %s\n\n ได้ขอเชิญท่านเข้าร่วม Clan\n\
ท่านจะเข้าร่วม Clan นี้หรือไม่?\n "  ;
char *szSecession =  "\252\327\350\315 Clan: %s\n \267\350\322\271\265\351\315\247\241\322\303\250\320\315\315\241\250\322\241 Clan \271\325\351\343\252\350\313\303\327\315\344\301\350? "  ;  // ชื่อ Clan: %s\n ท่านต้องการจะออกจาก Clan นี้ใช่หรือไม่? 
//ในกรณีทีสมาชิก CLAN  มีน้อยกว่า 6 คน
char *szMsg6 =  "\343\271\241\322\303\305\247\267\320\340\272\325\302\271\312\303\351\322\247 Clan \267\350\322\271\265\351\315\247\301\325\312\301\322\252\324\241\315\302\350\322\247\271\351\315\302 6 \244\271\n \267\350\322\271\301\325\340\307\305\322\340\313\305\327\315\315\325\241 %d \307\321\271 "  ;  // ในการลงทะเบียนสร้าง Clan ท่านต้องมีสมาชิกอย่างน้อย 6 คน\n ท่านมีเวลาเหลืออีก %d วัน 
//end ycy


char *szServerConnectErrorMsg =  "\265\324\264\265\350\315\241\321\272 Clan Server \344\301\350\344\264\351 \n\"  // ติดต่อกับ Clan Server ไม่ได้ \n\
กรุณาลองใหม่อีกทีภายหลัง\n "  ;

char *szReadClanMarkErrorMsg =  "\344\301\350\312\322\301\322\303\266\315\350\322\271\312\321\255\305\321\241\311\263\354 Clan\n\"  // ไม่สามารถอ่านสัญลักษณ์ Clan\n\
จากเซอร์เวอร์ได้\n "  ;

char *szCancelMakeClan =  "\302\241\340\305\324\241\241\322\303\241\350\315\265\321\351\247 Clan \340\303\325\302\272\303\351\315\302\341\305\351\307\n "  ;  // ยกเลิกการก่อตั้ง Clan เรียบร้อยแล้ว\n 

char *szTranzationError =  "\340\241\324\264\273\321\255\313\322\343\271\260\322\271\242\351\315\301\331\305 \250\320\267\323\241\322\303\273\324\264\340\301\271\331\n "  ;  // เกิดปัญหาในฐานข้อมูล จะทำการปิดเมนู\n 

char *szInsertClanWonError1 =  "\265\321\307\305\320\244\303\271\325\351\315\302\331\350\241\321\272 Clan \315\327\350\271\341\305\351\307\n "  ;  // ตัวละครนี้อยู่กับ Clan อื่นแล้ว\n 

char *szClanNameError =  "\252\327\350\315 Clan \271\325\351\301\325\315\302\331\350\341\305\351\307\241\303\330\263\322\343\312\350\252\327\350\315\343\313\301\350\n "  ;  // ชื่อ Clan นี้มีอยู่แล้วกรุณาใส่ชื่อใหม่\n 

char *sz100Error =  "\340\241\324\264\273\321\255\313\322\241\322\303\265\324\264\265\350\315\241\321\272\340\253\315\303\354\340\307\315\303\354\n\"  // เกิดปัญหาการติดต่อกับเซอร์เวอร์\n\
จะทำการปิดเมนู\n "  ;

char *szDefaultError =  "\340\241\324\264\273\321\255\313\322\241\322\303\265\324\264\265\350\315\241\321\272\340\253\315\303\354\340\307\315\303\354\n\"  // เกิดปัญหาการติดต่อกับเซอร์เวอร์\n\
 จะทำการปิดเมนู\n "  ;

char *szReleseError =  "\252\327\350\315\265\321\307\305\320\244\303\273\321\250\250\330\272\321\271\344\301\350\344\264\351\340\273\347\271\313\321\307\313\271\351\322 Clan\n\"  // ชื่อตัวละครปัจจุบันไม่ได้เป็นหัวหน้า Clan\n\
หรือไม่มี Clan ที่ระบุ\n "  ;


char *szSecessionSuccess =  "\267\350\322\271\344\264\351\315\315\241\250\322\241 Clan \341\305\351\307\n "  ;  // ท่านได้ออกจาก Clan แล้ว\n 

char *szSecession6DownMsg =  "\273\305\264\312\301\322\252\324\241\315\315\241\340\303\325\302\272\303\351\315\302\341\305\351\307\n\"  // ปลดสมาชิกออกเรียบร้อยแล้ว\n\
ตอนนี้ท่านมีน้อยกว่า 6 คนในแคลน\n "  ;


char *szSecessionChipMsg =  "\312\301\322\252\324\241\267\325\350\265\351\315\247\241\322\303\315\315\241\250\322\241 Clan \n\"  // สมาชิกที่ต้องการออกจาก Clan \n\
เป็นหัวหน้า Clan \n "  ;

char *szSecession2ErrorMsg =  "\344\301\350\276\272 Clan  \313\303\327\315 \344\301\350\344\264\351\340\273\347\271\313\321\307\313\271\351\322 Clan\n\"  // ไม่พบ Clan  หรือ ไม่ได้เป็นหัวหน้า Clan\n\
หรือไม่ได้เป็นสมาชิก Clan\n "  ;





char *szClanJoinMsg =  "\252\327\350\315 Clan: %s\n\313\321\307\313\271\351\322 Clan: %s\n Member ID: %s\n\n \265\351\315\247\241\322\303\305\247\267\320\340\272\325\302\271\n "  ;  // ชื่อ Clan: %s\nหัวหน้า Clan: %s\n Member ID: %s\n\n ต้องการลงทะเบียน\n 

char *szClanJoinError2Msg =  "\312\301\322\252\324\241\267\325\350\265\351\315\247\241\322\303\250\320\340\242\351\322 Clan \312\321\247\241\321\264\315\302\331\350\343\271 Clan \315\327\350\271\315\302\331\350\341\305\351\307\n "  ;  // สมาชิกที่ต้องการจะเข้า Clan สังกัดอยู่ใน Clan อื่นอยู่แล้ว\n 

char *szClanJoinError3Msg =  "\344\301\350\276\272 Clan \313\303\327\315 \344\301\350\344\264\351\340\273\347\271\313\321\307\313\271\351\322 Clan\n "  ;  // ไม่พบ Clan หรือ ไม่ได้เป็นหัวหน้า Clan\n 

char *szClanJoinError4Msg =  "\312\301\322\252\324\241\267\330\241\244\271\301\325 LV 32 \313\303\327\315\301\322\241\241\307\350\322\n "  ;  // สมาชิกทุกคนมี LV 32 หรือมากกว่า\n 

char *szClanJoinCancelMsg =  "%s \273\257\324\340\312\270\241\322\303\340\252\324\255\343\313\351\303\350\307\301 Clan\n "  ;  // %s ปฏิเสธการเชิญให้ร่วม Clan\n 

char *szClanJoinsucesssMsg =  "%s \303\321\272\241\322\303\340\252\324\255\343\313\351\303\350\307\301 Clan\n "  ;  // %s รับการเชิญให้ร่วม Clan\n 





char *szReMoveClanWonMsg =  "\273\305\264\315\315\241\250\322\241\312\301\322\252\324\241 Clan \n "  ;  // ปลดออกจากสมาชิก Clan \n 

char *szReMoveHeaderMsg =  "\303\322\302\252\327\350\315\274\331\351\266\331\241\273\305\264\315\315\241\250\322\241 Clan \n "  ;  // รายชื่อผู้ถูกปลดออกจาก Clan \n 

//Message เกี่ยวกับการยกเลิก CLAN
char *szReConfReleaseMsg =  "\313\322\241\267\350\322\271\302\241\340\305\324\241 Clan \242\351\315\301\331\305\267\321\351\247\313\301\264\340\241\325\350\302\307\241\321\272 Clan \271\325\351\250\320\266\331\241\305\272\267\324\351\247\n\"  // หากท่านยกเลิก Clan ข้อมูลทั้งหมดเกี่ยวกับ Clan นี้จะถูกลบทิ้ง\n\
ยืนยันการลบ?\n "  ;
char *szNoRecordReleaseMsg =  "\267\350\322\271\276\302\322\302\322\301\302\241\340\305\324\241 Clan \241\350\315\271\n\"  // ท่านพยายามยกเลิก Clan ก่อน\n\
ที่จะลงทะเบียนเรียบร้อย\n\
ยืนยันการลบ?\n"  ;
char *szFinishReleaseMsg =  "Clan \266\331\241\302\330\272\341\305\351\307\n "  ;  // Clan ถูกยุบแล้ว\n 

char *szSecessionMsg =  "\266\351\322\267\350\322\271\315\315\241\250\322\241 Clan \303\320\272\272\265\350\322\247\346\340\241\325\350\302\307\241\321\272\n Clan \242\315\247\267\350\322\271\250\320\313\322\302\344\273\n \302\327\271\302\321\271\241\322\303\315\315\241?\n "  ;  // ถ้าท่านออกจาก Clan ระบบต่างๆเกี่ยวกับ\n Clan ของท่านจะหายไป\n ยืนยันการออก?\n 
char *szFinishSecessionMsg =  "Clan: %s\n\312\301\322\252\324\241 : %s\n \344\264\351\315\315\241\250\322\241\341\244\305\271\341\305\351\307.\n "  ;  // Clan: %s\nสมาชิก : %s\n ได้ออกจากแคลนแล้ว.\n 

char *szisCheckClanJangErrorMsg =  "\267\350\322\271\344\301\350\312\322\301\322\303\266\312\303\351\322\247 Clan \343\313\301\350\344\264\351\n\"  // ท่านไม่สามารถสร้าง Clan ใหม่ได้\n\
เนื่องจากตัวละครของท่านเป็น\n หัวหน้า Clan อยู่\n "  ;

char *szMoneyErrorMsg =  "\340\247\324\271\344\301\350\340\276\325\302\247\276\315\343\271\241\322\303\n \265\321\351\247 Clan\n "    // เงินไม่เพียงพอในการ\n ตั้ง Clan\n 
 "  \344\301\350\312\322\301\322\303\266\312\303\351\322\247 Clan \344\264\351 "  ;  //   ไม่สามารถสร้าง Clan ได้ 

char *szAbilityErrorMsg =  "\301\325 EXP \344\301\350\276\315\267\325\350\n \250\320\265\321\351\247 Clan \n "  ;  // มี EXP ไม่พอที่\n จะตั้ง Clan \n 

char *szRemoveShortClanWonMsg =  "\266\351\322\267\350\322\271\305\272\312\301\322\252\324\241\244\271\271\325\351\267\324\351\247 Clan\n \242\315\247\267\350\322\271\250\320\301\325\244\271\344\301\350\244\303\272\265\322\301\241\323\313\271\264\n\"  // ถ้าท่านลบสมาชิกคนนี้ทิ้ง Clan\n ของท่านจะมีคนไม่ครบตามกำหนด\n\
ยืนยันการลบ? "  ;
char *szRemoveShowrtClanWonResultMsg =  "Clan \301\325\312\301\322\252\324\241\271\351\315\302\241\307\350\322 6 \244\271\n \342\273\303\264\313\322\312\301\322\252\324\241\n \340\276\324\350\301..\n "  ;  // Clan มีสมาชิกน้อยกว่า 6 คน\n โปรดหาสมาชิก\n เพิ่ม..\n 

char *szNoName =  "\342\273\303\264\343\312\350\252\327\350\315 Clan \267\325\350\265\351\315\247\241\322\303\n "  ;  // โปรดใส่ชื่อ Clan ที่ต้องการ\n 

char *szLoading =  "\241\323\305\321\247\265\324\264\265\350\315\241\321\272 Server\n "  ;  // กำลังติดต่อกับ Server\n 


///////// Message  เกี่ยวกับการลบคาแรคเตอร์
char *szDeleteChaReleaseBefore =  "\265\321\307\305\320\244\303\271\325\351\340\273\347\271\313\321\307\313\271\351\322 Clan \266\351\322\267\350\322\271\305\272\n\"  // ตัวละครนี้เป็นหัวหน้า Clan ถ้าท่านลบ\n\
แคลนจะถูกลบไปด้วย\n\
ยืนยันการลบ?\n "  ;

char *szDeleteChaRelease =  "Clan \344\264\351\266\331\241\302\241\340\305\324\241\341\305\351\307\n "  ;  // Clan ได้ถูกยกเลิกแล้ว\n 

char *szDeleteChaSecessionBefore =  "\265\321\307\305\320\244\303\271\325\351\315\302\331\350\343\271 Clan\n\"  // ตัวละครนี้อยู่ใน Clan\n\
ถ้าท่านลบถือเป็นการออกจาก Clan อัตโนมัติ\n\
ยืนยันการลบ?\n "  ;
char *szDeleteChaSecession =  "  \265\321\307\305\320\244\303\266\331\241\305\272\340\303\325\302\272\303\351\315\302\341\305\351\307\n "  ;  //   ตัวละครถูกลบเรียบร้อยแล้ว\n 

char *szDeleteChaError =  "\344\301\350\312\322\301\322\303\266\305\272 Clan \n \344\301\350\312\322\301\322\303\266\305\272\265\321\307\305\320\244\303\n "  ;  // ไม่สามารถลบ Clan \n ไม่สามารถลบตัวละคร\n 
char *szMakeFinishClan =  "\302\324\271\264\325\264\351\307\302\n[%s]\n\267\350\322\271\344\264\351\340\273\347\271\312\301\322\252\324\241 Clan \340\303\325\302\272\303\351\315\302\341\305\351\307\n "  ;  // ยินดีด้วย\n[%s]\nท่านได้เป็นสมาชิก Clan เรียบร้อยแล้ว\n 
char *szแคลนWon6Down =  "Clan \301\325\312\301\322\252\324\241\271\351\315\302\241\307\350\322 6 \244\271\n  \342\273\303\264\313\322\312\301\322\252\324\241\n  \340\276\324\350\301...\n\"  // Clan มีสมาชิกน้อยกว่า 6 คน\n  โปรดหาสมาชิก\n  เพิ่ม...\n\
%s\n "  ;


char *szClanUserNoMakeMsg =  "Clan : %s\n\305\247\267\320\340\272\325\302\271 Clan.... "  ;  // Clan : %s\nลงทะเบียน Clan.... 
char *szMakeFinishแคลนWon =  "Clan : %s\n Clan \242\315\247\267\350\322\271\305\247\267\320\340\272\325\302\271\340\303\325\302\272\303\351\315\302\341\305\351\307\n "  ;  // Clan : %s\n Clan ของท่านลงทะเบียนเรียบร้อยแล้ว\n 
char *ClanServerInspect =  "Server maintenance.\n "  ;
char *szClanUserRelease =  "Clan \266\331\241\302\330\272\305\247\341\305\351\307 "  ;  // Clan ถูกยุบลงแล้ว 
char *Replay =  "\241\303\330\263\322\305\315\247\343\313\301\350\315\325\241\244\303\321\351\247 "  ;  // กรุณาลองใหม่อีกครั้ง 
char *szแคลนMakedowninfo =  "\305\247\267\320\340\272\325\302\271 Clan..... "  ;  // ลงทะเบียน Clan..... 

//การปลดอัตโนมัติ, หัวหน้าแคลนปลดสมาชิกออกจากแคลนขณะที่การลงทะเบียนถูกยกเลิก 
char *szClanUserReleaseMsg =  "Clan : %s\n \241\322\303\305\247\267\320\340\272\325\302\271\266\331\241\302\241\340\305\324\241\n "  ;  // Clan : %s\n การลงทะเบียนถูกยกเลิก\n 
char *szClanUserRemove =  "Clan : %s\n\312\301\322\252\324\241 : %s\n\344\264\351\266\331\241\273\305\264\315\315\241\250\322\241 Clan\n "  ;  // Clan : %s\nสมาชิก : %s\nได้ถูกปลดออกจาก Clan\n 

