
char *srPartyMsg1 =  "\242\263\320\271\325\351\274\331\351\271\323 Party \244\327\315 %s ";  // ขณะนี้ผู้นำ Party คือ %s 
char *srPartyMsg2 =  "Party \344\264\351\266\331\241\302\241\340\305\324\241 ";  // Party ได้ถูกยกเลิก 
char *srPartyMsg3 =  "%s \344\264\351\340\242\351\322\303\350\307\301 Party ";  // %s ได้เข้าร่วม Party 
char *srPartyMsg4 =  "\344\301\350\312\322\301\322\303\266\340\242\351\322\303\350\307\301 Party \344\264\351 ";  // ไม่สามารถเข้าร่วม Party ได้ 
char *srPartyMsg5 =  "%s \344\264\351\315\315\241\250\322\241 Party ";  // %s ได้ออกจาก Party 
