char *mgQuestName[][4] = {
	{	 "Rank-up Exam " 	,	 "\241\322\303\340\273\305\325\350\302\271\244\305\322\312 (\312\301\272\331\303\263\354)"  ,  "ChangeJob1a.Msg"  ,  "ChangeJob1b.Msg"  },  // การเปลี่ยนคลาส (สมบูรณ์)
	{	 "Rank-up Exam [Royal Jelly] " 	,	 "\241\322\303\340\273\305\325\350\302\271\244\305\322\312 (\312\301\272\331\303\263\354)"  ,  "ChangeJob2a.Msg"  ,  "ChangeJob1b.Msg"  },  // การเปลี่ยนคลาส (สมบูรณ์)
	{	 "Rank-up Exam [Hair growth spray] " 	,	 "Rank-up Exam (Done)"  ,  "ChangeJob3a.Msg"  ,  "ChangeJob1b.Msg"  },
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312  [\244\303\321\351\247\267\325\350 2] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312  [\244\303\321\351\247\267\325\350 2] " , "ChangeJob3-1.msg" , "ChangeJob3-2.msg" },  // การเปลี่ยนคลาส  [ครั้งที่ 2]  | การเปลี่ยนคลาส  [ครั้งที่ 2] 
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312  [\244\303\321\351\247\267\325\350 2] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312  (\312\301\272\331\303\263\354) " , "ChangeJob3-3.msg" , "ChangeJob3-4.msg" },  // การเปลี่ยนคลาส  [ครั้งที่ 2]  | การเปลี่ยนคลาส  (สมบูรณ์) 

	//Fighter Pikeman Mechanic Knight
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [1] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [2] "		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-W1-2.msg" },  // การเปลี่ยนคลาสที่ 2 [1]  | การเปลี่ยนคลาสที่ 2 [2] 
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [3]  "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [4] "		, "Quest3\\ChangeJob3-W2-2.msg" , "Quest3\\ChangeJob3-W3-2.msg" },  // การเปลี่ยนคลาสที่ 2 [3]   | การเปลี่ยนคลาสที่ 2 [4] 
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [5] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [\312\301\272\331\303\263\354] "	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },  // การเปลี่ยนคลาสที่ 2 [5]  | การเปลี่ยนคลาสที่ 2 [สมบูรณ์] 

	//Archer Atlanta
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [1] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [2] "		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-R1-2.msg" },  // การเปลี่ยนคลาสที่ 2 [1]  | การเปลี่ยนคลาสที่ 2 [2] 
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\244\303\321\351\247\267\325\350 2 [3] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [4] "		, "Quest3\\ChangeJob3-R2-2.msg" , "Quest3\\ChangeJob3-R3-2.msg" },  // การเปลี่ยนคลาสครั้งที่ 2 [3]  | การเปลี่ยนคลาสที่ 2 [4] 
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [5] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [\312\301\272\331\303\263\354]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },  // การเปลี่ยนคลาสที่ 2 [5]  | การเปลี่ยนคลาสที่ 2 [สมบูรณ์]

	//Pristess Magician
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [1] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [2] "		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-M1-2.msg" },  // การเปลี่ยนคลาสที่ 2 [1]  | การเปลี่ยนคลาสที่ 2 [2] 
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [3] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [4] "		, "Quest3\\ChangeJob3-M2-2.msg" , "Quest3\\ChangeJob3-M3-2.msg" },  // การเปลี่ยนคลาสที่ 2 [3]  | การเปลี่ยนคลาสที่ 2 [4] 
	{	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [5] "		,	"\241\322\303\340\273\305\325\350\302\271\244\305\322\312\267\325\350 2 [\312\301\272\331\303\263\354] "	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },  // การเปลี่ยนคลาสที่ 2 [5]  | การเปลี่ยนคลาสที่ 2 [สมบูรณ์] 
		
	// Level Quest
	{	"\341\264\350\340\270\315"		,	"\341\264\350\340\270\315 (\312\355\322\340\303\347\250)" 	,	"LevelQuest\\Quest30.Msg" , "LevelQuest\\Quest30a.Msg" },	//14  // แด่เธอ | แด่เธอ (สําเร็จ)
	{	"\340\264\315\320\340\244\277 "		,	"\340\264\315\320\340\244\277(\312\355\322\340\303\347\250)"	,	"LevelQuest\\Quest55.Msg" , "LevelQuest\\Quest55a.Msg" },	//15  // เดอะเคฟ  | เดอะเคฟ(สําเร็จ)
	{	"\340\264\315\320\340\244\277 "		,	"\340\264\315\320\340\244\277(\312\355\322\340\303\347\250)"	,	"LevelQuest\\Quest55_2.Msg" , "LevelQuest\\Quest55_2a.Msg" }, //16  // เดอะเคฟ  | เดอะเคฟ(สําเร็จ)
	{	"\301\324\265\303\300\322\276\341\264\350\301\324\340\252\305 "	,	"\301\324\265\303\300\322\276\341\264\350\301\324\340\252\305(\312\355\322\340\303\347\250) "	,	"LevelQuest\\Quest70.Msg" , "LevelQuest\\Quest70a.Msg" },	//17  // มิตรภาพแด่มิเชล  | มิตรภาพแด่มิเชล(สําเร็จ) 
	{	"\274\271\326\241 Fury"		,	"\274\271\326\241 Fury(\312\355\322\340\303\347\250)"	,	"LevelQuest\\Quest80.Msg" , "LevelQuest\\Quest80a.Msg" },	//18  // ผนึก Fury | ผนึก Fury(สําเร็จ)
	{	"\313\302\322\264\271\355\351\322\265\322\244\322\303\354\340\305\325\302"	,	"\313\302\322\264\271\355\351\322\265\322\244\322\303\354\340\305\325\302(\312\355\322\340\303\347\250)",	"LevelQuest\\Quest85.Msg" , "LevelQuest\\Quest85a.Msg" },	//19  // หยาดนํ้าตาคาร์เลีย | หยาดนํ้าตาคาร์เลีย(สําเร็จ)
	{	"\313\301\331\350\272\351\322\271\302\331\303\350\322 "	,	"\313\301\331\350\272\351\322\271\302\331\303\350\322(\312\355\322\340\303\347\250)"	,	"LevelQuest\\Quest90.Msg" , "LevelQuest\\Quest90a.Msg" },	//20  // หมู่บ้านยูร่า  | หมู่บ้านยูร่า(สําเร็จ)
	
	//เควสโบนัสแสตท
	{	"\272\267\267\264\312\315\272\341\313\350\247\303\322\252\315\322\263\322\250\321\241\303"	,	"\272\267\267\264\312\315\272\341\313\350\247\303\322\252\315\322\263\322\250\321\241\303(\340\303\325\302\272\303\351\315\302)" ,	"LevelQuest\\Quest_7State_1.msg" , "LevelQuest\\Quest_7State_end.msg" },	//21  // บททดสอบแห่งราชอาณาจักร | บททดสอบแห่งราชอาณาจักร(เรียบร้อย)
	{	"\272\267\267\264\312\315\272\341\313\350\247\303\322\252\315\322\263\322\250\321\241\303"	,	"\272\267\267\264\312\315\272\341\313\350\247\303\322\252\315\322\263\322\250\321\241\303(\340\303\325\302\272\303\351\315\302)" ,	"LevelQuest\\Quest_7State_2.msg" , "LevelQuest\\Quest_7State_end.msg" },	//22  // บททดสอบแห่งราชอาณาจักร | บททดสอบแห่งราชอาณาจักร(เรียบร้อย)
	{	"\272\267\267\264\312\315\272\341\313\350\247\303\322\252\315\322\263\322\250\321\241\303"	,	"\272\267\267\264\312\315\272\341\313\350\247\303\322\252\315\322\263\322\250\321\241\303(\340\303\325\302\272\303\351\315\302)" ,	"LevelQuest\\Quest_7State_3.msg" , "LevelQuest\\Quest_7State_end.msg" },	//23  // บททดสอบแห่งราชอาณาจักร | บททดสอบแห่งราชอาณาจักร(เรียบร้อย)

	{	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241"	,	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241(\312\355\322\340\303\347\250)" ,	"LevelQuest\\Quest_10State_1.msg" , "LevelQuest\\Quest_10State_end.msg" },	//24  // หนทางแห่งความยากลําบาก | หนทางแห่งความยากลําบาก(สําเร็จ)
	{	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241"	,	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241(\312\355\322\340\303\347\250)",	"LevelQuest\\Quest_10State_2_1.msg" , "LevelQuest\\Quest_10State_end.msg" },//25  // หนทางแห่งความยากลําบาก | หนทางแห่งความยากลําบาก(สําเร็จ)
	{	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241"	,	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241(\312\355\322\340\303\347\250)"	"LevelQuest\\Quest_10State_2_2.msg" , "LevelQuest\\Quest_10State_end.msg" },//26  // หนทางแห่งความยากลําบาก | หนทางแห่งความยากลําบาก(สําเร็จ)
	{	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241"	,	"\313\271\267\322\247\341\313\350\247\244\307\322\301\302\322\241\305\355\322\272\322\241(\312\355\322\340\303\347\250)",	"LevelQuest\\Quest_10State_2_3.msg" , "LevelQuest\\Quest_10State_end.msg" },//27  // หนทางแห่งความยากลําบาก | หนทางแห่งความยากลําบาก(สําเร็จ)

	//3เควสเปลี่ยนอาชีพรอบ3
	{	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503[1]"	,	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503(\312\355\322\340\303\347\250)" ,	"Quest4\\ChangeJob4_1.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//28  // เควสเปลี่ยนอาชีพรอบที่3[1] | เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)
	{	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503[2]"	,	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503(\312\355\322\340\303\347\250)",	"Quest4\\ChangeJob4_2.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//29  // เควสเปลี่ยนอาชีพรอบที่3[2] | เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)
	{	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503[3]"	,	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503(\312\355\322\340\303\347\250)",	"Quest4\\ChangeJob4_3_1.msg" ,	"Quest4\\ChangeJob4_3_2.msg" },	//30  // เควสเปลี่ยนอาชีพรอบที่3[3] | เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)
	{	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503[3]"	,	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503(\312\355\322\340\303\347\250)",	"Quest4\\ChangeJob4_3_3.msg" ,	"Quest4\\ChangeJob4_3_4.msg" },	//31  // เควสเปลี่ยนอาชีพรอบที่3[3] | เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)
	{	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503[3]"	,	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503(\312\355\322\340\303\347\250)" ,	"Quest4\\ChangeJob4_3_5.msg" ,	"Quest4\\ChangeJob4_3_6.msg" },	//32  // เควสเปลี่ยนอาชีพรอบที่3[3] | เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)
	{	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503[4]"	,	"\340\244\307\312\340\273\305\325\350\302\271\315\322\252\325\276\303\315\272\267\325\3503(\312\355\322\340\303\347\250)",	"Quest4\\ChangeJob4_4.msg" ,	"Quest4\\ChangeJob4_5.msg" }	//33  // เควสเปลี่ยนอาชีพรอบที่3[4] | เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)

};

//신규  퀘스트 
char *mgHaQuestName[][4] = {
	{	"A tired warehouse keeper"	,"A tired warehouse keeper(\312\323\340\303\347\250)"   , "HaQuest\\Quest_tired_1start_T.msg"     , "HaQuest\\Quest_tired_1end.msg"   },  // A tired warehouse keeper(สำเร็จ)
	{	"A tired warehouse keeper"	,"A tired warehouse keeper(\312\323\340\303\347\250)"   , "HaQuest\\Quest_tired_1start_M.msg"     , "HaQuest\\Quest_tired_1end.msg"   },  // A tired warehouse keeper(สำเร็จ)
	
	{	"Signs of fear"	    ,"Signs of fear(\312\323\340\303\347\250)"        , "HaQuest\\Quest_terrified_1start_T.msg" , "HaQuest\\Quest_terrified_1end.msg" },  // Signs of fear(สำเร็จ)
	{	"Signs of fear"	    ,"Signs of fear(\312\323\340\303\347\250)"        , "HaQuest\\Quest_terrified_1start_M.msg" , "HaQuest\\Quest_terrified_1end.msg" },  // Signs of fear(สำเร็จ)

	{	"Candy Delivery"	        ,"Candy Delivery(\312\323\340\303\347\250)"         , "HaQuest\\Quest_candy_1start_T.msg"     , "HaQuest\\Quest_candy_1end.msg"   },  // Candy Delivery(สำเร็จ)
	{	"Candy Delivery"	        ,"Candy Delivery(\312\323\340\303\347\250)"         , "HaQuest\\Quest_candy_1start_M.msg"     , "HaQuest\\Quest_candy_1end.msg"   },  // Candy Delivery(สำเร็จ)

	{	"Goblin Hill"	    ,"Goblin Hill(\312\323\340\303\347\250)"       , "HaQuest\\Quest_goblin_1start_T.msg"    , "HaQuest\\Quest_goblin_1end.msg"  },  // Goblin Hill(สำเร็จ)
	{	"Goblin Hill"	    ,"Goblin Hill(\312\323\340\303\347\250)"       , "HaQuest\\Quest_goblin_1start_M.msg"    , "HaQuest\\Quest_goblin_1end.msg"  },  // Goblin Hill(สำเร็จ)
 
	{	"Threats of the Undead"	    ,"Threats of the Undead(\312\323\340\303\347\250)"     , "HaQuest\\Quest_undead_1start_T.msg"    , "HaQuest\\Quest_undead_1end.msg"  },  // Threats of the Undead(สำเร็จ)
	{	"Threats of the Undead"	    ,"Threats of the Undead(\312\323\340\303\347\250)"     , "HaQuest\\Quest_undead_1start_M.msg"    , "HaQuest\\Quest_undead_1end.msg"  },  // Threats of the Undead(สำเร็จ)

	{	"One-eyed Monsters"	,"One-eyed Monsters(\312\323\340\303\347\250)"   , "HaQuest\\Quest_cyclops_1start.msg"     , "HaQuest\\Quest_cyclops_1end.msg" },  // One-eyed Monsters(สำเร็จ)

	{	"A lost Hammer"	    ,"A lost Hammer(\312\323\340\303\347\250)"     , "HaQuest\\Quest_hammer_1start.msg"      , "HaQuest\\Quest_hammer_1end.msg"  },  // A lost Hammer(สำเร็จ)

	{	"Fury's phantasma[1]"	,"Fury's phantasma[2]"           , "HaQuest\\Quest_100State_1.msg"         , "HaQuest\\Quest_100State_2.msg"  },
	{	"Fury's phantasma[3]"	,"Fury's phantasma[4]"           , "HaQuest\\Quest_100State_3.msg"         , "HaQuest\\Quest_100State_4.msg"  },
	{	"Fury's phantasma[5]"	,"Fury's phantasma(\312\323\340\303\347\250)"        , "HaQuest\\Quest_100State_5.msg"         , "HaQuest\\Quest_100State_6.msg"  },  // Fury's phantasma(สำเร็จ)



};



