 /*----------------------------------------------------------------------------*
*	파일툈E:  sinMsg.cpp
*	하는일 :  다른언엉洑 컨버젼을 위해 메세지를 컖E?磯?
*	작성일 :  최종업데이트 4퓖E
*	적성자 :  박상열 
*-----------------------------------------------------------------------------*/	

#include "sinLinkHeader.h"  

sMESSAGEBOX	sMessageBox[100] = {
	{  "  \276\327\351\271\267\325\350\340\241\347\272\344\301\350\276\315 "  },  //   พื้นที่เก็บไม่พอ 
	{  "  \271\351\323\313\271\321\241\340\241\324?"  },  //   น้ำหนักเกิ?
	{  "  \302\321\247\344\301\350\312\322\301\322\303\266\343\252\351\344\315\340\267\301\271\325\351\344\264\351  "  },  //   ยังไม่สามารถใช้ไอเทมนี้ได้  
	{  "  \340\247\324\271\344\301\350\340\276\325\302\247\276\315  "  },  //   เงินไม่เพียงพอ  
	{  "  \344\315\340\267\301\271\325\351\344\301\350\312\322\301\322\303?mix \344\264? "  },  //   ไอเทมนี้ไม่สามาร?mix ได? 
	{  "  \250\323\271\307\271\242\315\247\267\325\350\341\305\241\340\273\305\325\350\302\271\340\241\324\271\242\325\264\250\323\241\321? "  },  //   จำนวนของที่แลกเปลี่ยนเกินขีดจำกั? 
	{  "  \241\322\303\341\305\241\340\273\305\325\350\302\271\266\331\241\302\241\340\305\324\241  "  },  //   การแลกเปลี่ยนถูกยกเลิก  
	{  "  \344\301\350\312\322\301\322\303\266\340\241\347\272Potion \344\264? "  },  //   ไม่สามารถเก็บPotion ได? 
	{  "  \241\322?mix \305\351\301\340\313\305?. "  },  //   กา?mix ล้มเหล?. 
	{  "  \242\315\272\244\330\263\312\323\313\303\321\272 \244\307\322\301\241\303\330\263\322\242\315\247\267\350\322\271!  " },  //   ขอบคุณสำหรับ ความกรุณาของท่าน!  
	{  "  \344\315\340\267\301\343\271\244\305\321\247\312\324\271\244\351\322\301\325\301\322\241\340\241\324\271\344\273 "  },  //   ไอเทมในคลังสินค้ามีมากเกินไป 
	{  "  \344\315\340\267\301\344\301\350\312\322\301\322\303\266 age \344\264? "  },  //   ไอเทมไม่สามารถ age ได? 
	{  "  \344\315\340\267\301\266\331\241\340\273\305\325\350\302\271\241\303\330\263\322\265\303\307\250\312\315\272\315\325\241\244\303\321\351? "  },  //   ไอเทมถูกเปลี่ยนกรุณาตรวจสอบอีกครั้? 
	{  "  \250\323\271\307\271\340\247\324\271\340\241\324\271\242\325\264\250\323\241\321? "  },  //   จำนวนเงินเกินขีดจำกั? 
	{  "  \241\322?aging \305\351\301\340\313\305?"  },  //   กา?aging ล้มเหล?
	{  "  \312\266\324\265\324\265\350\322\247\346\242\315\247\265\321\307\305\320\244\303\266\331\241\305\272\341\305\351? "  },  //   สถิติต่างๆของตัวละครถูกลบแล้? 
	{  "  \344\301\350\301\325\300\322\276  "  },  //   ไม่มีภาพ  
	{  "  \267\350\322\271\312\322\301\322\303\266\305\272\312\266\324\265\324\265\350\322\247\346\344\264\351\244\303\321\351\247\340\264\325\302? " },  //   ท่านสามารถลบสถิติต่างๆได้ครั้งเดีย? 
	{  "  \265\351\315\247\340\273\347\271\312\301\322\252\324\241 clan \340\267\350\322\271\321\351\271\250\326\247\250\320\312\322\301\322\303\266\343\252\351\344\264? "  },  //   ต้องเป็นสมาชิก clan เท่านั้นจึงจะสามารถใช้ได? 
	{  "  \267\350\322\271\265\351\315\247\315\302\331\350\343\271 clan \266\326\247\250\320\312\322\301\322\303\266\343\252\351\344\315\340\267\301\271\325\351\344\264? "  },  //   ท่านต้องอยู่ใน clan ถึงจะสามารถใช้ไอเทมนี้ได? 
	{  "  \303\320\264\321\272\344\315\340\267\301\242\315\247\267\350\322\271\302\321\247\344\301\350\312\322\301\322\303\266\315\321\276\340\241\303\264\344\264? "  },  //   ระดับไอเทมของท่านยังไม่สามารถอัพเกรดได? 
	{  "  \303\320\264\321\272\241\322\303 aging \242\315\247\267\350\322\271\315\302\331\350\267\325\350 -1  "  },  //   ระดับการ aging ของท่านอยู่ที่ -1  
	{  "  \303\320\264\321\272\241\322\303 aging \242\315\247\267\350\322\271\315\302\331\350\267\325\350 -2  "  },  //   ระดับการ aging ของท่านอยู่ที่ -2  
	{  "  \303\320\264\321\272\241\322\303 aging \242\315\247\267\350\322\271\315\302\331\350\267\325\350 +1  "  },  //   ระดับการ aging ของท่านอยู่ที่ +1  
	{  "  \303\320\264\321\272\241\322\303 aging \242\315\247\267\350\322\271\315\302\331\350\267\325\350 +2  " },  //   ระดับการ aging ของท่านอยู่ที่ +2  
	{ "  \244\350?atk speed \242\315?quest item \305\264\305\247  " },
	{ " \344\315\340\267\301\340\244\307?Level Up " },  //  ไอเทมเคว?Level Up 
	{ " \244\350?HP \340\276\324\350\301\242\326\351?15  " },  //  ค่?HP เพิ่มขึ้?15  
	{ "  puzzle \312\301\272\331\303\263\354\341\305\351\307\244\303\321?" },  //   puzzle สมบูรณ์แล้วครั?
	{ "  puzzle \302\321\247\344\301\350\312\301\272\331\303\263\354\244\303\321? " },  //   puzzle ยังไม่สมบูรณ์ครั? 
	{ "  \344\301\350\301\325\344\315\340\267\301\267\325\350\250\320\242\322\302 " },  //   ไม่มีไอเทมที่จะขาย 
	{ "  \344\315\340\267\301\344\264\351\266\331\241\242\322\302\344\273\341\305\351\307  " },  //   ไอเทมได้ถูกขายไปแล้ว  
	{ " \303\351\322\271\271\325\351\344\264\351\266\331\241\273\324\264\344\273\341\305\351\307  " },  //  ร้านนี้ได้ถูกปิดไปแล้ว  
	{ " \344\301\350\312\322\301\322\303\266\313\322\244\271\242\322\302\344\264?" },  //  ไม่สามารถหาคนขายได?
	{ " \250\323\271\307\271\344\301\350\266\331\241\265\351\315?" },  //  จำนวนไม่ถูกต้อ?
	{ "  \244\322\341\303\244\340\265\315\303\354\274\331\351\252\322\302\344\301\350\312\322\301\322\303\266\343\252\351\344\264?" },  //   คาแรคเตอร์ผู้ชายไม่สามารถใช้ได?
	{ "  \244\322\341\303\244\340\265\315\303\354\274\331\351\313?\247\344\301\350\312\322\301\322\303\266\343\252\351\344\264\351 " },  //   คาแรคเตอร์ผู้ห?งไม่สามารถใช้ได้ 
	{ " \244\322\341\303\244\340\265\315\303\354\274\331\351\313?\247\344\301\350\312\322\301\322\303\266\343\252\351\344\315\340\267\301\271\325\351\344\264\351  " },  //  คาแรคเตอร์ผู้ห?งไม่สามารถใช้ไอเทมนี้ได้  
	{ " \244\322\341\303\244\340\265\315\303\354\274\331\351\252\322\302\344\301\350\312\322\301\322\303\266\343\252\351\344\315\340\267\301\271\325\351\344\264? " },  //  คาแรคเตอร์ผู้ชายไม่สามารถใช้ไอเทมนี้ได? 
	{ " \303\322\244\322\242\315\247\344\315\340\267\301\344\264\351\301\325\241\322\303\340\273\305\325\350\302\271\341\273\305? " },  //  ราคาของไอเทมได้มีการเปลี่ยนแปล? 
	{ " \344\301\350\301\325\340\247\324\271\303\322\247\307\321\305\312\323\313\303\321?clan \267\325\350\313?" },  //  ไม่มีเงินรางวัลสำหรั?clan ที่ห?
	{ " \340\305\340\307\305\271\325\351\344\301\350\312\322\301\322\303\266\343\252\351 force orb \344\264? " },  //  เลเวลนี้ไม่สามารถใช้ force orb ได? 
	{ " force orb \266\331\241\343\252\351\315\302\331\350\242\263\320\271\325\351  " },  //  force orb ถูกใช้อยู่ขณะนี้  
	{ "  \241\323\305\321\247\267\264\312\315\272\303\320\272\272 atk pow " },  //   กำลังทดสอบระบบ atk pow 
	{ " \250\272\241\303\320\272\307\271\241\322?force orb " },  //  จบกระบวนกา?force orb 
	{ " stat point \340\276\324\350\301\242\326\351?5 " },  //  stat point เพิ่มขึ้?5 
	{ " skill point \340\276\324\350\301\242\326\351?1 " },  //  skill point เพิ่มขึ้?1 
	{ " stat \341\305?skill point \340\276\324\350\301\242\326\351?5 \341\305?1  " },  //  stat แล?skill point เพิ่มขึ้?5 แล?1  
	{ " stat \341\305?skill point \340\276\324\350\301\242\326\351? \341\305?2  " },  //  stat แล?skill point เพิ่มขึ้? แล?2  
	{ "  \340\312\325\302 exp \250\322\241\241\322\303\265\322\302\305\264\305?1% " },  //   เสีย exp จากการตายลดล?1% 
	{ " HP \340\276\324\350\301\242\326\351?40  "  },  //  HP เพิ่มขึ้?40  
	{ " \267\350\322\271\315\302\331\350\303\320\313\307\350\322\247\267\355\322\340\244\307\312 "  },  //  ท่านอยู่ระหว่างทําเควส 
	{ " \265\321\351\247\341\265\350\303\320\264\321\272 80 \242\326\351\271\344\273 \244\350\322\244\307\322\301\312\322\301\322\303\266\250\320\340\276\324\350\301\340\273\347\271 +7 \267\330\241\346\340\305\340\307? "  },  //  ตั้งแต่ระดับ 80 ขึ้นไป ค่าความสามารถจะเพิ่มเป็น +7 ทุกๆเลเว? 
	{ " \265\321\351\247\341\265\350\303\320\264\321\272 90 \242\326\351\271\344\273 \244\350\322\244\307\322\301\312\322\301\322\303\266\250\320\340\276\324\350\301\340\273\347\271 +10 \267\330\241\346\340\305\340\307? "  },  //  ตั้งแต่ระดับ 90 ขึ้นไป ค่าความสามารถจะเพิ่มเป็น +10 ทุกๆเลเว? 
	{ " \250\355\322\271\307\271\301\315\271\312\340\265\315\303\354\267\325\350\305\350\322\340\273\347\271\244\350\322\265\321\351\247\265\351? "  },  //  จํานวนมอนสเตอร์ที่ล่าเป็นค่าตั้งต้? 
	{ " \344\301\350\274\350\322\271\241\322\303\267\264\312\315\272\340\271\327\350\315\247\250\322\241\340\305\302\340\307\305\322\267\325\350\241\355\322\313\271\264  "  },  //  ไม่ผ่านการทดสอบเนื่องจากเลยเวลาที่กําหนด  
	{ " \250\323\271\307\271\267\313\322\303\303\321\272\250\351\322\247\340\241\324\271\341\305\351\307  " },  //  จำนวนทหารรับจ้างเกินแล้ว  
	{ " \344\315\340\267\301\271\325\351\340\273\347\271\312\241\324\305\344\315\340\267\301\267\325\350\241\323\305\321\247\343\252\351\315\302\331\350\343\271\273\321\250\250\330\272\321\271  " },  //  ไอเทมนี้เป็นสกิลไอเทมที่กำลังใช้อยู่ในปัจจุบัน  
	{ " \302\351\322\302\344\273 bless castle \344\301\350\344\264\351 (\241\303\330\263\322\265\303\307\250\312\315\272 client version)  " },  //  ย้ายไป bless castle ไม่ได้ (กรุณาตรวจสอบ client version)  
	{ " \344\315\340\267\301\271\325\351\344\301\350\312\322\301\322\303\266\242\322\302\343\271\303\351\322\271\312\350\307\271\265\321\307\344\264\351  " },  //  ไอเทมนี้ไม่สามารถขายในร้านส่วนตัวได้  
	{ " \344\301\350\301\325\340\247\324\271\300\322\311\325\267\325\350\250\320\303\321\272\344\264\351\343\271\242\263\320\271\325\351  " },  //  ไม่มีเงินภาษีที่จะรับได้ในขณะนี้  
	{ " \267\350\322\271\344\264\351\265\315\272\341\272\272\312\315\272\266\322\301\344\273\341\305\351? " },  //  ท่านได้ตอบแบบสอบถามไปแล้? 
	{ " \242\315\272\244\330\263\267\325\350\252\350\307\302\265\315\272\341\272\272\312\315\272\266\322? " },  //  ขอบคุณที่ช่วยตอบแบบสอบถา? 
	{ " \253\325\305\344\315\340\267\301\271\325\351\344\301\350\340\242\351\322\241\321\272\340\305\340\307\305  " },  //  ซีลไอเทมนี้ไม่เข้ากับเลเวล  
	{ " \265\321\351\247\344\315\340\267\301\343\313\301\350\341\305\351? " },  //  ตั้งไอเทมใหม่แล้? 
	{ "  \344\264\351\303\321\272\252\321\302\252\271\320\343\271\241\322\303\265\350\315\312\331\351\241\321\272 Fury  " },  //   ได้รับชัยชนะในการต่อสู้กับ Fury  
	{ "  \276\350\322\302\341\276\351\343\271\241\322\303\265\350\315\312\331\351\241\321?Fury. " },  //   พ่ายแพ้ในการต่อสู้กั?Fury. 
	{ "  \344\264\351\303\321\272\344\315\340\267\301\340\273\347\271\303\322\247\307\321? " },  //   ได้รับไอเทมเป็นรางวั? 
	{ "  \344\315\340\267\301\344\301\350\312\322\301\322\303\266\343\252\351\303\350\307\301\241\321\271\344\264? " },  //   ไอเทมไม่สามารถใช้ร่วมกันได? 
};


sMESSAGEBOX2 sMessageBox2[20] = {
	{  "  \267\350\322\271\265\351\315\247\241\322\303\253\327\351\315\344\315\340\267\301\271\325? "  ,  "  \241\325\350\315\321\271?  " },  //   ท่านต้องการซื้อไอเทมนี?  |   กี่อัน?  
	{  "  \267\350\322\271\265\351\315\247\241\322\303\242\322\302\344\315\340\267\301\271\325\351  "  ,  "  \241\325\350\315\321\271?  "  },  //   ท่านต้องการขายไอเทมนี้   |   กี่อัน?  
	{  "  \267\350\322\271\265\351\315\247\241\322\303\267\324\351\247\344\315\340\267\301\271\325? "  ,  "  \241\325\350\315\321\271?  " },  //   ท่านต้องการทิ้งไอเทมนี?  |   กี่อัน?  
	{  "  \267\350\322\271\265\351\315\247\241\322\303\267\324\351\247\340\247\324? "  ,  "  \250\323\271\307\271\340\267\350\322\344? "  },  //   ท่านต้องการทิ้งเงิ?  |   จำนวนเท่าไ? 
	{  " "  ,  " "  },
	{  " \267\350\322\271\265\351\315\247\241\322\303\342\315\271\340\247\324\271  "  ,  "  \250\323\271\307\271\340\267\350\322\344? "  },  //  ท่านต้องการโอนเงิน   |   จำนวนเท่าไ? 
	{  " \267\350\322\271\265\351\315\247\241\322\303\340\241\347\272\340\247\324? "  ,  "  \250\323\271\307\271\340\267\350\322\344? "  },  //  ท่านต้องการเก็บเงิ?  |   จำนวนเท่าไ? 
	{  " \267\350\322\271\265\351\315\247\241\322\303\266\315\271\340\247\324\271  "  ,  "  \250\323\271\307\271\340\267\350\322\344? "  },  //  ท่านต้องการถอนเงิน   |   จำนวนเท่าไ? 
	{ " \250\320\253\327\351\315  " , " \264\322\307\241\325\350\264\307?  "  },  //  จะซื้อ   |  ดาวกี่ดว?  
	{ " \250\320\272\303\324\250\322\244 " , "  \340\247\324\271\340\267\350\322\344\303?  "  },   //  จะบริจาค  |   เงินเท่าไร?  
	{ " \250\320\303\320\272\330  " , "  \340\247\324\271\341\305\320\344\315\340\267\301?  "  },   //  จะระบุ   |   เงินและไอเทม?  
	{ " \250\320\253\327\351\315\344\315\340\267? " , "  \241\325\350\315\321\271?  " },  //  จะซื้อไอเท?  |   กี่อัน?  
	{ " \250\320\303\321\272\340\247\324\271\303\322\247\307\321? " , "  \340\267\350\322\344\303?  " },  //  จะรับเงินรางวั?  |   เท่าไร?  
	{ " \250\320\253\327\351\315\344\315\340\267? " , " \313\303\327\315\344\301?  " },   //  จะซื้อไอเท?  |  หรือไม?  
	{ " \250\320\253\327\351\315\344\315\340\267? " , " \313\303\327\315\344\301?  " }, //อันที่14 ไอ้อันนี้แหละคอยดูซี?  //  จะซื้อไอเท?  |  หรือไม?  
	{ " \250\320\340\272\324\241  " , "  \340\247\324\271\340\267\350\322\344\303  " },//เบิกเงินสงครามตีปราสาท  //  จะเบิก   |   เงินเท่าไร  
	{ " \250\320\253\327\351\315  " , " \267\313\322\303\303\321\272\250\351\322\247\241\325\350\244\271?  "  },  //  จะซื้อ   |  ทหารรับจ้างกี่คน?  
};

sMESSAGEBOX3 sMessageBox3[MESSAGE3_MAX] = {
	{  "  \267\350\322\271\250\320  "  ,  "  \340\303\325\302\271\312\241\324\305\271\325\351 ?  "  },  //   ท่านจะ   |   เรียนสกิลนี้ ?  
	{  "  \267\350\322\271\265\351\315\247\241\322? "  ,  "  \340\305\327\350\315\271\303\320\264\321? "  }, //요건 템스크론
	{  "  \267\350\322\271\250\320  "  ,  "  \303\321\272\300\322\303\320\241\324\250\271\325?  "  },  //   ท่านจะ   |   รับภาระกิจนี?  
	{  "  \267\350\322\271\265\351\315\247\241\322? "  ,  "  \305\272\244\350\322\312\241\324\305\267\321\351\247\313\301\264?  "  },  //   ท่านต้องกา?  |   ลบค่าสกิลทั้งหมด?  
	{  "  \241\350\315\271\267\325\350\250\320\340\303\325\302\271  "  ,  "  \267\350\322\271\265\351\315\247\250\350\322\302\340\247\324\271\241\350\315\271!  "  },  //   ก่อนที่จะเรียน   |   ท่านต้องจ่ายเงินก่อน!  
	{  "  \267\350\322\271\265\351\315\247\241\322? "  ,  "  \305\272\244\350\322\312\266\324\265\324\267\321\351\247\313\301? "  },  //   ท่านต้องกา?  |   ลบค่าสถิติทั้งหม? 
	{  "  \267\350\322\271\250\320  "  ,  "  \303\321\272\300\322\303\320\241\324\250\271\325??  "  }, //ฟไฐว ธ๐ถ๓ภฬฟย  //   ท่านจะ   |   รับภาระกิจนี??  
	{  "  \267\350\322\271\250\320  "  ,  "  \303\321\272\344\315\340\267\301\252\324\351\271\271\325?  "  }, //PostBox  //   ท่านจะ   |   รับไอเทมชิ้นนี?  
	{  "  \267\350\322\271\250\320\305\247\267\320\340\272\325\302?  "  , " Union Core \343\271\252\327\350\315\267\350\322\271? " },  //   ท่านจะลงทะเบีย?   |  Union Core ในชื่อท่าน? 
	{ " \267\350\322\271\250\320 " , "  \303\321\272\344\315\340\267\301\271\325? " },  //  ท่านจะ  |   รับไอเทมนี? 
	{ " \267\350\322\271\265\351\315\247\241\322\303\250?" , "  \307\322\273\344\273\267\325\350\271\321\350\271? " },  //  ท่านต้องการจ? |   วาปไปที่นั่น? 
	{ " "  , "  \241\303\330\263\322\343\312\350\250\323\271\307?" },  //   กรุณาใส่จำนว?
	{ "  \267\350\322\271\265\351\315\247\241\322\303\253\327\351?" , "  Star? " },  //   ท่านต้องการซื้?
	{ "  \267\350\322\271\265\351\315\247\241\322\303\242\322\302 " , "  \344\315\340\267\301\271\325\351? " },  //   ท่านต้องการขาย  |   ไอเทมนี้? 
	{  "  \267\350\322\271\250\320\303\321?"  , "  \340\244\307\312\271\325? "  }, //요건 3차전업
	{  " \267\350\322\271\250\320\250\350\322\302 "  , "  \244\350\322\272\303\324\250\322\244\313\303\327\315\344\301\350? "  }, //아이템 팔기
	{  "  \241\303\330\263\322\241\323\313\271\264?\315\244\307\322?"  , "  \273\303\320\241\322\310\312\323\313\303\321\272\303\351\322\271\264\351\307\302\244\303\321\272 "  }, //아이템 팔기
	{  "  \267\350\322\271\250\320\341\305\241\340\273\305\325\350\302\271 "  , "  \264\351\307\302\344\315\340\267\301\271\325\351? "  }, //퍼즐로 아이템교환
	{  "  \267\350\322\271\250\320\253\327\351\315 "  , "  \344\315\340\267\301\271\325\351? "  }, //개인상점 아이템사기
	{  "  \267\350\322\271\250\320\302\241\340\305\324\241 "  , "  \241\322\303\305\247\267\320\340\272\325\302\271? "  }, //개인상점 아이템 등록 취소
	{  "  \267\350\322\271\265\351\315\247\241\322\303\250?"  , "  \340\273\305\325\350\302\271\344\315\340\267\301\271\325\351\313\303\327\315\344\301\350? "  }, //바벨의뿔 아이템으로 교환하기
	{  "  \267\350\322\271\265\351\315\247\241\322?"  , "  \340\273\305\325\350\302\271\344\315\340\267\301? "  },  //   ท่านต้องกา? |   เปลี่ยนไอเทม? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \301\315\247\313\322\340\244\307\312\315\302\331\350\340\313\303? "  }, //Level30  //   ท่านกำลั? |   มองหาเควสอยู่เหร? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \301\315\247\313\322\340\244\307\312\315\302\331\350\340\313\303? "  }, //Level55  //   ท่านกำลั? |   มองหาเควสอยู่เหร? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \301\315\247\313\322\340\244\307\312\315\302\331\350\340\313\303? "  }, //Level55_2  //   ท่านกำลั? |   มองหาเควสอยู่เหร? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \301\315\247\313\322\340\244\307\312\315\302\331\350\340\313\303? "  }, //Level70  //   ท่านกำลั? |   มองหาเควสอยู่เหร? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \301\315\247\313\322\340\244\307\312\315\302\331\350\340\313\303? "  }, //Level80  //   ท่านกำลั? |   มองหาเควสอยู่เหร? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \301\315\247\313\322\340\244\307\312\315\302\331\350\340\313\303? "  }, //Level85  //   ท่านกำลั? |   มองหาเควสอยู่เหร? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \301\315\247\313\322\340\244\307\312\315\302\331\350\340\313\303? "  }, //Level90  //   ท่านกำลั? |   มองหาเควสอยู่เหร? 
	{  "  \340\267\340\305\276\315\303\354\267\344?"  , "  \313\303\327\315\344\301? "  },  //   เทเลพอร์ทไ? |   หรือไม? 
	{  "  \250\320\303\321\272\340\244\307?"  , "  \313\303\327\315\344\301? "  },  //Level80  //   จะรับเคว? |   หรือไม? 
	{  "  \250\320\303\321\272\340\244\307?"  , "  \313\303\327\315\344\301?"  },  //Level90_2  //   จะรับเคว? |   หรือไม?
	{  "  \250\320\303\321\272\340\244\307?"  , "  \313\303\327\315\344\301?"  },  //เปลี่ยนอาชีพรอ?  //   จะรับเคว? |   หรือไม?
	{  "  \250\320\340\273\305\325\350\302\271\315\322\252\325\276  "  , "  \313\303\327\315\344\301? "  }, //เปลี่ยนอาชีพรอ?  //   จะเปลี่ยนอาชีพ   |   หรือไม? 
	{  "  \250\320\341\305\241\340\273\347?"  , "  \344\315\340\267\301\313\303\327\315\344\301\350? "  },//แลกคริสตัล7ก้อนเป็นไอเท?  //   จะแลกเป็? |   ไอเทมหรือไม่? 
	{  "  \340\267\340\305\276\315\303\354\267\344?"  , "  \313\303\327\315\344\301?"  },  //   เทเลพอร์ทไ? |   หรือไม?
	{  "  \250\320\253\327\351\315 "  ,  "  \244\303\324\312\265\321\305\267\322\307\340\307\315\303?"  },   //   จะซื้อ  |   คริสตัลทาวเวอร?
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  }, //A  //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  }, //B  //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  }, //C  //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  }, //D  //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  }, //E  //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  }, //F  //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  }, //G  //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\241\323\305\321?"  , "  \343\252\351\344\315\340\267\301? "  }, //구매 아이템 사용
	{  "  \267\350\322\271\241\323\305\321?"  , "  \303\321\272\340\244\307? "  },//100LVฤ๙ฝบฦฎ ผ๖วุฟฉบฮ   //   ท่านกำลั? |   รับเคว? 
	{  "  \267\350\322\271\265\351\315\247\241\322?"  , "  \303\321\272\344\315\340\267\301? "  }, //100LV아이템 
	{  "  \267\350\322\271\265\351\315\247\241\322?"  ,  "  \302\351\322\302\344\273\267\325?Battle Zone? "  }, //100LVฤ๙ฝบฦฎ ด๋ทรภๅ ภฬตฟฟฉบฮ  //   ท่านต้องกา? |   ย้ายไปที?Battle Zone? 
	{"\267\316 \305\332\267\271\306\367\306\256", "\307\317\275\303\260\332\275\300\264\317\261\356?"},   //텔레포트 코어 사용
	{"\276\306\300\314\305\333\300\270\267\316", "\261\263\310\257\307\317\275\303\260\332\275\300\264\317\261\356? "}, //빛나는가루 아이템으로 교환하기
	{"\305\332\267\271\306\367\306\256", "\307\317\275\303\260\332\275\300\264\317\261\356?"},    //횡스크롤 필드
	{"\276\306\300\314\305\333\300\273", "\301\246\300\333 \307\317\275\303\260\332\275\300\264\317\261\356?"}, // pluto 제작 메세지
	{"\305\332\267\271\306\367\306\256", "\307\317\275\303\260\332\275\300\264\317\261\356?"},    // pluto 추가 던전 끝없는 탑 MESSAGE_TELEPORT_DUNGEON
};

char *SkillMaster[4] = {
	 "  \340\303\325\302\271\312\241\324?" ,  //   เรียนสกิ?
	 "  \340\273\305\325\350\302\271\244\305\322?" ,  //   เปลี่ยนคลา?
	 "  \315\315\241\250\322\241\340\241?"   //   ออกจากเก?
};

char *SkillMaster2[4] = {
	 " "  ,
	 " "  ,
	 " "  

};

char *ReStartMsg[4] = {
	 "  \340\303\324\350\301\250\322\241 Field " ,  //   เริ่มจาก Field 
	 "  \340\303\324\350\301\250\322\241\340\301\327\315?" ,  //   เริ่มจากเมือ?
	 "  \315\315\241\250\322\241\340\241?" ,  //   ออกจากเก?
	 "  XP \344\301\350\340\276\325\302\247\276\315 "   //   XP ไม่เพียงพอ 

};
char *ReStartMsg2[4] = {
	 "  \244\350\322\273\303\321\272Gold/XP 1% " ,  //   ค่าปรับGold/XP 1% 
	 " " ,
	 " " ,
	 "  \266\351\322\250\320\340\303\324\350\301\250\322?Field " ,  //   ถ้าจะเริ่มจา?Field 

};

char *SkillUseInfoText[10]= {  "  \340\303\325\302\271\303\331\351\267\321\241\311?" , "  \241\303\330\263\322\340\305\327\315\241\267\321\241\311?" , "  \267\325\350\250\320\340\303\325\302\271 " , "  Skill Point \344\301\350\276?" , "  \267\325\350\250\320\340\303\325\302\271 "  };  //   เรียนรู้ทักษ? |   กรุณาเลือกทักษ? |   ที่จะเรียน  |   Skill Point ไม่พ? |   ที่จะเรียน 
char *sinMsgSkillPoint =  "  Skill Points : %d " ;
char *sinMsgEliteSkillPoint = "  Elite Skill Points : %d " ;
char *sinStateName[5]={ "  H P : %d/%d " , "  M P : %d/%d " , "  STM : %d/%d " , "  X P : %d/%d " , "  X P : %dM/%dM " };


char *TownName[3] = { "  \340\303\325\302\241\241\305\321\272\340\301\327\315\247 Ricarten\r " , "  \340\303\325\302\241\241\305\321\272\340\301\327\315\247 Navisko\r " , "  \340\303\325\302\241\241\305\321\272\340\301\327\315\247 Pillai\r " };  //   เรียกกลับเมือง Ricarten\r  |   เรียกกลับเมือง Navisko\r  |   เรียกกลับเมือง Pillai\r 


char *sinAbilityName[50] = {  "  ATK Power:  \r "  ,  "  Weapon Speed:  \r "  ,  "  Range:  \r "  ,  "  Critical:  \r "  ,  "  Defense Rating:  \r "  ,  "  ATK Rating:  \r "  ,
			  "  Absorb :  \r "  ,  "  Block :  \r "  ,  "  Speed:  \r "  ,  "  Integrity:  \r "  ,  "  \277\327\351\271 MP :  \r "  ,  "  \277\327\351\271 HP :  \r "  ,  //   ฟื้น MP :  \r  |   ฟื้น HP :  \r 
			  "  \277\327\351\271 STM :  \r "  ,  "  Organic Type:  \r "  ,  "  Nature Type:  \r "  ,  "  Flame Type:  \r "  ,  "  Frost Type:  \r "  ,  "  Lightning Type:  \r "  ,  "  Poison Type: \r "  ,  //   ฟื้น STM :  \r 
			  "  Water Type:  \r "  ,  "  Wind Type:  \r "  ,  "  HP Regen:  \r "  ,  "  MP Regen: \r  "  ,  "  STM Regen: \r "  ,  "  \340\276\324\350\301HP: \r "  ,  //   เพิ่มHP: \r 
			  "  \340\276\324\350\301MP:  \r "  ,  "  \340\276\324\350\301STM:  \r "  ,  "  \340\241\347\272 Potion \344\264? \r "  ,  "  \265\351\315\247\241\322\303Level:  \r  "  ,  "  \265\351\315\247\241\322\303Strength:  \r "  ,  "  \265\351\315\247\241\322\303Willpower:  \r "  ,  //   เพิ่มMP:  \r  |   เพิ่มSTM:  \r  |   เก็บ Potion ได? \r  |   ต้องการLevel:  \r   |   ต้องการStrength:  \r  |   ต้องการWillpower:  \r 
			  "  \265\351\315\247\241\322\303Talent:  \r "  ,  "  \265\351\315\247\241\322\303Agility:  \r "  ,  "  \265\351\315\247\241\322\303Health:  \r "  };  //   ต้องการTalent:  \r  |   ต้องการAgility:  \r  |   ต้องการHealth:  \r 
			
char *sinSpecialName[50] = { "  Spec. ATK SPD:  \r  " , "  Spec. CRIT:  \r  " , "  Spec. DEF RTG:  \r  " , "  Spec. ABS RTG:  \r  " ,
			 "  Spec. BLK RTG:  \r  " , " Magic APT:  \r " , " Spec. SPD:  \r  " , "  Spec. Organic:  \r  " , "  Spec. Nature:  \r  " ,
			 "  Spec. Flame:  \r  " , "  Spec. Frost:  \r  " , "  Spec. Lightning:  \r  " , "  Spec. Poison:  \r " , "  Spec. Water:  \r  " , "  Spec. Wind:  \r  " ,
			 "  Spec. ATK POW:  \r  " ,  "  Spec. ATK RTG:  \r  " , "  Spec. RNG:  \r  " , "  Spec. Organic ATK:  \r  " , "  Spec. Nature ATK:  \r  " , "  Spec. Flame ATK:  \r  " , "  Spec. Frost ATK:  \r  " ,
			 "  Spec. Lightning ATK:  \r  " , "  Spec. Poison ATK:  \r  " , "  Spec. Water ATK:  \r  " , "  Spec. Wind ATK:  \r  " , "  Max HP Boost:  \r  " , "  Max MP Boost:  \r  " ,
			 "  \277\327\351\271 HP:  \r  " , "  \277\327\351\271 MP:  \r  " , "  \277\327\351\271 STM:  \r  " , " \303\322\244\322\242\322? \r " , " \303\322\244\322\253\327\351\315:  \r " };  //   ฟื้น HP:  \r   |   ฟื้น MP:  \r   |   ฟื้น STM:  \r   |  ราคาขา? \r  |  ราคาซื้อ:  \r 


char *SpecialName3 =  "  %s Spec. \r " ;
char *MixResultTitle = "  \274\305\242\315\247\241\322\303 mix\344\315\340\267?"  ;  //   ผลของการ mixไอเท?
char *NowLevelText = "  \340\305\340\307\305\273\321\250\250\330\272\321?\r "  ;  //   เลเวลปัจจุบั?\r 
char *NextLevelText = "  \340\305\340\307\305\266\321\264\344\273 \r "  ;  //   เลเวลถัดไป \r 

char *NormalAttckName = "  Default Attack " ;
char *RequirLevel =  " %s (\265\351\315\247\241\322\303LVL : %d)\r " ;  //  %s (ต้องการLVL : %d)\r 
char *UseItemGroupName =  " \344\315\340\267\301\267\325\350\312\322\301\322\303\266\343\252\351\303\350\307\301\241\321\272\267\321\241\311\320\271\325\351\344\264?\r " ;  //  ไอเทมที่สามารถใช้ร่วมกับทักษะนี้ได?\r 

char *PoisonName = "  Poison Type:\r "  ;
char *FireName = "  Flame Type:\r "  ;
char *AttackAreaName = "  \303\320\302\320\342\250\301\265?\r "  ;  //   ระยะโจมต?\r 
char *Attack_RateName = "  \244\307\322\301\341\301\350\271\302\323 \r "  ;  //   ความแม่นยำ \r 
char *Max_DamageIncre = "  \276\305\321\247\342\250\301\265\325\312\331\247\312\330?\r "  ;  //   พลังโจมตีสูงสุ?\r 
char *DamageAddName = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325: \r "  ;  //   เพิ่มพลังโจมตี: \r 
char *Attack_SpeedAdd = "  \340\276\324\350\301\244\307\322\301\340\303\347\307\342\250\301\265\325: \r "  ;  //   เพิ่มความเร็วโจมตี: \r 
char *IncreBlock = "  \340\276\324\350\301\315\321\265\303\322\241\322\303\273\351\315\247\241\321\271: \r "  ;  //   เพิ่มอัตราการป้องกัน: \r 
char *CountinueTime = "  \303\320\302\320\340\307\305\322: \r "  ;  //   ระยะเวลา: \r 
char *UseManaName = "  \343\252?MP: \r "  ;  //   ใช?MP: \r 
char *DamageName = "  \276\305\321\247\342\250\301\265? \r "  ;  //   พลังโจมต? \r 
char *ShootingRangeName = "  \303\320\302\320: \r "  ;
char *IncreAsorb = "  \305\264\315\321\265\303\322\244\307\322\301\340\312\325\302\313\322\302\250\322\241\241\322\303\342\250\301\265?\r "  ;  //   ลดอัตราความเสียหายจากการโจมต?\r 
char *SecName = " \307\324 "  ;
char *PlusDamageName = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325 \r "  ;  //   เพิ่มพลังโจมตี \r 
char *HitNumName = "  \250\323\271\307\271\244\303\321\351\247 : \r "  ;  //   จำนวนครั้ง : \r 
char *DecreLifeName = "  HP \305\264 : \r "  ;
char *Attck_RateAdd = "  \244\350\322\340\276\324\350\301\340\265\324\301\244\307\322\301\341\301\350\271\302\323 : \r  "  ;  //   ค่าเพิ่มเติมความแม่นยำ : \r  
char *Add_CriticalName = "  \340\276\324\350?Critical : \r "  ;  //   เพิ่?Critical : \r 
char *Push_AreaName = "  Push-back Length : \r "  ;
char *FireAttackDamageAdd =  "  Flame ATK : \r "  ;
char *IceName = "  Frost Property : \r "  ;
char *IceAttackDamageAdd = "  Frost ATK : \r "  ;
char *StuneRate = "  % Stun : \r "  ;
char *DefenseRateIncre = "  \340\276\324\350\301\244\350\322\315\321\265\303\322\241\322\303\273\351\315\247\241\321?\r "  ;  //   เพิ่มค่าอัตราการป้องกั?\r 
char *WeaponSizeName =  "  \340\276\324\350\301\242\271\322?\r "  ;  //   เพิ่มขนา?\r 
char *HwakRotationNum = "  Hawk Rotations:\r "  ;
char *WeaponSpeedAddName  = "  \340\276\324\350\301\244\307\322\301\340\303\347\307\315\322\307\330\270:\r "  ;  //   เพิ่มความเร็วอาวุธ:\r 
char *IncreAttack_RateName = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325:\r "  ;  //   เพิ่มพลังโจมตี:\r 
char *ShootingNumName = "  \250\323\271\307?Shots:\r "  ;
char *SeriesShootingCount = "  \302\324\247\265\350\315\340\271\327\350\315\247 :\r "  ;  //   ยิงต่อเนื่อง :\r 
char *UseStaminaName = "  \343\252?Stamina :\r "  ;  //   ใช?Stamina :\r 
char *MasterSkillMoneyName = "  \303\322\244\322\267\321\241\311?\r "  ;

char *ItemAgingResult;		// << Add Point

char *sinGold = " %d Gold " ;
char *sinGiveItem5 =  "  Gift Item\r " ;
char *sinCopyItem5 =  "  Copied Item\r " ;
char *sinNum7 =  " \303\315  " ;
char *sinSkillPointName =  "  Skill Point " ;	// << Add Point
char *sinG_Pike_Time3 =  "  Frozen Time:\r " ;	// << Add Point
//char *sinItemLimitTimeOverMsg =  "  ไอเทมหมดอายุแล้ว\r  " ;
//char *sinDeadSongPyeunEat =  "  ไอ้หยา! บูดซะแล้? " ;
char *sinItemLimitTimeOverMsg = "  \313\301\264\315\322\302\330\341\305\351\307\244\350\320 \r "  ;  //   หมดอายุแล้วค่ะ \r 
char *sinDeadSongPyeunEat = "  \307\351\322\313\301\264\315\322\302\330\253\320\341\305\351\307!  "  ;  //   ว้าหมดอายุซะแล้ว!  
char *SmeltingResultTitle = "\276\306\300\314\305\333 \301\246\267\303 \260\341\260\372";		// pluto 제련
char *ManufactureResultTitle = "\276\306\300\314\305\333 \301\246\300\333 \260\341\260\372";	// pluto 제작

/////////////////// 모라이온 스킬 Text추가 
char *sinMaxDamageAdd = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325\312\331\247\312\330\264 + \r "  ;  //   เพิ่มพลังโจมตีสูงสุด + \r 
char *sinDamagePiercing = "  (Piercing attack)\r "  ;
char *sinAddStamina = "  \340\276\324\350\301stamina: \r "  ;  //   เพิ่มstamina: \r 
char *sinAddLife = "  \277\327\351\271 HP: \r "  ;  //   ฟื้น HP: \r 
//char *sinPartyHealDoc = " If in party, experience pts will be added:\ as much as 1/3 of life recovered:\r "  ;
char *sinDamageUndead50 = "  \340\276\324\350\301\244\307\322\301\340\312\325\302\313\322\302 50% \341\241?Undead :\r "  ;  //   เพิ่มความเสียหาย 50% แก?Undead :\r 
char *sinNumCount2 = "  number:\r "  ;
char *sinNumCount3 = " \315\321?\r "  ;  //  อั?\r 
char *sinDecreDamage = "  \305\264 damage:\r "  ;
char *sinConvert4 = "  conversion rate:\r "  ;
char *sinIncreElement = "  \340\276\324\350?Element feature:\r "  ;  //   เพิ่?Element feature:\r 
char *sinPartyIncreElement = "  \276\305\321\247\270\322\265\330\242\315\247\312\301\322\252\324\241\343\271\273\322\303\354\265\325\351\340\276\324\350\301\242\326\351?50% \r "  ;  //   พลังธาตุของสมาชิกในปาร์ตี้เพิ่มขึ้?50% \r 
char *sinFireBallDamage2 = "  (100% damage to the targeted enemy)\r "  ;
char *sinFireBallDamage3 = "  (targeted area 60 (1/3 damage))\r "  ;
char *sinAddDamage7 = "  \340\276\324\350\301damage : \r "  ;  //   เพิ่มdamage : \r 
char *PlusDamageWeapon = "  \315\322\307\330?"  ;  //   อาวุ?
char *SparkDamage = "  \342\250\301\265\325\265\350\315\315\321?\r "  ;  //   โจมตีต่ออั?\r 
char *SparkNum7 = "  \250\323\271\307\271\163park max:\r "  ;
char *StunRage = "  \303\320\302\320 Stun : \r "  ;
char *RecvPotion7 =  "  \241\325\350\242\307\264 " ;  //   กี่ขวด 

//모라이온 2차스킬
char *PartyArea7 =  "  \303\320\302\320 Party:\r "  ;
char *Area17 =  "  \303\320\302\320:\r "  ;
char *AddAttack_Rate9 =  "  \244\307\322\301\341\301\350\271\302\323 \r "  ;  //   ความแม่นยำ \r 
char *PiercingRange =  "  \303\320\302\320 Piercing: \r "  ;
char *IncreDefense = "  \340\276\324\350\301\244\350\322\273\351\315\247\241\321?\r "  ;  //   เพิ่มค่าป้องกั?\r 
char *AddShootingRange = "  \340\276\324\350\301\303\320\302\320\241\322\303\302\324?\r "  ;  //   เพิ่มระยะการยิ?\r 
char *LifeAbsorb = "  Life absorb.: \r "  ;
char *FireDamage = "  Fire Damage: \r "  ;
char *IceDamage = "  Ice Damage: \r "  ;
char *LightningDamage = "  Lighting Damage: \r "  ;
char *AddManaRegen = "  \340\276\324\350\301\315\321\265\303\322\241\322\303\277\327\351\271\244\327\271 Mana: \r "  ;  //   เพิ่มอัตราการฟื้นคืน Mana: \r 
char *LightNum = "  # of Lighting: \r "  ;
char *ReturnDamage = "  \312\320\267\351\315\271\276\305\321\247\342\250\301\265? \r "  ;  //   สะท้อนพลังโจมต? \r 
char *Area18 = "  \303\320\302\320\244\303\315\272\244\305\330\301: \r "  ;  //   ระยะครอบคลุม: \r 
char *IncreMana5 = "  \340\276\324\350\301Mana: \r "  ;  //   เพิ่มMana: \r 
char *Area19 = "  \303\320\302\320\244\303\315\272\244\305\330\301: \r "  ;  //   ระยะครอบคลุม: \r 
char *HelpTitle8 = "  \252\350\307\302\340\313\305\327?"  ;  //   ช่วยเหลื?
char *QuestTitle8 = "  \340\244\307\312 "  ;  //   เควส 
char *ResearchTitle8 = "  \341\272\272\312\315\272\266\322?"  ;  //   แบบสอบถา?
char *TeleportTitle8 = "  TELEPORT "  ;

char *IncreWeaponAttack_RateName = "  \340\276\324\350\301\244\307\322\301\341\301\350\271\302\355\322: \r "  ;  //   เพิ่มความแม่นยํา: \r 
char *AddMaxDamage = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325\312\331\247\312\330\264: \r "  ;  //   เพิ่มพลังโจมตีสูงสุด: \r 
char *LinkCoreName =  "  \307\322\303\354\273\344\273\302\321\247\312\301\322\252\324\241\343\271\341\244\305\271  \r " ;  //   วาร์ปไปยังสมาชิกในแคลน  \r 
char *DesLinkCore =  "  \252\327\350\315: " ;  //   ชื่อ: 
char *Itemul =  "  \344\315\340\267?" ;  //   ไอเท?
char *ItemRecvOk =  "  \267\350\322\271\265\351\315\247\241\322\303\303\321\272? " ;  //   ท่านต้องการรับ? 
char *Money5 =  "  Gold " ;
char *Exp5 =  "  \244\350\322\273\303\320\312\272\241\322\303\263?" ;  //   ค่าประสบการณ?
char *WingItemName[] = { "  Metal Wing  " , "  Silver Wing  " , "  Gold Wing  " , "  Diamond Wing  "  , "  Chaos Wing  " };
char *WarpGateName[] = { "  Warp Gate  " , "  Ricarten  " , "  Pillai Town  " , "  Land of Dusk  " , "  Bamboo Forest  " , "  Ruinen Village  " , "  Navisko town  " , "  Forbidden Land  " ,  "  Eura Village  "  };
char *sinWarningName5 =  "  Warning!!! " ;
char *ClanCristalName =  "  \341\244\305\271\244\303\324\312\265\321?\r " ;  //   แคลนคริสตั?\r 
char *NowMyShopSell =  "  \241\323\305\321\247\242\322\302\315\302\331\350 \r " ;  //   กำลังขายอยู่ \r 
char *SecretNumName =  "  \241\303\330\263\322\343\312\350\313\301\322\302\340\305\242\303\313\321?" ;  //   กรุณาใส่หมายเลขรหั?
char *MyShopExpDoc7 =  "  \303\351\322\271\244\351?" ;  //   ร้านค้?
char *NotAgingItem2 =  "  \344\315\340\267\301\271\325\351\344\301\350\312\322\301\322\303?age \344\264?" ;  //   ไอเทมนี้ไม่สามาร?age ได?
char *ExpPercent2 =  "  \244\350\322\273\303\320\312\272\241\322\303\263?%d.%d%s " ;  //   ค่าประสบการณ?%d.%d%s 
char *ExpPercent3 = "  \244\350\322\273\303\320\312\272\241\322\303\263?%d.0%d%s "  ;  //   ค่าประสบการณ?%d.0%d%s 
char *Mutant7 =  "  Mutant " ;
char *Mechanic7 =  "  Mechanic " ;
char *Demon7  =  "  Demon " ;
char *Nomal7  =  "  Normal  " ;
char *Undead7  = "  Undead "  ;
char *MonsterAddDamage2 =  "  \340\276\324\350?(Damage)\r " ;  //   เพิ่?(Damage)\r 
char *MonsterAddDamageFire =  "  \340\276\324\350?Fire Damage\r " ;  //   เพิ่?Fire Damage\r 

//별아이템
char *HoldStarNumDoc = "  \250\323\271\307?Star \267\325\350\301\325\315\302\331?"  ;  //   จำนว?Star ที่มีอยู?
char *StarItemBuy7 = "  \253\327\351\315 Star \344\315\340\267?"  ;  //   ซื้อ Star ไอเท?
char *ChangeMoney7 = "  (Star 1 \315\321?\303\322\244\322 : 100000 Gold) "  ;   //   (Star 1 อั?ราคา : 100000 Gold) 
char *HaWarpGateName[] = {  "  Bless Castle  "  ,};
char *FallGameName = "\300\317\261\327\267\257\301\370 \275\243";


//3차 스킬
char *LightningDamage2 = "  Lightning Damage:\r "  ;
char *SheildDefense = "  \340\276\324\350\301\244\350\322\241\322\303\273\351\315\247\241\321\271: \r "  ;  //   เพิ่มค่าการป้องกัน: \r 

char *DemonDamage4  = "  Demon Damage: \r "  ;
char *PoisonDamage3  = "  Poison Attack: \r "  ;
char *PikeNum4   = "  \250\323\271\307? \r "  ;
char *poisoningTime  = "  \340\307\305\322 Poisoning: \r "  ;  //   เวลา Poisoning: \r 
char *PlusCriticalName = "  \340\276\324\350?Critical: \r "  ;  //   เพิ่?Critical: \r 
char *SpiritFalconDamage2 = "  Spirit Falcon Damage: \r "  ;
char *LifeGegenPlus = "  \277\327\351\271 HP: \r "  ;  //   ฟื้น HP: \r 
char *PlusDamage4 = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325: \r "  ;  //   เพิ่มพลังโจมตี: \r 
char *PiercingPercent = "  Piercing Percent: \r "  ;
char *DamageToLife = "  \340\273\305\325\350\302\271\244\350\322\244\307\322\301\340\312\325\302\313\322\302\340\273\347?HP: \r "  ;  //   เปลี่ยนค่าความเสียหายเป็?HP: \r 
char *MyMonster7 = "  % \241\322\303\312\320\241?\r "  ;  //   % การสะก?\r 
char *LifeIncre4 = "  \340\276\324\350\301\276\305\321\247\252\325\307\324\265: \r "  ;  //   เพิ่มพลังชีวิต: \r 
char *UndeadDamage3 = "  Undead Damage: \r "  ;

char *AttackNum3   = "  \342\250\301\265\325\265\350\315\340\271\327\350\315\247: \r "  ;   //   โจมตีต่อเนื่อง: \r 
char *AttackRateMinus = "  \305\264\244\307\322\301\341\301\350\271\302\323 \r "  ;   //   ลดความแม่นยำ \r 
char *MaxDamagePlus2 = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325\312\331\247\312\330\264 \r "  ;   //   เพิ่มพลังโจมตีสูงสุด \r 
char *LightningAddDamage3 = " Lightning :\r "  ; 
char *ReLifePercent4  = "  % \312\323\340\303\347\250: \r "  ;   //   % สำเร็จ: \r 
char *GetExp3  = "  \303\321?Exp:\r "  ; 
char *ResurrectionChar4  = "  Resurrection Character LV "  ; 
char *ExtinctionPercent2  = "  % \312\323\340\303\347\250: \r "  ;   //   % สำเร็จ: \r 
char *ExtinctionAmount2  = "  \250\323\271\307?Extinction: \r "  ; 
char *IncreLifePercent2 = "  \340\276\324\350?HP: \r "  ;   //   เพิ่?HP: \r 

char *ReduceDamage3 = "  \305\264\244\350\322\244\307\322\301\340\312\325\302\313\322\302: \r "  ;   //   ลดค่าความเสียหาย: \r 
char *IncreMagicDamage = "  \340\276\324\350\301\276\305\321\247\342\250\301\265\325\250\322\241\241\322\303\343\252?Magic: \r "  ;   //   เพิ่มพลังโจมตีจากการใช?Magic: \r 
char *AttackDelay3 = "  Attack Delay: \r "  ; 

char *FireDamage2 = "  Fire Damage: \r "  ;
char *IceDamage2 = "  Ice Damage: \r "  ;
char *AddDefense8 = "  \340\276\324\350\301\276\305\321\247\273\351\315\247\241\321\271: \r "  ;  //   เพิ่มพลังป้องกัน: \r 
char *SkillDamage5 = "  Skill Damage: \r "  ;

char *FireDamage3 = "  Fire Damage: \r "  ;
char *AddSpeed7 = "  \340\276\324\350\301\244\307\322\301\340\303\347?\r "  ;  //   เพิ่มความเร็?\r 
char *AfterDamage7 = "  After Damage: \r "  ;
char *MonsterSight7 = "  Monster \340\313\347\271: \r "  ;  //   Monster เห็น: \r 

//4차스킬
//템스크론
char *LinghtingAddDamage4=  "  Add attack rate on lightning: \r  "  ;
char *MaxBoltNum4=  "  Max voltage: \r  "  ;
char *AddAbsorb4=  "  Add rate on absorb: \r  "  ;
char *IncreArea4=  "  Increasing range: \r  "  ;
char *IncreAttack4=  "  More attacking power: \r  "  ;
char *GolemLife4=  "  Life+strength: \r  "  ;


char *SubAbsorb4=  "  Decreasing absorption: \r  "  ;
char *AreaDamage4=  "  Attacking rate for range: \r  "  ;
char *MaxAttackNum4=  "  Max hits: \r  "  ;
char *LifeUp4=  "  Add vitality: \r  "  ;

char *CriticalAddDamage4=  "  Increase of critical: \r  "  ;
char *MonstervsSubCritical4=  "  Weaken critical of monster: \r  "  ;
char *ChargingAddPercentDamage4=  "  Add attacking rate on charging: \r  "  ;

char *IncreEvasionPercent4=  "  Additinal percentage of evasion: \r  "  ;
char *AddShadowNum4=  "  Increasing combination of ocular: \r  "  ;

char *WolverinLife4=  "  Vitality:\r  "  ;
char *WolverinRate4=  "  Accuracy:\r  "  ;
char *WolverinDefense4=  "  Defence rate:\r  "  ;
char *AddEvasion4=  "  Increasing ability of evasion:\r  "  ;
char *AddDamage4=  "  Increasing attacking rate(physic):\r  "  ;
char *FalconAddDamage4=  "  Increasing attacking rate of falcon:\r  "  ;

//모라이온
char *IncreAttackAbsorb4=  "  Increasing absorption rate:\r  "  ;

char *RectAngleArea4=  "  Attacking at sharp angled range:\r  "  ; 

char *MonsterSubSpeed4=  "  Decreasing speed of attacted monster:\r  "  ;


char *AddLifeRegen4=  "  Add life-regeneration:\r  "  ;
char *AddManaRegen4=  "  Add mana-regeneration:\r  "  ;
char *MagicArea4=  "  Magic affected range:\r  "  ;
char *ChainNum4=  "  A number of affected monster:\r  "  ;
char *ChainRange4=  "  The rage of affected monster:\r  "  ;
char *UndeadDamageAbsorb4=  "  Undead attacking absorption:\r  "  ;
char *UserBlockPercent4=  "  Blocking rate for character:\r  "  ;

char *SecondIncreMana4=  "  Increasing mana rate per second:\r  "  ;
char *FireDamage4=  "  Fire attacking rate:\r  "  ;
char *DecreSpeed4=  "  Decreasing Speed:\r  "  ;
char *DecreAttack4=  "  Decreasing attacking rate:\r  "  ;
char *AddPercentDamage4=  "  Adding attacking rate:\r  "  ;

//การให้สกิลล์
char *ChainDamage3  = "  ChainDamage)\r  "  ;
char *BrandishDamage3 = "  BrandishDamage  "  ;
char *PhysicalAbsorb3 = "  PhysicalAbsorb  "  ;
char *SparkDamage3  = "  SparkDamage  "  ;
char *BrutalSwingCritical3 = "  BrutalSwingCritical  "  ;
char *Attck_RateAdd5 = "  \340\276\324\350?Attack Rate:\r  " ;  //   เพิ่?Attack Rate:\r  
char *Triumph4= " Triumph " ;
char *Use4= " you " ;
char *DivineShield4= " Blocking rate of divine shiled " ;


//Quest Monster
char *QuestMonsterName[] = { " Bagon " , " Skeleton Warrior " , " Head Cutter " , " Armored Beetle " , " Skeleton Ranger " , " Titan "  ,
          " Forgetten Land Monster " , " Oasis Monster " , " Dungeon 1F Monster " };


//สำหรับ Vamp
char *VampOption[10] ={ " Aging Rating is increased: \r " , " blood sucking: \r " , " Damage: \r " , " Reduce Life : \r " , " good luck: \r " };


char *Quest3ItemName[]={ " Demon Hunter " , " Ancient Revenge " , " Myst " , " Double Side " , " Anaconda " , " Platinum Sword " , " Ghost " };

char *Quset3ItemDoc15 =  " \340\244\307\312\344\315\340\267? " ;  //  เควสไอเท? 
char *Quset3ItemDoc16 =  "  \344\264\351\313\322\302\344\273  " ;  //   ได้หายไป  

char *SparkDamage10 =  " Spark Damage:\r " ;

char *RequirLevel3 =  " (\265\351\315\247\241\322\303Level:%d)\r  " ;  //  (ต้องการLevel:%d)\r  

char *RecvItemTT =  " \344\264\351\303\321\272\344\315\340\267\301\341\305\351? " ;  //  ได้รับไอเทมแล้? 
char *PuzzleEvent5 =  " Puzzle \267\325\350\312\301\272\331\303\263\354  " ;  //  Puzzle ที่สมบูรณ์  
char *BabelHorn =  " Babel Horn  " ;
char *NineTailFoxItem =  " NineTail amulet  " ;
char *MyShopItemSell5 =  " \303\322\244\322\242\322?\r  " ;  //  ราคาขา?\r  
char *CristalItem   = " \244\303\324\312\265\321?7 \252\324\351\271  " ;  //  คริสตั?7 ชิ้น  
char *StarDust = "Glitering powder";
char *ChristMas = "Merry Christmas";

char *sinDeadCandyEat =  " \340\316\351\302! \271\325\350\301\321\271\340\241\350\322\250\271\313\301\264\315\322\302\330\341\305\351\307\271\325\350\271\322!  " ;  //  เฮ้ย! นี่มันเก่าจนหมดอายุแล้วนี่นา!  

char *PotionCntDoc2 =  " \303\322\244\322\242\322\302\265\350\315\315\321? " ;  //  ราคาขายต่ออั? 
char *ItemPrice7 =  " \303\322\244\322\344\315\340\267? " ;  //  ราคาไอเท? 

char *BuyMyShopItem7 =  "  %s \344\264\351\253\327\351\315\344\315\340\267\301 %s \344\273  %d \315\321\271\340\273\347\271\340\247\324?%d \272\322? " ;    //   %s ได้ซื้อไอเทม %s ไป  %d อันเป็นเงิ?%d บา? 
char *BuyMyShopItem8 =  "  \344\264\351\253\327\351\315\344\315\340\267\301  %s \242\315?%s \301\322 %d \315\321\271\340\273\347\271\340\247\324?%d \272\322? " ;    //   ได้ซื้อไอเทม  %s ขอ?%s มา %d อันเป็นเงิ?%d บา? 
char *ItemName87 =  " \344\315\340\267? " ;  //  ไอเท? 

char *sinEvent87 =  " \244\323\242\315\242\315\247\271\321\241\340\241\347\272\265\321\307\251\241\322? " ;  //  คำขอของนักเก็บตัวฉกา? 
char *sinAddDamageItem =  " \340\276\324\350\301\276\305\321\247\342\250\301\265\325: \r " ;  //  เพิ่มพลังโจมตี: \r 
char *sinContinueTimeItem =  " \303\320\302\320\340\307\305\322: \r " ;  //  ระยะเวลา: \r 
char *BuyPotionMoney =  " \250\323\271\307\271\340\247\324? " ;  //  จำนวนเงิ? 
char *BuyPotionKind =  " \250\323\271\307? " ;
char *SheltomName2[] = { " Lucidy " , " Sereno " , "  Fadeo " , " Sparky " , " Raident " , " Transparo " , " Murky " , " Devine " , " Celesto " };

char *AddPercentDamage3=  " \340\276\324\350\301\276\305\321\247\342\250\301\265\325 %: \r " ;  //  เพิ่มพลังโจมตี %: \r 

char *sinLuckyBox=  " \266\330\247\271\323\342\252\244  " ;  //  ถุงนำโชค  

char *SodMessage_Etc[] = {
 " \340\247\324\271\267\325\350\250\320\344\264\351\303\321\272\250\322\241\241\322\303\340?\322\303\350\307?Bellatra Clan  " ,  //  เงินที่จะได้รับจากการเ?าร่ว?Bellatra Clan  
 " \301\325\340\276\325\302\247\313\321\307\313\271\351\322 Clan \340\267\350\322\271\321\351\271\267\325\350\250\320\303\321\272\344\264? " ,  //  มีเพียงหัวหน้า Clan เท่านั้นที่จะรับได? 
 " \341\305\320\244\350\322\270\303\303\301\340\271\325\302\301\244\327\315 %d%s. " ,  //  และค่าธรรมเนียมคือ %d%s. 
};

char *SodMessage_Clan[] = {
 " \340\247\324\271\267\321\351\247\313\301\264\267\325\350\344\264\351\244\327\315  " ,  //  เงินทั้งหมดที่ได้คือ  
 " \340\247\324\271\303\322\247\307\321\305\250\322?Bellatra \340\301\327\350\315\244\303\321\351\247\241\350\315\271  " ,  //  เงินรางวัลจา?Bellatra เมื่อครั้งก่อน  
};

char *SodMessage_Master[] = {
 " \340\247\324\271\267\321\351\247\313\301\264\267\325\350\344\264\351\244\327\315  " ,  //  เงินทั้งหมดที่ได้คือ  
 " \340\247\324\271\303\322\247\307\321\305\250\322?Bellatra \340\301\327\350\315\244\303\321\351\247\241\350\315\271  " ,  //  เงินรางวัลจา?Bellatra เมื่อครั้งก่อน  
 " \267\350\322\271\265\351\315\247\241\322\303\250\320\303\321\272\313\303\327\315\344\301? " ,  //  ท่านต้องการจะรับหรือไม? 
};

char *OtherClanMaster[] = {
 " \302\321\247\301\325\340\247\324\271\303\322\247\307\321\305\340\313\305\327\315\315\302\331\350\272\322\247\312\350\307? " ,  //  ยังมีเงินรางวัลเหลืออยู่บางส่ว? 
 " \241\303\330\263\322\303\320\272\330\302\315\264\340\247\324\271\267\325\350\265\351\315\247\241\322\303\303\321? " ,  //  กรุณาระบุยอดเงินที่ต้องการรั? 

};

/*----------------------------------------------------------------------------*
*			테스트			공성전 메뉴메세지 
*-----------------------------------------------------------------------------*/	
char *SiegeMessage_Taxrates[] = {
	 " \315\321\265\303\322\300\322\311\325\340\273\305\325\350\302\271\340\273\347\271 %d%s  " ,  //  อัตราภาษีเปลี่ยนเป็น %d%s  
	 " \302\315\264\300\322\311\325\267\325\350\303\307\272\303\307\301\344\264\351\266\326\247\273\321\250\250\330\272\321\271  " ,  //  ยอดภาษีที่รวบรวมได้ถึงปัจจุบัน  
	 " gold  " ,
	 " \250\320\340\272\324\241\300\322\311\325\313\303\327\315\344\301? " ,  //  จะเบิกภาษีหรือไม? 
	 " \315\321\265\303\322\300\322\311\325\273\321\250\250\330\272\321\271\244\327\315 %d%s  " ,  //  อัตราภาษีปัจจุบันคือ %d%s  
};
char *SiegeMessage_MercenrayA[] = {
	 " \267\313\322\303\241\315\247\313\271\330\271\303\324\244\322\303\354\340\267\271  " ,  //  ทหารกองหนุนริคาร์เทน  
	 " \241\315\247\265\350\315\312\331\351\267\325\350\301\322\250\322\241\241\315\247\313\271\330\271  " ,  //  กองต่อสู้ที่มาจากกองหนุน  
	 " \303\322\244\322\266\331\241\341\265\350\307\350\322\276\305\321\247\265\350\315\312\331\351\315\350\315\271\267\325\350\312\330? " ,  //  ราคาถูกแต่ว่าพลังต่อสู้อ่อนที่สุ? 
	 " \312\301\322\252\324\241\267\313\322\303\303\321\272\250\351\322\247\301\322\241\312\330?0 / %d  " ,  //  สมาชิกทหารรับจ้างมากสุ?0 / %d  
};
char *SiegeMessage_MercenrayB[] = {
	 " \241\315\247\267\313\322\303\273\351\315\247\241\321\271\303\325\244\322\303\354\340\267? " ,  //  กองทหารป้องกันรีคาร์เท? 
	 " \301\325\244\307\322\301\312\301\264\330\305\242\315\247\310\321\241\302\300\322\276\267\330\241\264\351\322\271  " ,	// short message  //  มีความสมดุลของศักยภาพทุกด้าน  
	 " \301\325\276\305\321\247\265\350\315\312\331\351\252\321\351\271\241\305\322\247  " ,  //  มีพลังต่อสู้ชั้นกลาง  
	 " \312\301\322\252\324\241\267\313\322\303\303\321\272\250\351\322\247\301\322\241\312\330?20 / %d  " ,  //  สมาชิกทหารรับจ้างมากสุ?20 / %d  
};
char *SiegeMessage_MercenrayC[] = {
	 " \241\315\247\267\313\322\303\273\351\315\247\241\321\271\303\322\252\315\322\263\322\250\321\241?bless  " ,  //  กองทหารป้องกันราชอาณาจัก?bless  
	 " \343\271\260\322\271\320\267\313\322\303\303\321\272\250\351\322\247\252\321\351\271\312\331\247\312\330? " ,  //  ในฐานะทหารรับจ้างชั้นสูงสุ? 
	 " \276\305\321\247\265\350\315\312\331\351\341\242\347\247\341\241\303\350\247\267\325\350\312\330? " ,  //  พลังต่อสู้แข็งแกร่งที่สุ? 
	 " \312\301\322\252\324\241\267\313\322\303\303\321\272\250\351\322\247\301\322\241\312\330?20 / %d  " ,  //  สมาชิกทหารรับจ้างมากสุ?20 / %d  
};
char *SiegeMessage_TowerIce[] = {
	 " \344\315\253\354 \244\303\324\312\265\321? " ,  //  ไอซ์ คริสตั? 
	 " \270\322\265\330\271\351\323\341\242\347\247\244\307\322\301\340\303\347\307\340\244\305\327\350\315\271\267\325\350\265\241\305\247\341\305\320  " ,  //  ธาตุน้ำแข็งความเร็วเคลื่อนที่ตกลงและ  
	 " \301\325\244\307\322\301\312\322\301\322\303\266\276\324\340\310\311\244\307\322\301\340\303\347\307\342\250\301\265\325\305\264\305\247  " ,  //  มีความสามารถพิเศษความเร็วโจมตีลดลง  
	 " \265\321\351\247\344\315\253\354\244\303\324\312\265\321\305\340\303\325\302\272\303\351\315\302  " ,  //  ตั้งไอซ์คริสตัลเรียบร้อย  
};
char *SiegeMessage_TowerFire[] = {
	 " \344\277\244\303\324\312\265\321? " ,  //  ไฟคริสตั? 
	 " \264\351\307\302\270\322\265\330\344\277\276\305\321\247\342\250\301\265\325\312\331\247\242\326\351\271\312\330\264\341\265\350\307\350? " ,  //  ด้วยธาตุไฟพลังโจมตีสูงขึ้นสุดแต่ว่? 
	 " \344\301\350\301\325\244\307\322\301\312\322\301\322\303\266\276\324\340\310\311  " ,  //  ไม่มีความสามารถพิเศษ  
	 " \265\321\351\247\344\277\244\303\324\312\265\321\305\340\303\325\302\272\303\351\315\302  " ,  //  ตั้งไฟคริสตัลเรียบร้อย  
};
char *SiegeMessage_TowerLighting[] = {
	 " \344\305\267\354\271\324\350\247\244\303\324\312\265\321? " ,  //  ไลท์นิ่งคริสตั? 
	 " \264\351\307\302\270\322\265\330\312\322\302\277\351\322\244\307\322\301\340\303\347\307\340\244\305\327\350\315\271\267\325\350\265\241\305\247\341\305\351\307  " ,  //  ด้วยธาตุสายฟ้าความเร็วเคลื่อนที่ตกลงแล้ว  
	 " \301\325\244\307\322\301\312\322\301\322\303\266\276\324\340\310\311\244\307\322\301\340\303\347\307\342\250\301\265\325\305\264\305\247  " ,  //  มีความสามารถพิเศษความเร็วโจมตีลดลง  
	 " \265\321\351\247\344\305\267\354\271\324\247\244\303\324\312\265\321\305\340\303\325\302\272\303\351\315? " ,  //  ตั้งไลท์นิงคริสตัลเรียบร้อ? 
};
char *SiegeMessage_MerMoney =  " \244\350\322\343\252\351\250\350\322\302\267\313\322\303\303\321\272\250\351\322? " ;  //  ค่าใช้จ่ายทหารรับจ้า? 
char *SiegeMessage_TowerMoney =  " \244\350\322\343\252\351\250\350\322\302\267\322\307\340\307\315\303\354  " ;  //  ค่าใช้จ่ายทาวเวอร์  


char *sinClanMaster7 =  " \313\321\307\313\271\351\322\341\244\305? " ;  //  หัวหน้าแคล? 
char *sinPrize7 =  " \340\247\324\271\303\322\247\307\321\305:  " ;  //  เงินรางวัล:  

char *sinLevelQuestMonster[]={ " Bargon " , " Muffin " , " Dire Bee " , " Typhoon " , " Ratoo " , " Grotesque " , " Iron Fist " };
char *sinLevelQusetDoc= " Quest> %s %d number of monster needed " ;

char *sinTeleportDoc[] = { " \267\322\247\340?\322\266\355\351\322\340\313\347? " , " \267\322\247\340?\322\266\355\351\322\274\326\351? " , " \264\324\271\341\264\271\265\351\315\247\244\355\322\312\322\273  " , " \264\324\271\341\264\271\265\351\315\247\313\351\322\301  " };  //  ทางเ?าถํ้าเห็?  |  ทางเ?าถํ้าผึ้?  |  ดินแดนต้องคําสาป   |  ดินแดนต้องห้าม  
char *sinLevelQuest90_2Mon[] = { " Omeca " , " D-Machine " , " Mountain " };
char *sinLevelQusetDoc2= " <\340\244\307\312> \344\273\305\350?%s \301\322\250\355\322\271\307\271 %d \265\321?" ;  //  <เควส> ไปล่?%s มาจํานวน %d ตั?
char *sinLevelQusetDoc3= " <\340\244\307\312> \344\273\340\315\322\344\315\340\267\301\250\322?%s  " ;  //  <เควส> ไปเอาไอเทมจา?%s  
char *sinLimitTiem2 =  " \340\307\305\322\267\325\350\241\355\322\313\271? \r " ;  //  เวลาที่กําหน? \r 
char *sinMinute2 =  " \271\322\267\325  " ;
char *sinDay4 =  " day " ;
char *sinHour4 =  " hour " ;
char *sinLevelQusetDoc4= " <\340\244\307\312> \305\350?%s %d \265\321\307\340\303\325\302\272\303\351\315\302  " ;  //  <เควส> ล่?%s %d ตัวเรียบร้อย  

sinSTRING sinTestMsg7( " \303\350\315\341\303\350 \315\350\315\271\346\241\321\271\267\321\351\247\271\321\351\271!  " );  //  ร่อแร่ อ่อนๆกันทั้งนั้น!  

char *sinMonCodeName[]={
	0,
	 " Bargon " ,
	 " Skeleton Warrior " ,
	 " Head Cutter " ,
	 " Armored Bettle " ,
	 " Skeleton Ranger " ,   //5
	 " Titan " ,
	 " Muffin " ,
	 " Dire Bee " ,
	 " Typhoon " ,
	 " Ratoo " ,      //10
	 " Grotesque " ,
	 " Iron Fist " ,
	 " Omega " ,
	 " D-Machine " ,
	 " Mountain " ,      //15
	 " Skeleton Knight " ,
	 " Solid Snail " ,
	 " Thron Crawler " ,
	 " Mummy " ,
	 " Doom Guard " ,     //20
	 " Figon " ,    
	 " Stone Giant " ,
	 " Stone Golem " ,
	 " Iron Guard " ,
	 " Avelin " ,      //25
	 " Avelisk-L " ,
	 " BeEvil " ,
	 " Illusion Knight " ,
	 " Nightmare " ,
	 " Witch " ,      //30
	 " Heavy Goblin " ,
	 " Dawlin " ,
	 " Stygian " ,
	 " Incubus " ,
	 " Chain Golem " ,     //35
	 " Dark Specter " ,
	 " Metron " ,
	 " Avelisk Lord " ,
	 " Dusk " ,
	 " Sadness " ,    //40
	0,
};

char *ChargingTime4= " \340\276\324\350\301\244\307\322\301\340\303\347\307\252\322\303\354\250 \r  " ;  //  เพิ่มความเร็วชาร์จ \r  
char *AddIceDamage4= " \276\305\321\247\342\250\301\265\325\270\322\265\330\271\355\351\322\341\242\347\247\340\276\324\350\301\242\326\351\271 \r  " ;  //  พลังโจมตีธาตุนํ้าแข็งเพิ่มขึ้น \r  
char *IceTime4= " \303\320\302\320\340\307\305\322 : \r  " ;  //  ระยะเวลา : \r  
char *sinAttackType =  " \342\250\301\265\325\341\272\272 : \r "  ;  //  โจมตีแบบ : \r 
char *sinAttackType2[2] ={ " \342\250\301\265\325\315\321\265\342\271\301\321\265\324 \r  " , " Auto\r " };  //  โจมตีอัตโนมัติ \r  

char *Won= " Gold " ;

//공성전 아이템 설명
char *CastlItemInfo[] ={
	{ " \341\301\351\250\320\315\302\331\350\343\271\300\322\307\320\344\303\351\310\321\265\303\331\252\350\307\247\313\271\326\350\247\341\265\350\307\350\322 \r  " },    //  แม้จะอยู่ในภาวะไร้ศัตรูช่วงหนึ่งแต่ว่า \r  
	{ " \315\321\265\303\322\244\303\324\265\324\244\315?\r  " },  //  อัตราคริติคอ?\r  
	{ " \315\321\265\303\322\313\305\272\340\276\324\350?\r  " },  //  อัตราหลบเพิ่?\r  
	{ " HP MP Stam \242\315\247\244\271\343\271\273\322\303\354\265\325\351 \r  " },  //  HP MP Stam ของคนในปาร์ตี้ \r  
	{ " \277\327\351\271\267\321\271\267\325\267\325\350\265\322?\r  " },  //  ฟื้นทันทีที่ตา?\r  
	{ " \241\322\303\342\250\301\265\325\244\303\324\265\324\244\315\305\267\322\307\340\307\315\303\354 \r  " },   //  //  การโจมตีคริติคอลทาวเวอร์ \r  
	{ " \276\305\321\247\342\250\301\265\325\340\307\305\322\342\250\301\265\325\340\273\351\322\313\301\322\302 20% \r " },  //  พลังโจมตีเวลาโจมตีเป้าหมาย 20% \r 
	0,
};
char *CastlItemInfo2[] ={
	{ " \276\305\321\247\342\250\301\265\325\305\264\305?/2 \r  " },  //  พลังโจมตีลดล?/2 \r  
	{ " \340\276\324\350\301\242\326\351?% \r  " },  //  เพิ่มขึ้?% \r  
	{ " \312\331\247\242\326\351?\r  " },  //  สูงขึ้?\r  
	{ " \277\327\351\271\267\321\351\247\313\301?\r  " },  //  ฟื้นทั้งหม?\r  
	{ " \r " },
	{ " \252\264\340\252\302\343\313\351 50% \r  " },  //  ชดเชยให้ 50% \r  
	{ " \340\276\324\350\301\343\313\351\341\303\247\242\326\351?\r  " },  //  เพิ่มให้แรงขึ้?\r  
	0,
};


char *CharClassTarget[8]={
	 " \340\273\351\322\313\301\322\302(fighter)\r " ,  //  เป้าหมาย(fighter)\r 
	 " \340\273\351\322\313\301\322\302(mechanician)\r " ,  //  เป้าหมาย(mechanician)\r 
	 " \340\273\351\322\313\301\322\302(pikeman)\r " ,  //  เป้าหมาย(pikeman)\r 
	 " \340\273\351\322\313\301\322\302(archer)\r " ,  //  เป้าหมาย(archer)\r 
	 " \340\273\351\322\313\301\322\302(knight)\r " ,  //  เป้าหมาย(knight)\r 
	 " \340\273\351\322\313\301\322\302(atalanta)\r " ,  //  เป้าหมาย(atalanta)\r 
	 " \340\273\351\322\313\301\322\302(magician)\r " ,  //  เป้าหมาย(magician)\r 
	 " \340\273\351\322\313\301\322\302(priestess)\r " ,  //  เป้าหมาย(priestess)\r 
};
char *AttributeTower[4]={
	 " \270\322\265\330(\344\277) \r " ,  //  ธาตุ(ไฟ) \r 
	 " \270\322\265\330(\271\351\323\341\242\347? \r " ,  //  ธาตุ(น้ำแข็? \r 
	 " \270\322\265\330(\312\322\302\277\351\322) \r " ,  //  ธาตุ(สายฟ้า) \r 
	 " \340\307\305\322\341\312\264\247\274\305 %d \307\324\271\322\267\325 \r " ,  //  เวลาแสดงผล %d วินาที \r 
};

char *SiegeMessage_MerComplete = " \250\321\264\307\322\247\267\313\322\303\303\321\272\250\351\322\247\340\303\325\302\272\303\351\315\302\341\305\351\307  " ;  //  จัดวางทหารรับจ้างเรียบร้อยแล้ว  

//초보 퀘스트 
char *haQuestMonsterName[]={
	 " Hopy " ,
	 " Rabie " ,
	 " Hobgoblin " ,
	 " NorthGoblin " ,
	 " Skeleton " ,
	 " Corrupt " ,
	 " Cyclops " ,
	 " Bagon " ,
	0,
};
char *ha100LVQuestItemName[]={
	 " Minotaur Axe " ,
	 " Extreme Talon " ,
	 " Dragon Bone Hammer  " ,
	 " Hellfire Scythe " ,
	 " Revenge Bow " ,
	 " Immortal Sword " ,
	 " Salamander Javelin " ,
	 " Gothic Staff " ,
	0,
};
//100LV퀘스트 (퓨리의 환영)
char *ha100LVQuestMonterName[]={
	 " Monsters in the Heart of Perum " ,
	 " Monsters of the Galluvia Valley " ,
	0,
};
char *ha100LVQuestName =  " Fury's phantasma " ;

//프리미엄 유료화 아이템
char *PremiumItemDoc[][2]={
	{ "It makes stat points\r "  , "to be restributed.\r " },   //스탯 초기화 아이템
	{ "It makes skill points\r "  , " to be restributed.\r " },  //스킬 초기화 아이템
	{ "It makes stat/skill points\r " , "to be restributed.\r " },   //스탯/스킬 초기화 아이템
	{ "It makes the dead character \r "   , "to be revived.\r " },    //부활 아이템
	{ "Becomes invincible for the set time.\r " , "The attack power decrease in 1/2\r " },  //이터널 라이프
	{ "15% increase \r "   , "on the critical attack.\r " },		//페이틀 에지
	{ "15% increase of \r "    , "evade chance.\r " },		//에버트 스크롤
};
char *UpKeepItemDoc[] = {
	 "Remaining Time : %dMin" ,
	 "Extra Item Won %d%s Increase" ,
	 "Extra EXP Won %d%s Increase" ,
	 "Attack %d%s Increase" ,
	 "Restore monster's HP(part)",
	 "Restore monster's MP(part)",
	0,
};
char *UpKeepItemName[] = {
	 "Third Eyes " ,
	 "EXP Increase Potion " ,
	 "Vampiric Cuspid",
	 "Mana Recharge Potion",
	0,
};
