

#define SIN_SKILL_USE_RIGHT	0x01000000		//Available only for the right 
#define SIN_SKILL_USE_LEFT		0x02000000		//Available only for the left 
#define SIN_SKILL_USE_ALL		0x03000000		//Both available 
#define SIN_SKILL_USE_NOT		0x04000000		//Passive Skill

//Mechanician
{ "Extreme Shield" ,		 "\340\276\324\350\301\276\305\321\247\273\351\315\247\241\321\271\343\313\351\241\321\272\342\305\350 " ,  // เพิ่มพลังป้องกันให้กับโล่ 
10,		34,2,		110,4,
{0,0,0},			{sinDS1,0,0,0,0,0,0,0},
F_Extreme_Shield,SKILL_EXTREME_SHIELD,SIN_SKILL_USE_RIGHT,E_Shield_UseMana},

{ "Mechanic Bomb" ,	 "\242\307\351\322\247\303\320\340\272\324\264 " ,  // ขว้างระเบิด 
12,		28,2,		73,3,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Mechanic_Bomb,SKILL_MECHANIC_BOMB,SIN_SKILL_USE_RIGHT,Mechanic_Bomb_UseMana},

{ "Poison Attribute" ,	 "\273\351\315\247\241\321\271\276\324\311\266\322\307\303 ",  // ป้องกันพิษถาวร 
14,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Poison_Attribute,SKILL_POISON_ATTRIBUTE,SIN_SKILL_USE_NOT,0},

{ "Physical Absorption" ,	 "\340\276\324\350\301\244\307\322\301\341\242\347\247\341\241\303\350\247 ",  // เพิ่มความแข็งแกร่ง 
17,		30,2,		110,5,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Physical_Absorption,SKILL_PHYSICAL_ABSORB,SIN_SKILL_USE_RIGHT,P_Absor_bUseMana},

{ "Great Smash" ,		 "\342\250\301\265\325\315\302\350\322\247\303\330\271\341\303\247 ",  // โจมตีอย่างรุนแรง 
20,		38,2,		73,3,
{0,0,0},			{sinWA1,sinWC1,sinWH1,sinWP1,sinWS2,0,0,0},
F_Great_Smash,SKILL_GREAT_SMASH,SIN_SKILL_USE_ALL,G_Smash_UseMana},

{ "Maximize" ,		 "\340\276\324\350\301\276\305\321\247\241\322\303\342\250\301\265\325\343\313\351\241\321\272\315\322\307\330\270" ,  // เพิ่มพลังการโจมตีให้กับอาวุธ
23,		41,2,		110,4,
{0,0,0},			{sinWA1,sinWC1,sinWH1,sinWP1,sinWS2,sinWS1,sinWT1,0},
F_Maximize,SKILL_MAXIMIZE,SIN_SKILL_USE_RIGHT,Maximize_UseMana},

{ "Automation" ,		 "\340\276\324\350\301\276\305\321\247 \341\305\320\244\307\322\301\340\303\347\307\343\271\241\322\303\342\250\301\265\325 \341\272\272\252\321\350\307\244\303\322\307 \343\313\351\241\321\272\315\322\307\330\270\303\320\302\320\344\241\305 " ,  // เพิ่มพลัง และความเร็วในการโจมตี แบบชั่วคราว ให้กับอาวุธระยะไกล 
26,		42,2,		110,4,
{0,0,0},			{sinWS1,sinWT1,0,0,0,0,0,0},
F_Automation,SKILL_AUTOMATION,SIN_SKILL_USE_RIGHT,Automation_UseMana},

{ "Spark" ,			 "\342\250\301\265\325\264\351\307\302\312\322\302\277\351\322 " ,  // โจมตีด้วยสายฟ้า 
30,		40,2,		82,2,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Spark,SKILL_SPARK,SIN_SKILL_USE_RIGHT,Spark_UseMana},

{ "Metal Armor" ,		 "\340\241\303\322\320\313\305\347\241 " ,  // เกราะหล็ก 
40,		48,2,		110,5,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Metal_Armor,SKILL_METAL_ARMOR,SIN_SKILL_USE_RIGHT,Metal_Armor_UseMana},

{ "Grand Smash" ,		 "\342\250\301\342\250\301\265\325 2 \244\303\321\351\247\253\351\315\271 " ,  // โจมโจมตี 2 ครั้งซ้อน 
43,		44,2,		82,2,
{0,0,0},			{sinWA1,sinWC1,sinWP1,sinWS2,0,0,0,0},
F_Grand_Smash,SKILL_GRAND_SMASH,SIN_SKILL_USE_RIGHT,Grand_Smash_UseMana},

{ "Mechanician Weapon Mastery" ,		 "\340\276\324\350\301\244\307\322\301\252\323\271\322\255\343\271\241\322\303\343\252\351\315\322\307\330\270       \273\303\320\250\323\265\321\307 " ,  // เพิ่มความชำนาญในการใช้อาวุธ       ประจำตัว 
46,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_M_W_Mastery,SKILL_MECHANIC_WEAPON,SIN_SKILL_USE_NOT,0},

{ "Spark Shield" ,			 "\340\276\324\350\301\276\305\321\247\273\351\315\247\241\321\271\264\351\307\302\342\305\350\312\322\302\277\351\322 " ,  // เพิ่มพลังป้องกันด้วยโล่สายฟ้า 
50,		52,2,		110,2,
{0,0,0},			{sinDS1,0,0,0,0,0,0,0},
F_Spark_Shield,SKILL_SPARK_SHIELD,SIN_SKILL_USE_RIGHT,Spark_Shield_UseMana},

{"Impulsion","\342\250\301\265\325\303\320\302\320\273\303\320\252\324\264\264\351\307\302\276\305\321\247\344\277\277\351\322",  // โจมตีระยะประชิดด้วยพลังไฟฟ้า
60,     	55,2,		130,0,
{1,0,0},            {sinWC1,sinWH1,sinWP1,sinWS2,0,0,0,0},
F_Impulsion,SKILL_IMPULSION,SIN_SKILL_USE_RIGHT,Impulsion_UseMana},

{"Compulsion","\264\331\264\301\315\271\312\340\265\315\303\343\313\351\340\242\351\322\301\322\343\241\305\351",  // ดูดมอนสเตอรให้เข้ามาใกล้
63,     	65,2,		440,0,
{1,0,0},            {0,0,0,0,0,0,0,0},
F_Compulsion,SKILL_COMPULSION,SIN_SKILL_USE_RIGHT,Compulsion_UseMana},

{"Magnetic Sphere","\312\303\351\322\247\312\271\322\301\344\277\277\351\322",  // สร้างสนามไฟฟ้า
66,     	71,2,		600,0,
{1,0,0},            {0,0,0,0,0,0,0,0},
F_Magnetic_Sphere,SKILL_MAGNETIC_SPHERE,SIN_SKILL_USE_RIGHT,Magnetic_Sphere_UseMana},

{"Metal Golem","Metal Golem",
70,     	71,2,		1000,0,
{1,0,0},            {0,0,0,0,0,0,0,0},
F_Metal_Golem,SKILL_METAL_GOLEM,SIN_SKILL_USE_RIGHT,Metal_Golem_UseMana},


//Fighter 
{ "Melee Mastery" ,		 "\340\276\324\350\301\276\305\321\247\342\250\301\265\325\266\322\307\303 " ,  // เพิ่มพลังโจมตีถาวร 
10,		0,0,		0,0,
{0,0,0},			{sinWA1,sinWC1,sinWH1,sinWS2,0,0,0,0},
F_Melee_Mastery,SKILL_MELEE_MASTERY,SIN_SKILL_USE_NOT,0},

{ "Fire Attribute" ,		 "\340\276\324\350\301\244\307\322\301\265\351\322\271\267\322\271\270\322\265\330\344\277\266\322\307\303 ",  // เพิ่มความต้านทานธาตุไฟถาวร 
12,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Fire_Attribute,SKILL_FIRE_ATTRIBUTE,SIN_SKILL_USE_NOT,0},

{ "Raving" ,			 " \342\250\301\265\325\341\272\272\341\305\241\340\305\327\315\264" ,  //  โจมตีแบบแลกเลือด
14,		35,2,		93,3,
{0,0,0},			{sinWA1,sinWC1,sinWH1,sinWP1,sinWS2,0,0,0},
F_Raving,SKILL_RAVING,SIN_SKILL_USE_ALL,Raving_UseMana},

{ "Impact" ,			 "\265\325 2 \244\303\321\351\247\253\351\315\271 " ,  // ตี 2 ครั้งซ้อน 
17,		37,2,		86,4,
{0,0,0},			{sinWA1,sinWC1,sinWP1,sinWS2,0,0,0,0},
F_Impact,SKILL_IMPACT,SIN_SKILL_USE_ALL,Impact_UseMana},

{ "Triple Impact" ,		 "\342\250\301\265\325\265\350\315\340\271\327\350\315\247 3 \244\303\321\351\247\253\351\315\271 ",  // โจมตีต่อเนื่อง 3 ครั้งซ้อน 
20,		39,2,		80,4,
{0,0,0},			{sinWA1,sinWC1,sinWP1,sinWS2,0,0,0,0},
F_Triple_Impact,SKILL_TRIPLE_IMPACT,SIN_SKILL_USE_ALL,T_Impact_UseMana},

{ "Brutal Swing" ,		 "\342\250\301\265\325\310\321\265\303\331\264\351\307\302\241\322\303\340\313\307\325\350\302\247\315\322\307\330\270 ",  // โจมตีศัตรูด้วยการเหวี่ยงอาวุธ 
23,		41,2,		82,2,
{0,0,0},			{sinWA1,sinWS2,0,0,0,0,0,0},
F_Brutal_Swing,SKILL_BRUTAL_SWING,SIN_SKILL_USE_ALL,B_Swing_UseMana},

{ "Roar" ,			 "\265\320\342\241\271\343\313\351\310\321\265\303\331\313\302\330\264\252\320\247\321\241 " ,  // ตะโกนให้ศัตรูหยุดชะงัก 
26,		39,2,		112,4,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Roar,SKILL_ROAR,SIN_SKILL_USE_RIGHT,Roar_UseMana},

{ "Rage of Zecram" ,		 "\250\331\350\342\250\301\264\351\307\302\340\267\276\315\321\244\244\325 " ,  // จู่โจมด้วยเทพอัคคี 
30,		45,2,		84,4,
{0,0,0},			{sinWA1,sinWH1,sinWS2,0,0,0,0,0},
F_RageOfZecram,SKILL_RAGE_OF_ZECRAM,SIN_SKILL_USE_RIGHT,R_Zecram_UseMana},

{ "Concentration" ,		 "\340\276\324\350\301\312\301\322\270\324 " ,  // เพิ่มสมาธิ 
40,		53,2,		110,3,
{0,0,0},			{sinWA1,sinWS2,0,0,0,0,0,0},
F_Concentration,SKILL_CONCENTRATION,SIN_SKILL_USE_RIGHT,Concentration_UseMana},

{ "Avanging Crash" ,		 "\241\303\320\342\264\264\342\250\301\265\325 2 \244\303\321\351\247\253\351\315\271 ",  // กระโดดโจมตี 2 ครั้งซ้อน 
43,		48,2,		73,3,
{0,0,0},			{sinWA1,sinWP1,sinWS2,0,0,0,0,0},
F_Avanging_Crash,SKILL_AVANGING_CRASH,SIN_SKILL_USE_RIGHT,A_Crash_UseMana},

{ "Swift Axe" ,		 "\340\276\324\350\301\244\307\322\301\340\303\347\307\343\271\241\322\303\342\250\301\265\325 " ,  // เพิ่มความเร็วในการโจมตี 
46,		53,2,		200,3,
{0,0,0},			{sinWA1,0,0,0,0,0,0,0},
F_Swift_Axe,SKILL_SWIFT_AXE,SIN_SKILL_USE_RIGHT,Swift_Axe_UseMana},

{ "Bone Crash" ,		 "\267\330\350\301\271\351\323\313\271\321\241\265\321\307\267\321\351\247\313\301\264\343\271\241\322\303\342\250\301\265\325 \315\302\350\322\247\303\330\271\341\303\247 " ,  // ทุ่มน้ำหนักตัวทั้งหมดในการโจมตี อย่างรุนแรง 
50,		54,2,		73,3,
{0,0,0},			{sinWA1,sinWP1,sinWS2,0,0,0,0,0},
F_Bone_Crash,SKILL_BONE_CRASH,SIN_SKILL_USE_RIGHT,B_Crash_UseMana},

{"Destroyer",		"\342\250\301\265\325 4 \244\303\321\351\247\253\351\315\271 ",  // โจมตี 4 ครั้งซ้อน 
60,		45,2,		150,0,
{1,0,0},			{sinWA1,sinWH1,0,0,0,0,0,0},
F_Destoryer,SKILL_DETORYER,SIN_SKILL_USE_ALL,Destoryer_UseMana},

{"Berserker","\244\305\330\350\301\244\305\321\350\247",  // คลุ่มคลั่ง
63,		60,2,		700,0,
{1,0,0},			{0,0,0,0,0,0,0,0},
F_Berserker,SKILL_BERSERKER,SIN_SKILL_USE_RIGHT,Berserker_UseMana},

{"Cyclon Strike","\342\250\301\265\325\310\321\265\303\331\267\321\351\247\313\301\264\267\325\350\315\302\331\350\342\264\302\303\315\272",  // โจมตีศัตรูทั้งหมดที่อยู่โดยรอบ
66,		55,2,		135,0,
{1,0,0},			{sinWA1,sinWH1,sinWP1,sinWS2,0,0,0,0},
F_Cyclone_Strike,SKILL_CYCLONE_STRIKE,SIN_SKILL_USE_RIGHT,Cyclone_Strike_UseMana},

{"Boost Health","\340\276\324\350\301\276\305\321\247\252\325\307\324\265",  // เพิ่มพลังชีวิต
70,		0,0,		0,0,
{1,0,0},			{0,0,0,0,0,0,0,0},
F_Boost_Health,SKILL_BOOST_HEALTH,SIN_SKILL_USE_NOT,},


//Pikeman
{ "Pike Wind" ,			 "\312\303\351\322\247\305\301\313\301\330\271\303\315\272\265\321\307 " ,  // สร้างลมหมุนรอบตัว 
10,		27,2,		80,4,
{0,0,0},			{sinWP1,0,0,0,0,0,0,0},
F_Pike_Wind,SKILL_PIKE_WIND,SIN_SKILL_USE_RIGHT,Pike_Wind_UseMana},

{ "Ice Attribute" ,		 "\340\276\324\350\301\244\307\322\301\265\351\322\271\267\322\271\271\351\323\341\242\347\247\266\322\307\303 " ,  // เพิ่มความต้านทานน้ำแข็งถาวร 
12,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Ice_Attribute,SKILL_ICE_ATTRIBUTE,SIN_SKILL_USE_NOT,0},

{ "Critical Hit" ,		 "\342\250\301\265\325\250\330\264\265\322\302 " ,  // โจมตีจุดตาย 
14,		31,2,		84,3,
{0,0,0},			{sinWP1,sinWC1,sinWH1,sinWS2,0,0,0,0},
F_Critical_Hit,SKILL_CRITICAL_HIT,SIN_SKILL_USE_ALL,Critical_Hit_UseMana},

{ "Jumping Crash" ,		 "\241\303\320\342\264\264\313\301\330\271\265\321\307\277\321\271" ,  // กระโดดหมุนตัวฟัน
17,		34,2,		76,4,
{0,0,0},			{sinWA1,sinWP1,sinWS2,0,0,0,0,0},
F_Jumping_Crash,SKILL_JUMPING_CRASH,SIN_SKILL_USE_ALL,Jumping_Crash_UseMana},

{ "Ground Pike" ,			 "\342\250\301\265\325\310\321\265\303\331\303\315\272\267\324\310\267\322\247\264\351\307\302\271\351\323\341\242\347\247 " ,  // โจมตีศัตรูรอบทิศทางด้วยน้ำแข็ง 
20,		36,2,		84,4,
{0,0,0},			{sinWP1,0,0,0,0,0,0,0},
F_Ground_Pike,SKILL_GROUND_PIKE,SIN_SKILL_USE_RIGHT,G_Pike_UseMana},

{ "Tornado" ,			 "\343\252\351\276\305\321\247\267\315\271\322\342\264\342\250\301\265\325\310\321\265\303\331 " ,  // ใช้พลังทอนาโดโจมตีศัตรู 
23,		38,2,		83,4,
{0,0,0},			{sinWP1,0,0,0,0,0,0,0},
F_Tornado_Pike,SKILL_TORNADO,SIN_SKILL_USE_RIGHT,Tornado_UseMana},

{ "Weapon DEF Mastery" ,		 "\340\276\324\350\301\276\305\321\247\273\351\315\247\241\321\271\264\351\307\302\315\322\307\330\270\266\322\307\303  " ,  // เพิ่มพลังป้องกันด้วยอาวุธถาวร  
26,		0,0,		0,0,
{0,0,0},			{sinWA1,sinWH1,sinWP1,sinWS2,0,0,0,0},
F_Weapone_Defence_Mastery,SKILL_WEAPONE_DEFENCE_MASTERY,SIN_SKILL_USE_NOT,0},

{ "Expansion" ,			 "\340\276\324\350\301\242\271\322\264\315\322\307\330\270\267\325\350\343\252\351\340\301\327\350\315\342\250\301\265\325 " ,  // เพิ่มขนาดอาวุธที่ใช้เมื่อโจมตี 
30,		42,2,		82,4,
{0,0,0},			{sinWA1,sinWH1,sinWP1,0,0,0,0,0},
F_Expansion,SKILL_EXPANSION,SIN_SKILL_USE_ALL,Expansion_UseMana},

{ "Venom Spear" ,			 "\343\252\351\276\324\311\342\250\301\265\325\310\321\265\303\331 " ,  // ใช้พิษโจมตีศัตรู 
40,		50,2,		110,2,
{0,0,0},			{sinWP1,0,0,0,0,0,0,0},
F_Venom_Spear,SKILL_VENOM_SPEAR,SIN_SKILL_USE_RIGHT,VenomSpear_UseMana},

{"Vanish",			"\276\305\322\247\265\321\307 ",  // พลางตัว 
43,		53,2,		140,2,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Vanish,SKILL_VANISH,SIN_SKILL_USE_RIGHT,Vanish_UseMana},

{"Critical Mastery",	                     "\340\276\324\350\301\244\307\322\301\341\301\350\271\302\323\343\271\241\322\303\342\250\301\265\325\250\330\264\265\322\302 ",  // เพิ่มความแม่นยำในการโจมตีจุดตาย 
46,		0,0,		0,0,
{0,0,0},			{sinWP1,0,0,0,0,0,0,0},
F_Critical_Mastery,SKILL_CRITICAL_MASTERY,SIN_SKILL_USE_NOT,0},

{"Chain Lance",	  		  "\241\303\320\342\264\264\342\250\301\265\325 3 \244\303\321\351\247\253\351\315\271 ",  // กระโดดโจมตี 3 ครั้งซ้อน 
50,		51,2,		88,3,
{0,0,0},			{sinWC1,sinWP1,sinWS2,0,0,0,0,0},
F_Chain_Lance,SKILL_CHAIN_LANCE,SIN_SKILL_USE_RIGHT,Chain_Lance_UseMana},

{"Assassin Eye",	 "\301\315\247\313\322\250\330\264\315\350\315\271 ",  // มองหาจุดอ่อน 
60,		61,2,		520,0,
{1,0,0},			{sinWP1,0,0,0,0,0,0,0},
F_Assassin_Eye,SKILL_ASSASSIN_EYE,SIN_SKILL_USE_RIGHT,Assassin_Eye_UseMana},

{"Charging Strike",	 "\303\315\342\315\241\322\312\342\250\301\265\325\315\302\350\322\247\303\330\271\341\303\247 ",  // รอโอกาสโจมตีอย่างรุนแรง 
63,		75,2,		150,0,
{1,0,0},			{sinWP1,sinWS2,0,0,0,0,0,0},
F_Charging_Strike,SKILL_CHARGING_STRIKE,SIN_SKILL_USE_RIGHT,Charging_Strike_UseMana},

{"Vague",	"\340\276\324\350\301\244\307\322\301\312\322\301\322\303\266\343\271\241\322\303\313\305\272\313\305\325\241 ",  // เพิ่มความสามารถในการหลบหลีก 
66,		71,2,		650,0,
{1,0,0},			{sinWP1,0,0,0,0,0,0,0},
F_Vague,SKILL_VAGUE,SIN_SKILL_USE_RIGHT,Vague_UseMana},

{"Shadow Master",	"\340\247\322\344\303\351\303\350\322\247 ",  // เงาไร้ร่าง 
70,		51,2,		160,0,
{1,0,0},			{sinWP1,sinWS2,0,0,0,0,0,0},
F_Shadow_Master,SKILL_SHADOW_MASTER,SIN_SKILL_USE_RIGHT,Shadow_Master_UseMana},

//Archer
{ "Scout Hawk" ,			 "\340\303\325\302\241\340\313\302\325\350\302\307\312\323\303\307\250\310\321\265\303\331 " ,  // เรียกเหยี่ยวสำรวจศัตรู 
10,		25,2,		115,5,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Scout_Hawk ,SKILL_SCOUT_HAWK,SIN_SKILL_USE_RIGHT,Scout_Hawk_UseMana },

{ "Shooting Mastery" ,		 "\340\276\324\350\301\276\305\321\247\342\250\301\265\325\270\271\331\266\322\307\303 ",  // เพิ่มพลังโจมตีธนูถาวร 
12,		0,0,		0,0,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Shooting_Mastery,SKILL_SHOOTING_MASTERY,SIN_SKILL_USE_NOT,0},

{ "Wind Arrow" ,			 " \342\250\301\265\325\264\351\307\302\270\271\331\305\301 " ,  //  โจมตีด้วยธนูลม 
14,		25,2,		82,3,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Wind_Arrow,SKILL_WIND_ARROW,SIN_SKILL_USE_ALL,Wind_Arrow_UseMana},

{ "Perfect Aim" ,			 "\342\250\301\265\325\315\302\350\322\247\341\301\350\271\302\323 " ,  // โจมตีอย่างแม่นยำ 
17,		29,2,		81,3,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Perfect_Aim,SKILL_PERFECT_AIM,SIN_SKILL_USE_ALL,Perfect_Aim_UseMana},


{ "Dion's Eye" ,			 "\340\276\324\350\301\244\307\322\301\341\301\350\271\302\355\322\341\272\272\266\322\307\303 " ,  // เพิ่มความแม่นยําแบบถาวร 
20,		0,0,		0,0,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Dions_Eye,SKILL_DIONS_EYE,SIN_SKILL_USE_NOT,0},

{ "Falcon" ,			 "\340\303\325\302\241\340\313\302\325\350\302\307\252\350\307\302\342\250\301\265\325 " ,  // เรียกเหยี่ยวช่วยโจมตี 
23,		36,2,		115,4,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Falcon ,SKILL_FALCON,SIN_SKILL_USE_RIGHT,Falcon_UseMana },

{ "Arrow of Rage" ,		 "\342\250\301\265\325\340\273\347\271\241\305\330\350\301\315\302\350\322\247\303\330\271\341\303\247 ",  // โจมตีเป็นกลุ่มอย่างรุนแรง 
26,		38,2,		82,4,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Arrow_of_Rage,SKILL_ARROW_OF_RAGE,SIN_SKILL_USE_RIGHT,A_Rage_UseMana},

{ "Avalanche" ,			 "\342\250\301\265\325\341\272\272\265\350\315\340\271\327\350\315\247 " ,  // โจมตีแบบต่อเนื่อง 
30,		41,2,		103,2,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Avalanche,SKILL_AVALANCHE,SIN_SKILL_USE_RIGHT,Avalanche_UseMana},

{ "Elemental shot" ,			 "\342\250\301\265\325\264\351\307\302\270\271\331\270\322\265\330" ,  // โจมตีด้วยธนูธาตุ
40,		43,2,		82,2,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_E_Shot,SKILL_ELEMENTAL_SHOT,SIN_SKILL_USE_RIGHT,Elemental_Shot_UseMana},

{ "Golden Falcon" ,			 "\340\303\325\302\241\340\313\302\325\350\302\307\267\315\247\252\350\307\302\342\250\301\265\325 ",  // เรียกเหยี่ยวทองช่วยโจมตี 
43,		52,2,		120,4,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_G_Falcon,SKILL_GOLDEN_FALCON,SIN_SKILL_USE_RIGHT,Golden_Falcon_UseMana},

{ "Bomb Shot" ,		     "\241\322\303\302\324\247\270\271\331\303\320\340\272\324\264 " ,  // การยิงธนูระเบิด 
46,		46,2,		87,3,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_B_Shot,SKILL_BOMB_SHOT,SIN_SKILL_USE_RIGHT,BombShot_UseMana},

{ "Perforation" ,			 "\302\324\247\270\271\331\341\272\272\267\320\305\330\267\320\305\307\247" ,  // ยิงธนูแบบทะลุทะลวง
50,		48,2,		82,2,
{0,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Perforation,SKILL_PERFORATION,SIN_SKILL_USE_RIGHT,Perforation_UseMana},

{"Recall Wolverine",		"\340\303\325\302\241\313\301\322\273\350\322\252\350\307\302\342\250\301\265\325 ",  // เรียกหมาป่าช่วยโจมตี 
60,		58,2,		900,0,
{1,0,0},			{0,0,0,0,0,0,0,0},
F_Recall_Wolverin,SKILL_RECALL_WOLVERIN,SIN_SKILL_USE_RIGHT,Recall_Wolverin_UseMana},

{"Evasion Mastery",	"\340\276\324\350\301\244\307\322\301\312\322\301\322\303\266\343\271\241\322\303\313\305\272\313\305\325\241 ",  // เพิ่มความสามารถในการหลบหลีก 
63,		0,0,		0,0,
{1,0,0},			{0,0,0,0,0,0,0,0},
F_Evasion_Mastery,SKILL_EVASION_MASTERY,SIN_SKILL_USE_NOT,0},

{"Phoenix Shot",	"\342\250\301\265\325\264\351\307\302\271\241\277\324\271\324\241\312\354 ",  // โจมตีด้วยนกฟินิกส์ 
66,		55,2,		100,0,
{1,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Phoenix_Shot,SKILL_PHOENIX_SHOT,SIN_SKILL_USE_RIGHT,Phoenix_Shot_UseMana},

{"Force of Nature","\340\276\324\350\301\244\307\322\301\312\322\301\322\303\266\250\322\241\312\324\350\247\341\307\264\305\351\315\301 ",  // เพิ่มความสามารถจากสิ่งแวดล้อม 
70,		56,2,		900,0,
{1,0,0},			{sinWS1,0,0,0,0,0,0,0},
F_Force_Of_Nature,SKILL_FORCE_OF_NATURE,SIN_SKILL_USE_RIGHT,Force_Of_Nature_UseMana},


/*----------------------------------------------------------------------------*
*							Morion
*-----------------------------------------------------------------------------*/	
/////// Knight
{ "Sword Blast" ,		 "\342\250\301\265\325\310\321\265\303\331\264\351\307\302\276\305\321\247\341\313\350\247\264\322\272 " ,  // โจมตีศัตรูด้วยพลังแห่งดาบ 
10,		22,2,		82,2,
{0,0,0},			{sinWS2,0,0,0,0,0,0,0},
F_Sword_Blast,SKILL_SWORD_BLAST,SIN_SKILL_USE_ALL,Sword_Blast_UseMana},

{ "Holy Body" ,			 "\303\350\322\247\241\322\302\310\321\241\264\324\354\312\324\267\270\324\354 " ,  // ร่างกายศักดิ์สิทธิ์ 
12,		28,2,		110,3,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_HolyBody ,SKILL_HOLY_BODY,SIN_SKILL_USE_RIGHT,HolyBody_UseMana },

{ "Physical Training" ,		 "\273\303\321\272\312\301\264\330\305\302\354\303\350\322\247\241\322\302" ,  // ปรับสมดุลย์ร่างกาย
14,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Physical_Traning,SKILL_PHYSICAL_TRANING,SIN_SKILL_USE_NOT,0},

{ "Double Crash" ,		 "\342\250\301\265\325\315\302\350\322\247\303\330\271\341\303\247\312\315\247\244\303\321\351\247\253\351\315\271" ,  // โจมตีอย่างรุนแรงสองครั้งซ้อน
17,		35,2,		82,2,
{0,0,0},			{sinWA1,sinWC1,sinWS2,0,0,0,0,0},
F_Double_Crash,SKILL_DOUBLE_CRASH,SIN_SKILL_USE_RIGHT,D_Crash_UseMana},

{ "Holy Valor" ,			 "\340\276\324\350\301\276\305\321\247\241\322\303\342\250\301\265\325 Undead \343\313\351\241\321\272\265\271\340\315\247\341\305\320\340\276\327\350\315\271\303\350\307\301 Party \267\325\350   \315\302\331\350\343\271\303\320\302\320 " ,  // เพิ่มพลังการโจมตี Undead ให้กับตนเองและเพื่อนร่วม Party ที่   อยู่ในระยะ 
20,		36,2,		100,3,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Holy_Valor,SKILL_HOLY_VALOR,SIN_SKILL_USE_RIGHT,Holy_Valor_Mana},

{ "Brandish" ,			 "\241\303\320\342\264\264\342\250\301\265\325\310\321\265\303\331\340\273\347\271\307\247\241\307\351\322\247 ",  // กระโดดโจมตีศัตรูเป็นวงกว้าง 
23,		38,2,		82,2,
{0,0,0},			{sinWP1,sinWS2,0,0,0,0,0,0},
F_Brandish,SKILL_BRANDISH,SIN_SKILL_USE_ALL,Brandish_Mana},

{ "Piercing" ,			 "\341\267\247\310\321\265\303\331\341\272\272\267\320\305\330\267\320\305\307\247" ,  // แทงศัตรูแบบทะลุทะลวง
26,		41,2,		82,2,
{0,0,0},			{sinWS2,0,0,0,0,0,0,0},
F_Piercing,SKILL_PIERCING,SIN_SKILL_USE_ALL,Piercing_Mana},

{ "Drastic Spirit" ,		 "\276\305\321\247\273\351\315\247\241\321\271\340\276\324\350\301\242\326\351\271\252\321\350\307\242\263\320 " ,  // พลังป้องกันเพิ่มขึ้นชั่วขณะ 
30,		44,2,		100,2,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Drastic_Spirit,SKILL_DRASTIC_SPIRIT,SIN_SKILL_USE_RIGHT,Drastic_Spirit_Mana},

{"Sword Mastery",	"\340\276\324\350\301\276\305\321\247\264\322\272\266\322\307\303 ",  // เพิ่มพลังดาบถาวร 
40,		0,0,		0,0,
{0,0,0},			{sinWS2,0,0,0,0,0,0,0},
F_S_Mastery,SKILL_SWORD_MASTERY,SIN_SKILL_USE_NOT,0},

{ "Divine Inhalation" ,		 "\312\303\351\322\247\342\305\350\310\321\241\264\324\354\312\324\267\270\324\354 " ,  // สร้างโล่ศักดิ์สิทธิ์ 
43,		46,2,		130,1,
{0,0,0},			{sinDS1,0,0,0,0,0,0,0},
F_D_Inhalation,SKILL_DIVINE_INHALATION,SIN_SKILL_USE_RIGHT,D_Inhalation_UseMana},

{ "Holy Incantation" ,		 "\312\320\241\264\250\324\265 Undead \343\313\351\301\322\340\273\347\271\305\331\241\271\351\315\247 " ,  // สะกดจิต Undead ให้มาเป็นลูกน้อง 
46,		50,2,		120,1,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Holy_Incantation,SKILL_HOLY_INCANTATION,SIN_SKILL_USE_RIGHT,H_Incantation_UseMana},

{ "Grand Cross" ,		 "\241\322\247\340\242\271\310\321\241\264\324\354\312\324\267\270\324\354 ",  // กางเขนศักดิ์สิทธิ์ 
50,		45,2,		82,2,
{0,0,0},			{sinWH1,sinWS2,0,0,0,0,0,0},
F_Grand_Cross,SKILL_GRAND_CROSS,SIN_SKILL_USE_RIGHT,Grand_Cross_UseMana},

{"Devine piercing",	"\342\250\301\265\325\310\321\265\303\331\264\351\307\302\276\305\321\247\264\322\272\341\313\350\247\310\303\321\267\270\322 ",  // โจมตีศัตรูด้วยพลังดาบแห่งศรัทธา 
70,		51,2,		160,0,
{1,0,0},			{sinWS2,0,0,0,0,0,0,0},
F_Divine_Piercing,SKILL_DIVINE_PIERCING,SIN_SKILL_USE_RIGHT,Divine_Piercing_UseMana},

{"Godly Shield",	"\342\305\350\341\313\350\247\276\303\320\340\250\351\322 ",  // โล่แห่งพระเจ้า 
63,		50,2,		400,0,
{1,0,0},			{sinDS1,0,0,0,0,0,0,0},
F_Godly_Shield,SKILL_GODLY_SHIELD,SIN_SKILL_USE_RIGHT,Godly_Shield_UseMana},

{"God Bless",	"\242\315\276\305\321\247\315\321\271\302\324\350\247\343\313\255\350\250\322\241\276\303\320\340\250\351\322 ",  // ขอพลังอันยิ่งใหญ่จากพระเจ้า 
66,		51,2,		330,0,
{1,0,0},			{sinWS2,0,0,0,0,0,0,0},
F_God_Bless,SKILL_GOD_BLESS,SIN_SKILL_USE_RIGHT,God_Bless_UseMana},

{"Sword of Justice","\264\322\272\341\313\350\247\244\330\263\270\303\303\301",  // ดาบแห่งคุณธรรม
60,		53,2,		250,0,
{1,0,0},			{sinWS2,0,0,0,0,0,0,0},
F_Sword_Of_Justice,SKILL_SWORD_OF_JUSTICE,SIN_SKILL_USE_RIGHT,Sword_Of_Justice_UseMana},

/////////// Atalanta
{ "Shield Strike" ,		 "\312\265\321\351\271\310\321\265\303\331\264\351\307\302\241\322\303\242\307\351\322\247\342\305\350 ",  // สตั้นศัตรูด้วยการขว้างโล่ 
10,		23,2,		82,2,
{0,0,0},			{sinDS1,0,0,0,0,0,0,0},
F_S_Strike ,SKILL_SHIELD_STRIKE,SIN_SKILL_USE_RIGHT,S_Strike_UseMana },

{ "Farina" ,			 "\242\307\351\322\247\313\315\241\315\315\241\344\273\264\351\307\302\244\307\322\301\340\303\347\307\312\331\247 " ,  // ขว้างหอกออกไปด้วยความเร็วสูง 
12,		26,2,		82,2,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Farina,SKILL_FARINA,SIN_SKILL_USE_ALL,Farina_UseMana},

{ "Throwing Mastery" ,		 "\340\276\324\350\301\276\305\321\247\342\250\301\265\325\313\315\241\266\322\307\303 ",  // เพิ่มพลังโจมตีหอกถาวร 
14,		0,0,		0,0,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_D_Mastery,SKILL_THROWING_MASTERY,SIN_SKILL_USE_NOT,0},

{ "Vigor Spear" ,		 "\342\250\301\265\325\264\351\307\302\313\315\241\310\321\241\264\324\354\312\324\267\270\324\354 " ,  // โจมตีด้วยหอกศักดิ์สิทธิ์ 
17,		32,2,		82,2,
{0,0,0},			{sinWP1,sinWT1,0,0,0,0,0,0},
F_V_Spear,SKILL_VIGOR_SPEAR,SIN_SKILL_USE_ALL,V_Spear_UseMana},

{ "Windy" ,			 "\340\276\324\350\301\303\320\302\320\241\322\303\342\250\301\265\325\242\315\247\313\315\241 " ,  // เพิ่มระยะการโจมตีของหอก 
20,		34,2,		100,2,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Windy,SKILL_WINDY,SIN_SKILL_USE_RIGHT,Windy_Mana},

{ "Twist Javelin" ,		 "\242\307\351\322\247\313\315\241\341\272\272\244\307\247\312\307\350\322\271 " ,  // ขว้างหอกแบบควงสว่าน 
23,		36,2,		82,2,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Twist_Javelin,SKILL_TWIST_JAVELIN,SIN_SKILL_USE_RIGHT,Twist_Javelin_Mana},

{ "Soul Sucker" ,			 "\342\305\350\264\331\264\307\324\255\255\322\263 " ,  // โล่ดูดวิญญาณ 
26,		42,2,		110,2,
{0,0,0},			{sinDS1,0,0,0,0,0,0,0},
F_Soul_Sucker,SKILL_SOUL_SUCKER,SIN_SKILL_USE_RIGHT,Soul_Sucker_Mana},

{ "Fire Javelin" ,		 "\242\307\351\322\247\313\315\241\344\277" ,  // ขว้างหอกไฟ
30,		40,2,		82,2,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Fire_Javelin,SKILL_FIRE_JAVELIN,SIN_SKILL_USE_ALL,Fire_Javelin_Mana},

{ "Spilt Javelin" ,		 "\242\307\351\322\247\313\315\241\341\272\272\241\303\320\250\322\302 " ,  // ขว้างหอกแบบกระจาย 
40,		43,2,		115,1,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Split_Javelin,SKILL_SPLIT_JAVELIN,SIN_SKILL_USE_RIGHT,Split_Javelin_UseMana},

{ "Triumph of Valhalla" ,		 "\312\303\351\322\247\241\323\305\321\247\343\250\343\313\351\312\301\322\252\324\241\343\271\241\305\330\350\301     \340\276\324\350\301\315\321\265\303\322\241\322\303\342\250\301\265\325 " ,  // สร้างกำลังใจให้สมาชิกในกลุ่ม     เพิ่มอัตราการโจมตี 
43,		50,2,		120,1,
{0,0,0},			{sinWT1,sinWS2,sinWS1,sinWP1,sinWH1,sinWA1,sinWC1,sinWM1},
F_T_Of_Valhalla,SKILL_TRIUMPH_OF_VALHALLA,SIN_SKILL_USE_RIGHT,T_Of_Valhalla_UseMana},

{ "Lightning Javelin" ,		 "\242\307\351\322\247\313\315\241\312\322\302\277\351\322" ,  // ขว้างหอกสายฟ้า
46,		46,2,		82,2,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Lightning_Javelin,SKILL_LIGHTNING_JAVELIN,SIN_SKILL_USE_ALL,Lightning_Javelin_UseMana},

{ "Storm Javelin" ,		 "\242\307\351\322\247\313\315\241\276\322\302\330\244\331\350 " ,  // ขว้างหอกพายุคู่ 
50,		48,2,		82,2,
{0,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Storm_Javelin,SKILL_STORM_JAVELIN,SIN_SKILL_USE_RIGHT,Storm_Javelin_UseMana},

{"Hall of Valhalla",	"\340\276\324\350\301\244\307\322\301\312\322\301\322\303\266\241\322\303\313\305\272\313\305\325\241 ",  // เพิ่มความสามารถการหลบหลีก 
60,		52,2,		750,0,
{1,0,0},			{sinWA1,sinWC1,sinWH1,sinWP1,sinWS1,sinWT1,0,0},
F_Hall_Of_Valhalla,SKILL_HALL_OF_VALHALLA,SIN_SKILL_USE_RIGHT,Hall_Of_Valhalla_UseMana},

{"X Rage",	"\241\303\320\342\264\264\342\250\301\265\325 3 \244\303\321\351\247 ",  // กระโดดโจมตี 3 ครั้ง 
63,		48,2,		210,0,
{1,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_X_Rage,SKILL_X_RAGE,SIN_SKILL_USE_RIGHT,X_Rage_UseMana},

{"Frost Javelin",	"\242\307\351\322\247\313\315\241\271\351\323\341\242\347\247 ",  // ขว้างหอกน้ำแข็ง 
66,		50,2,		720,0,
{1,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Frost_Javelin,SKILL_FROST_JAVELIN,SIN_SKILL_USE_RIGHT,Frost_Javelin_UseMana},

{"Vengeance",	"\313\315\241\244\305\330\351\301\244\305\321\350\247 ",  // หอกคลุ้มคลั่ง 
70,		55,2,		100,0,
{1,0,0},			{sinWT1,0,0,0,0,0,0,0},
F_Vengeance,SKILL_VENGEANCE,SIN_SKILL_USE_RIGHT,Vengeance_UseMana},

///////////Priestess
{ "Healing" ,			  "\303\321\241\311\322\276\305\321\247\252\325\307\324\265" ,  // รักษาพลังชีวิต
10,		15,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Healing,SKILL_HEALING,SIN_SKILL_USE_RIGHT,Healing_UseMana},

{ "Holy Bolt" ,			 "\342\250\301\265\325\264\351\307\302\276\305\321\247\310\321\241\264\324\354\312\324\267\270\324\354 " ,  // โจมตีด้วยพลังศักดิ์สิทธิ์ 
12,		11,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_HolyBolt,SKILL_HOLY_BOLT,SIN_SKILL_USE_ALL,HolyBolt_UseMana},

{ "Multi Spark" ,			 " \342\250\301\265\325\264\351\307\302\276\305\321\247\312\322\302\277\351\322 ",  //  โจมตีด้วยพลังสายฟ้า 
14,		14,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_M_Spark,SKILL_MULTISPARK,SIN_SKILL_USE_RIGHT,M_Spark_UseMana},

{ "Holy Mind" ,			 "\267\323\343\313\351\310\321\265\303\331\315\350\315\271\341\315\305\247 " ,  // ทำให้ศัตรูอ่อนแอลง 
17,		19,1,		100,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_HolyMind,SKILL_HOLY_MIND,SIN_SKILL_USE_RIGHT,HolyMind_UseMana},

{ "Meditation" ,			 "\340\276\324\350\301\244\350\322 MP \341\272\272\266\322\307\303 " ,  // เพิ่มค่า MP แบบถาวร 
20,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Meditation,SKILL_MEDITATION,SIN_SKILL_USE_NOT,0},

{ "Divine Lighting" ,		 "\342\250\301\265\325\264\351\307\302\312\322\302\277\351\322 ",  // โจมตีด้วยสายฟ้า 
23,		21,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Divine_Lightning,SKILL_DIVINE_LIGHTNING,SIN_SKILL_USE_RIGHT,Divine_Lightning_Mana},

{ "Holy Reflection" ,		 "\312\320\267\351\315\271\244\307\322\301\340\312\325\302\313\322\302\340\251\276\322\320 Undead " ,  // สะท้อนความเสียหายเฉพาะ Undead 
26,		23,1,		120,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Holy_Reflection,SKILL_HOLY_REFLECTION,SIN_SKILL_USE_RIGHT,Holy_Reflection_Mana},

{ "Grand Heal" ,		 "\340\276\324\350\301\276\305\321\247\252\325\307\324\265\267\321\351\247\241\305\330\350\301 " ,  // เพิ่มพลังชีวิตทั้งกลุ่ม 
30,		27,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Grand_Healing,SKILL_GRAND_HEALING,SIN_SKILL_USE_RIGHT,Grand_Healing_Mana},

{ "Vigor Ball " ,		 "\342\250\301\265\325\264\351\307\302\272\315\305\276\305\321\247\244\331\350 " ,  // โจมตีด้วยบอลพลังคู่ 
40,		24,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Vigor_Ball,SKILL_VIGOR_BALL,SIN_SKILL_USE_ALL,Vigor_Ball_UseMana},

{ "Resurrection" ,		 "\252\330\272\252\325\307\324\265\312\301\322\252\324\241\343\271\241\305\330\350\301 " ,  // ชุบชีวิตสมาชิกในกลุ่ม 
43,		31,1,		130,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Resurrection,SKILL_RESURRECTION,SIN_SKILL_USE_RIGHT,Resurrection_UseMana},

{ "Extinction" ,		 "\305\264\267\315\271\276\305\321\247\252\325\307\324\265 Undead " ,  // ลดทอนพลังชีวิต Undead 
46,		28,1,		120,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Extinction,SKILL_EXTINCTION,SIN_SKILL_USE_RIGHT,Extinction_UseMana},

{ "Virtual Life" ,		 "\340\276\324\350\301\276\305\321\247\252\325\307\324\265 " ,  // เพิ่มพลังชีวิต 
50,		31,1,		134,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Virtual_Life,SKILL_VIRTUAL_LIFE,SIN_SKILL_USE_RIGHT,Virtual_Life_UseMana},

{"Glacial Spike",	"\342\250\301\265\325\264\351\307\302\274\305\326\241\271\351\323\341\242\347\247",  // โจมตีด้วยผลึกน้ำแข็ง
60,		35,1,		120,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Glacial_Spike,SKILL_GLACIAL_SPIKE,SIN_SKILL_USE_RIGHT,Glacial_Spike_UseMana},

{"Regeneration Field",	"\315\330\267\324\310\265\271\340\276\327\350\315\277\327\351\271\276\305\321\247\252\325\307\324\265\341\305\320\301\322\271\322 ",  // อุทิศตนเพื่อฟื้นพลังชีวิตและมานา 
63,		41,1,		950,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Regeneration_Field,SKILL_REGENERATION_FIELD,SIN_SKILL_USE_RIGHT,Regeneration_Field_UseMana},

{"Chain Lightning",	"\342\250\301\265\325\264\351\307\302\312\322\302\277\351\322\341\272\272\305\331\241\342\253\350",  // โจมตีด้วยสายฟ้าแบบลูกโซ่
66,		41,1,		120,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Chain_Lightning,SKILL_CHAIN_LIGHTNING,SIN_SKILL_USE_RIGHT,Chain_Lightning_UseMana},
//신성계의 Giant를 소환한다.
{"Summon Muspell",	"\340\303\325\302\241\340\267\307\267\331\265\315\315\241\301\322\244\330\351\301\244\303\315\247",  // เรียกเทวทูตออกมาคุ้มครอง
70,		47,1,		800,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Summon_Muspell,SKILL_SUMMON_MUSPELL,SIN_SKILL_USE_RIGHT,Summon_Muspell_UseMana},

///////////Magician
{ "Agony" ,			 "\340\273\305\325\350\302\271\276\305\321\247\252\325\307\324\265\340\273\347\271\301\322\271\322 " ,  // เปลี่ยนพลังชีวิตเป็นมานา 
10,		12,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Agony,SKILL_AGONY,SIN_SKILL_USE_RIGHT,Agony_UseMana},

{ "Fire Bolt" ,			 "\342\250\301\265\325\310\321\265\303\331\264\351\307\302\305\331\241\344\277 " ,  // โจมตีศัตรูด้วยลูกไฟ 
12,		11,1,		84,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_FireBolt,SKILL_FIRE_BOLT,SIN_SKILL_USE_ALL,FireBolt_UseMana},

{ "Zenith" ,			 "\340\276\324\350\301\244\307\322\301\341\242\347\247\341\241\303\350\247\264\351\307\302\244\330\263\312\301\272\321\265\324\242\315\247\270\322\265\330 ",  // เพิ่มความแข็งแกร่งด้วยคุณสมบัติของธาตุ 
14,		15,1,		100,3,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Zenith,SKILL_ZENITH,SIN_SKILL_USE_RIGHT,Zenith_UseMana},

{ "Fire Ball" ,			 "\342\250\301\265\325\241\305\330\350\301\310\321\265\303\331  \264\351\307\302\305\331\241\344\277 " ,  // โจมตีกลุ่มศัตรู  ด้วยลูกไฟ 
17,		19,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_FireBall,SKILL_FIRE_BALL,SIN_SKILL_USE_RIGHT,FireBall_UseMana},

{ "Mental Mastery" ,		 "\340\276\324\350\301\244\350\322\301\322\271\322\266\322\307\303 " ,  // เพิ่มค่ามานาถาวร 
20,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
F_Mental_Mastery,SKILL_MENTAL_MASTERY,SIN_SKILL_USE_NOT,0},

{ "Water Tornado" ,			 "\342\250\301\265\325\264\351\307\302\276\322\302\330\271\355\351\322 ",  // โจมตีด้วยพายุนํ้า 
23,		21,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Watornado,SKILL_WATORNADO,SIN_SKILL_USE_RIGHT,Watornado_Mana},

{ "Enhance Weapon" ,		 "\340\276\324\350\301\270\322\265\330\265\350\322\247\346\343\313\351\241\321\272\315\322\307\330\270\267\325\350\343\252\351 ",  // เพิ่มธาตุต่างๆให้กับอาวุธที่ใช้ 
26,		28,1,		104,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Enchant_Weapon,SKILL_ENCHANT_WEAPON,SIN_SKILL_USE_RIGHT,Enchant_Weapon_Mana},

{ "Death Ray" ,			 "\342\250\301\265\325\264\351\307\302\305\323\341\312\247\341\313\350\247\244\307\322\301\265\322\302 " ,  // โจมตีด้วยลำแสงแห่งความตาย 
30,		26,1,		82,2,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Dead_Ray,SKILL_DEAD_RAY,SIN_SKILL_USE_ALL,Dead_Ray_Mana},

{ "Energy Shield" ,			 "\312\303\351\322\247\301\350\322\271\340\307\267\301\271\265\303\354\273\351\315\247\241\321\271\265\271\340\315\247 ",  // สร้างม่านเวทมนตร์ป้องกันตนเอง 
40,		40,1,		150,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Energy_Shield,SKILL_ENERGY_SHIELD,SIN_SKILL_USE_RIGHT,Energy_Shield_UseMana},

{ "Diastrophism" ,			 "\303\320\340\272\324\264\270\303\263\325 " ,  // ระเบิดธรณี 
43,		33,1,		106,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Diastrophism,SKILL_DIASTROPHISM,SIN_SKILL_USE_RIGHT,Diastrophism_UseMana},

{ "Spirit Elemental" ,			 "\340\303\325\302\241\250\324\265\307\324\255\255\322\263\340\312\303\324\301\276\305\321\247\340\307\267\301\271\265\303\354 ",  // เรียกจิตวิญญาณเสริมพลังเวทมนตร์ 
46,		35,1,		150,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Spirit_Elemental,SKILL_SPIRIT_ELEMENTAL,SIN_SKILL_USE_RIGHT,Spirit_Elemental_UseMana},

{ "Dancing Sword" ,			 "\340\303\325\302\241\264\322\272\270\322\265\330\252\350\307\302\342\250\301\265\325 " ,  // เรียกดาบธาตุช่วยโจมตี 
50,		30,1,		150,1,
{0,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_D_Sword,SKILL_DANCING_SWORD,SIN_SKILL_USE_RIGHT,Dancing_Sword_UseMana},

{"Fire Elemental",	"\340\303\325\302\241\274\331\351\244\330\301\244\303\315\247\270\322\265\330\344\277 ",  // เรียกผู้คุมครองธาตุไฟ 
60,		120,2,		900,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Fire_Elemental,SKILL_FIRE_ELEMENTAL,SIN_SKILL_USE_RIGHT,Fire_Elemental_UseMana},

{"Frame Wave",	"\273\305\350\315\302\276\305\321\247\244\305\327\350\271\340\273\305\307\340\276\305\324\247 ",  // ปล่อยพลังคลื่นเปลวเพลิง 
63,		32,1,		124,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Flame_Wave,SKILL_FLAME_WAVE,SIN_SKILL_USE_RIGHT,Flame_Wave_UseMana},

{"Destruction",	"\305\264\244\350\322\244\307\322\301\312\322\301\322\303\266\242\315\247\310\321\265\303\331 ",  // ลดค่าความสามารถของศัตรู 
66,		43,1,		460,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Distortion,SKILL_DISTORTION,SIN_SKILL_USE_RIGHT,Distortion_UseMana},

{"Meteor",	"\340\307\267\264\322\307\265\241 ",  // เวทดาวตก 
70,		39,1,		190,0,
{1,0,0},			{sinWM1,0,0,0,0,0,0,0},
F_Meteo,SKILL_M_METEO,SIN_SKILL_USE_RIGHT,Meteo_UseMana},

{"Orb",		"\340\276\324\350\301\276\305\321\247\342\250\301\265\325 \342\264\302\343\252\351 Force Orb",  // เพิ่มพลังโจมตี โดยใช้ Force Orb
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,SKILL_FORCE_ORB,0,0},

//퀘스트 타임 테이블
{"\340\244\307\312",		"\250\247\344\273\305\350\322\301\315\271\312\340\265\315\303\354!",  // เควส | จงไปล่ามอนสเตอร์!
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,CHANGE_JOB3_QUEST,0,0},


{"Absorption of Glory","\267\323\343\313\351\276\305\321\247 absorb +10 \265\305\315\264\313\271\326\350\247\312\321\273\264\322\313\354",  // ทำให้พลัง absorb +10 ตลอดหนึ่งสัปดาห์
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,CLANSKILL_ABSORB,0,0},

{"Power Source","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\340\276\324\350\301\242\326\351\27110% \265\305\315\264\313\271\326\350\247\312\321\273\264\322\313\354",  // ทำให้พลังโจมตีเพิ่มขึ้น10% ตลอดหนึ่งสัปดาห์
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,CLANSKILL_ATTACK,0,0},

{"Evade Update","\340\276\324\350\301 Evade 10% \313\271\326\350\247\312\321\273\264\322\313\354",  // เพิ่ม Evade 10% หนึ่งสัปดาห์
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,CLANSKILL_EVASION,0,0},

//สกิลใช้สำหรับไอเทมโจมตีปราสาท
{"Atanasia","\315\302\331\350\343\271\300\322\307\320\344\303\351\310\321\265\303\331\252\321\350\307\244\303\322\307 \276\305\321\247\342\250\301\265\325\305\264\305\2471/2",  // อยู่ในภาวะไร้ศัตรูชั่วคราว พลังโจมตีลดลง1/2
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,SCROLL_INVULNERABILITY,0,0},

{"Deadly Edge","\340\276\324\350\301\342\315\241\322\312\244\303\324\265\324\244\315\3055%",  // เพิ่มโอกาสคริติคอล5%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,SCROLL_CRITICAL,0,0},

{"Evade Plus","\340\276\324\350\301\342\315\241\322\312\315\325\340\307\2645%",  // เพิ่มโอกาสอีเวด5%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,SCROLL_EVASION,0,0},

{"Defense Stun","\252\264\340\252\302\241\322\303\342\250\301\265\325\244\303\324\312\265\321\305\267\322\307\340\307\315\303\354\344\27750%",  // ชดเชยการโจมตีคริสตัลทาวเวอร์ไฟ50%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_R_FIRECRYTAL,0,0},

{"Defense Stun","\252\264\340\252\302\241\322\303\342\250\301\265\325\244\303\324\312\265\321\305\267\322\307\340\307\315\303\354\271\351\323\341\242\347\24750%",  // ชดเชยการโจมตีคริสตัลทาวเวอร์น้ำแข็ง50%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_R_ICECRYTAL,0,0},

{"Defense Stun","\252\264\340\252\302\241\322\303\342\250\301\265\325\244\303\324\312\265\321\305\267\322\307\340\307\315\303\354\312\322\302\277\351\32250%",  // ชดเชยการโจมตีคริสตัลทาวเวอร์สายฟ้า50%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_R_LINGHTINGCRYTAL,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315 fighter \342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อ fighter โจมตีหนักขึ้นอีก20%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_FIGHTER,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315 mechanician \342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อ mechanician โจมตีหนักขึ้นอีก20%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_MECHANICIAN,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315 pikeman \342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อ pikeman โจมตีหนักขึ้นอีก20%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_PIKEMAN,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315 archer \342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อ archer โจมตีหนักขึ้นอีก20%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_ARCHER,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315 knight \342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อ knight โจมตีหนักขึ้นอีก20%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_KNIGHT,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315 atalanta \342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อ atalanta โจมตีหนักขึ้นอีก20%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_ATALANTA,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315Magician\342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%.",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อMagicianโจมตีหนักขึ้นอีก20%.
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_MAGICIAN,0,0},

{"Might Stun","\267\323\343\313\351\276\305\321\247\342\250\301\265\325\267\325\350\313\271\321\241\267\325\350\312\330\264\340\301\327\350\315Priestess\342\250\301\265\325\313\271\321\241\242\326\351\271\315\325\24120%.",  // ทำให้พลังโจมตีที่หนักที่สุดเมื่อPriestessโจมตีหนักขึ้นอีก20%.
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,STONE_A_PRIESTESS,0,0},
//프리미엄 부분 유료화 아이템
{"Eternal Life","\340\273\347\271\315\301\265\320\252\350\307\247\340\307\305\322\313\271\326\350\247\341\265\350\276\305\321\247\342\250\301\265\325\305\264\305\24750%",  // เป็นอมตะช่วงเวลาหนึ่งแต่พลังโจมตีลดลง50%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,SCROLL_P_INVULNERABILITY,0,0},

{"Fatal Edge","\342\250\301\265\325\341\303\247\242\326\351\271 5% \340\301\327\350\315\265\324\264\244\303\324\265\324\244\315\305",  // โจมตีแรงขึ้น 5% เมื่อติดคริติคอล
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,SCROLL_P_CRITICAL,0,0},

{"Avert Scroll","\340\276\324\350\301\342\315\241\322\312\343\271\241\322\303\313\305\272\313\305\325\241 5%",  // เพิ่มโอกาสในการหลบหลีก 5%
0,		0,0,		0,0,
{0,0,0},			{0,0,0,0,0,0,0,0},
NULL,SCROLL_P_EVASION,0,0},
