#include  "TextMessage.h" 
char *szAppName= "Priston Tale " ;
char *mgRequestTrade =  "\340\312\271\315\241\322\303\253\327\351\315\242\322\302\344\273\302\321\247 %s " ;  // เสนอการซื้อขายไปยัง %s 
char *mgRequestTrade2 =  "%s \315\302\331\350\344\241\305\340\241\324\271\344\273\344\301\350\312\322\301\322\303\266\341\305\241\340\273\305\325\350\302\271\344\264\351 ";  // %s อยู่ไกลเกินไปไม่สามารถแลกเปลี่ยนได้ 

char *mgDiconnect =  "\312\321\255\255\322\263\242\321\264\242\351\315\247 \344\301\350\312\322\301\322\303\266\265\324\264\265\350\315\241\321\272\340\253\324\303\354\277\340\307\315\303\354\344\264\351" ;  // สัญญาณขัดข้อง ไม่สามารถติดต่อกับเซิร์ฟเวอร์ได้
char *mgDiconnect1 =  "\312\321\255\255\322\263\242\321\264\242\351\315\247 \344\301\350\312\322\301\322\303\266\265\324\264\265\350\315\241\321\272\340\253\324\303\354\277\340\307\315\303\354(1) \344\264\351 ";  // สัญญาณขัดข้อง ไม่สามารถติดต่อกับเซิร์ฟเวอร์(1) ได้ 
char *mgDiconnect2 =  "\312\321\255\255\322\263\242\321\264\242\351\315\247 \344\301\350\312\322\301\322\303\266\265\324\264\265\350\315\241\321\272\340\253\324\303\354\277\340\307\315\303\354(2) \344\264\351 ";  // สัญญาณขัดข้อง ไม่สามารถติดต่อกับเซิร์ฟเวอร์(2) ได้ 
char *mgDiconnect3 =  "\312\321\255\255\322\263\242\321\264\242\351\315\247 \344\301\350\312\322\301\322\303\266\265\324\264\265\350\315\241\321\272\340\253\324\303\354\277\340\307\315\303\354(3) \344\264\351 ";  // สัญญาณขัดข้อง ไม่สามารถติดต่อกับเซิร์ฟเวอร์(3) ได้ 
char *mgDiconnect4 =  "\312\321\255\255\322\263\242\321\264\242\351\315\247 \344\301\350\312\322\301\322\303\266\265\324\264\265\350\315\241\321\272\340\253\324\303\354\277\340\307\315\303\354(4) \344\264\351 ";  // สัญญาณขัดข้อง ไม่สามารถติดต่อกับเซิร์ฟเวอร์(4) ได้ 

char *mgCloseGame =  "\242\315\272\244\330\263\267\325\350\340\305\350\271 PT \244\350\320 " ;  // ขอบคุณที่เล่น PT ค่ะ 
char *mgCloseWindow =  "\241\303\330\263\322\273\324\264 Window \267\325\350\340\273\324\264\315\302\331\350\241\350\315\271 " ;  // กรุณาปิด Window ที่เปิดอยู่ก่อน 
char *mgCloseBattle =  "\344\301\350\312\322\301\322\303\266\315\315\241\250\322\241\340\241\301\344\264\351 \242\263\320\265\350\315\312\331\351 " ;  // ไม่สามารถออกจากเกมได้ ขณะต่อสู้ 
/*
char *mgQuestName[][4] = {
	{	 "Rank-up Exam " 	,	 "การเปลี่ยนคลาส (สมบูรณ์)"  ,  "ChangeJob1a.Msg"  ,  "ChangeJob1b.Msg"  },
	{	 "Rank-up Exam [Royal Jelly] " 	,	 "การเปลี่ยนคลาส (สมบูรณ์)"  ,  "ChangeJob2a.Msg"  ,  "ChangeJob1b.Msg"  },
	{	 "Rank-up Exam [Hair growth spray] " 	,	 "Rank-up Exam (Done)"  ,  "ChangeJob3a.Msg"  ,  "ChangeJob1b.Msg"  },
	{	"การเปลี่ยนคลาส  [ครั้งที่ 2] "		,	"การเปลี่ยนคลาส  [ครั้งที่ 2] " , "ChangeJob3-1.msg" , "ChangeJob3-2.msg" },
	{	"การเปลี่ยนคลาส  [ครั้งที่ 2] "		,	"การเปลี่ยนคลาส  (สมบูรณ์) " , "ChangeJob3-3.msg" , "ChangeJob3-4.msg" },

	//Fighter Pikeman Mechanic Knight
	{	"การเปลี่ยนคลาสที่ 2 [1] "		,	"การเปลี่ยนคลาสที่ 2 [2] "		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-W1-2.msg" },
	{	"การเปลี่ยนคลาสที่ 2 [3]  "		,	"การเปลี่ยนคลาสที่ 2 [4] "		, "Quest3\\ChangeJob3-W2-2.msg" , "Quest3\\ChangeJob3-W3-2.msg" },
	{	"การเปลี่ยนคลาสที่ 2 [5] "		,	"การเปลี่ยนคลาสที่ 2 [สมบูรณ์] "	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },

	//Archer Atlanta
	{	"การเปลี่ยนคลาสที่ 2 [1] "		,	"การเปลี่ยนคลาสที่ 2 [2] "		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-R1-2.msg" },
	{	"การเปลี่ยนคลาสครั้งที่ 2 [3] "		,	"การเปลี่ยนคลาสที่ 2 [4] "		, "Quest3\\ChangeJob3-R2-2.msg" , "Quest3\\ChangeJob3-R3-2.msg" },
	{	"การเปลี่ยนคลาสที่ 2 [5] "		,	"การเปลี่ยนคลาสที่ 2 [สมบูรณ์]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },

	//Pristess Magician
	{	"การเปลี่ยนคลาสที่ 2 [1] "		,	"การเปลี่ยนคลาสที่ 2 [2] "		, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-M1-2.msg" },
	{	"การเปลี่ยนคลาสที่ 2 [3] "		,	"การเปลี่ยนคลาสที่ 2 [4] "		, "Quest3\\ChangeJob3-M2-2.msg" , "Quest3\\ChangeJob3-M3-2.msg" },
	{	"การเปลี่ยนคลาสที่ 2 [5] "		,	"การเปลี่ยนคลาสที่ 2 [สมบูรณ์] "	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },
		
	// Level Quest
	{	"แด่เธอ"		,	"แด่เธอ (สําเร็จ)" 	,	"LevelQuest\\Quest30.Msg" , "LevelQuest\\Quest30a.Msg" },	//14
	{	"เดอะเคฟ "		,	"เดอะเคฟ(สําเร็จ)"	,	"LevelQuest\\Quest55.Msg" , "LevelQuest\\Quest55a.Msg" },	//15
	{	"เดอะเคฟ "		,	"เดอะเคฟ(สําเร็จ)"	,	"LevelQuest\\Quest55_2.Msg" , "LevelQuest\\Quest55_2a.Msg" }, //16
	{	"มิตรภาพแด่มิเชล "	,	"มิตรภาพแด่มิเชล(สําเร็จ) "	,	"LevelQuest\\Quest70.Msg" , "LevelQuest\\Quest70a.Msg" },	//17
	{	"ผนึก Fury"		,	"ผนึก Fury(สําเร็จ)"	,	"LevelQuest\\Quest80.Msg" , "LevelQuest\\Quest80a.Msg" },	//18
	{	"หยาดนํ้าตาคาร์เลีย"	,	"หยาดนํ้าตาคาร์เลีย(สําเร็จ)",	"LevelQuest\\Quest85.Msg" , "LevelQuest\\Quest85a.Msg" },	//19
	{	"หมู่บ้านยูร่า "	,	"หมู่บ้านยูร่า(สําเร็จ)"	,	"LevelQuest\\Quest90.Msg" , "LevelQuest\\Quest90a.Msg" },	//20
	
	//เควสโบนัสแสตท
	{	"บททดสอบแห่งราชอาณาจักร"	,	"บททดสอบแห่งราชอาณาจักร(เรียบร้อย)" ,	"LevelQuest\\Quest_7State_1.msg" , "LevelQuest\\Quest_7State_end.msg" },	//21
	{	"บททดสอบแห่งราชอาณาจักร"	,	"บททดสอบแห่งราชอาณาจักร(เรียบร้อย)" ,	"LevelQuest\\Quest_7State_2.msg" , "LevelQuest\\Quest_7State_end.msg" },	//22
	{	"บททดสอบแห่งราชอาณาจักร"	,	"บททดสอบแห่งราชอาณาจักร(เรียบร้อย)" ,	"LevelQuest\\Quest_7State_3.msg" , "LevelQuest\\Quest_7State_end.msg" },	//23

	{	"หนทางแห่งความยากลําบาก"	,	"หนทางแห่งความยากลําบาก(สําเร็จ)" ,	"LevelQuest\\Quest_10State_1.msg" , "LevelQuest\\Quest_10State_end.msg" },	//24
	{	"หนทางแห่งความยากลําบาก"	,	"หนทางแห่งความยากลําบาก(สําเร็จ)",	"LevelQuest\\Quest_10State_2_1.msg" , "LevelQuest\\Quest_10State_end.msg" },//25
	{	"หนทางแห่งความยากลําบาก"	,	"หนทางแห่งความยากลําบาก(สําเร็จ)"	"LevelQuest\\Quest_10State_2_2.msg" , "LevelQuest\\Quest_10State_end.msg" },//26
	{	"หนทางแห่งความยากลําบาก"	,	"หนทางแห่งความยากลําบาก(สําเร็จ)",	"LevelQuest\\Quest_10State_2_3.msg" , "LevelQuest\\Quest_10State_end.msg" },//27

	//3เควสเปลี่ยนอาชีพรอบ3
	{	"เควสเปลี่ยนอาชีพรอบที่3[1]"	,	"เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)" ,	"Quest4\\ChangeJob4_1.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//28
	{	"เควสเปลี่ยนอาชีพรอบที่3[2]"	,	"เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)",	"Quest4\\ChangeJob4_2.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//29
	{	"เควสเปลี่ยนอาชีพรอบที่3[3]"	,	"เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)",	"Quest4\\ChangeJob4_3_1.msg" ,	"Quest4\\ChangeJob4_3_2.msg" },	//30
	{	"เควสเปลี่ยนอาชีพรอบที่3[3]"	,	"เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)",	"Quest4\\ChangeJob4_3_3.msg" ,	"Quest4\\ChangeJob4_3_4.msg" },	//31
	{	"เควสเปลี่ยนอาชีพรอบที่3[3]"	,	"เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)" ,	"Quest4\\ChangeJob4_3_5.msg" ,	"Quest4\\ChangeJob4_3_6.msg" },	//32
	{	"เควสเปลี่ยนอาชีพรอบที่3[4]"	,	"เควสเปลี่ยนอาชีพรอบที่3(สําเร็จ)",	"Quest4\\ChangeJob4_4.msg" ,	"Quest4\\ChangeJob4_5.msg" }	//33

};

*/
char *mgRefuseWhisper =  "PM \242\315\247\267\350\322\271\266\331\241\273\257\324\340\312\270 " ;  // PM ของท่านถูกปฏิเสธ 
char *mgWeightOver =  "\271\351\323\313\271\321\241\340\241\324\271.. " ;  // น้ำหนักเกิน.. 

char *mgYahoo =  "Yes!" ;
char *mgContinueChat = "%s :  \342\301\351\301\322\241\344\273\313\271\350\315\302  \244\315\341\313\351\247\340\305\302 \340\313\315\340\313\315 -_-; ";  // %s :  โม้มากไปหน่อย  คอแห้งเลย เหอเหอ -_-; 
char *mgRecvItem = "   \344\264\351\303\321\272\344\315\340\267\301  ( %s ) \341\305\351\307";  //    ได้รับไอเทม  ( %s ) แล้ว

char *mgItemTimeOut = " \344\315\340\267\301  ( %s ) \313\322\302\344\273\340\271\327\350\315\247\250\322\241\313\301\264\315\322\302\330\241\322\303\343\252\351 ";  //  ไอเทม  ( %s ) หายไปเนื่องจากหมดอายุการใช้ 
char *mgSOD_Clear = " \242\315\341\312\264\247\244\307\322\301\302\324\271\264\325 \241\321\272\340\247\324\271\303\322\247\307\321\305\267\325\350\267\350\322\271\344\264\351\303\321\272\335 ( %dGold) ";  //  ｢ﾍ睫ｴｧ､ﾇﾒﾁﾂﾔｹｴﾕ ｡ﾑｺ爰ﾔｹﾃﾒｧﾇﾑﾅｷﾕ霍靨ｹ莇鯏ﾑｺﾝ ( %dGold) 

char *mgBlessCrystal_01 = "\340\241\324\271\250\323\271\307\271\267\325\350\312\322\301\322\303\266\340\303\325\302\241\344\264\351";  // เกินจำนวนที่สามารถเรียกได้
char *mgBlessCrystal_02 = "\241\322\303\340\303\325\302\241\312\322\301\322\303\266\340\303\325\302\241\344\264\351\267\325\305\320\244\303\321\351\247\340\267\350\322\271\321\351\271 ";  // การเรียกสามารถเรียกได้ทีละครั้งเท่านั้น 
char *mgBlessCrystal_03 = "\343\252\351\244\303\324\312\265\321\305\344\301\350\344\264\351";  // ใช้คริสตัลไม่ได้

// Bellatra
char *g_lpBellatraTeamNameText[] = 
{
	"Tribulation of Water",
	"Tribulation of Ground",
	"Tribulation of Wind",
	"Tribulation of Fire",
	"The Stage of Sun",
	"The Stage of Moon",
};

char *g_lpBellatraResult_Text1 = "%s \242\315\247 ";  // %s ของ 
char *g_lpBellatraResult_Text2 = "%s \341\305\320 %s \242\315\247 ";  // %s และ %s ของ 
char *g_lpBellatraResult_Text3 = "\340\242\351\322\303\350\307\301\267\325\301 ";  // เข้าร่วมทีม 
char *g_lpBellatraResult_Text4 = "\242\326\351\271\312\331\350\252\321\351\271\272\271\242\315\247\267\322\307\340\307\315\303\354.";  // ขึ้นสู่ชั้นบนของทาวเวอร์.
