#include "TextMessage.h"

char *szAppName="\203v\203\212\203X\203g\203\223\203e\201[\203\213";  // プリストンテール


char *mgRequestTrade = "%s\227l\202\311\216\346\210\370\202\360\220\\202\265\215\236\202\335\202\334\202\265\202\275\201B";  // %s様に取引を申し込みました。
char *mgRequestTrade2 = "%s\236\351\202\315\213\227\227\243\202\252\211\223\202\242\202\275\202\337\201A\216\346\210\370\202\360\220\\202\265\215\236\202\337\202\334\202\271\202\361\201B";  // %s樣は距離が遠いため、取引を申し込めません。

char *mgDiconnect  = "\203T\201|\203o\201|\202\306\202\314\220\332\221\261\202\252\220\330\202\352\202\334\202\265\202\275\201B";  // サ－バ－との接続が切れました。
char *mgDiconnect1 = "\203T\201|\203o\201|\202\306\202\314\220\332\221\261\202\252\220\330\202\352\202\334\202\265\202\275\201B(1)";  // サ－バ－との接続が切れました。(1)
char *mgDiconnect2 = "\203T\201|\203o\201|\202\306\202\314\220\332\221\261\202\252\220\330\202\352\202\334\202\265\202\275\201B(2)";  // サ－バ－との接続が切れました。(2)
char *mgDiconnect3 = "\203T\201|\203o\201|\202\306\202\314\220\332\221\261\202\252\220\330\202\352\202\334\202\265\202\275\201B(3)";  // サ－バ－との接続が切れました。(3)
char *mgDiconnect4 = "\203T\201|\203o\201|\202\306\202\314\220\332\221\261\202\252\220\330\202\352\202\334\202\265\202\275\201B(4)";  // サ－バ－との接続が切れました。(4)

char *mgCloseGame = "\203Q\201|\203\200\202\360\217I\227\271\202\265\202\334\202\267\201B";  // ゲ－ムを終了します。
char *mgCloseWindow = "\216\147\227\160\222\206\202\314\203\105\203\102\203\223\203\150\203\105\202\360\225\302\202\266\202\304\202\251\202\347\217\111\227\271\202\265\202\304\202\255\202\276\202\263\202\242\201\102";
char *mgCloseBattle = "\220\355\223\254\222\206\202\315\217\111\227\271\202\305\202\253\202\334\202\271\202\361\201\102";
/*
char *mgQuestName[][4] = {
	{"転職クエスト","転職クエスト(完了)","ChangeJob1a.Msg","ChangeJob1b.Msg"},
	{"転職クエスト[ローヤルゼリー]","転職クエスト(完了)" , "ChangeJob2a.Msg" , "ChangeJob1b.Msg" },
	{"転職クエスト[発毛剤]","転職クエスト(完了)" , "ChangeJob3a.Msg" , "ChangeJob1b.Msg" },
	
	{	"転職クエスト[二回目]"	,	"転職クエスト[二回目]" , "ChangeJob3-1.msg" , "ChangeJob3-2.msg" },
	{	"転職クエスト[二回目]"	,	"転職クエスト(完了)" , "ChangeJob3-3.msg" , "ChangeJob3-4.msg" },

	//ファイター　パイクマン　メカニシャン　ナイト
	{	"転職クエスト２次[1]"	,	"転職クエスト２次[2]"	, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-W1-2.msg" },
	{	"転職クエスト２次[3]"	,	"転職クエスト２次[4]"	, "Quest3\\ChangeJob3-W2-2.msg" , "Quest3\\ChangeJob3-W3-2.msg" },
	{	"転職クエスト２次[5]"	,	"転職クエスト２次[完了]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },

	//アーチャー　アタランタ
	{	"転職クエスト２次[1]"	,	"転職クエスト２次[2]"	, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-R1-2.msg" },
	{	"転職クエスト２次[3]"	,	"転職クエスト２次[4]"	, "Quest3\\ChangeJob3-R2-2.msg" , "Quest3\\ChangeJob3-R3-2.msg" },
	{	"転職クエスト２次[5]"	,	"転職クエスト２次[完了]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },

	//プリスティス　マジシャン
	{	"転職クエスト２次[1]"	,	"転職クエスト２次[2]"	, "Quest3\\ChangeJob3-1.msg" , "Quest3\\ChangeJob3-M1-2.msg" },
	{	"転職クエスト２次[3]"	,	"転職クエスト２次[4]"	, "Quest3\\ChangeJob3-M2-2.msg" , "Quest3\\ChangeJob3-M3-2.msg" },
	{	"転職クエスト２次[5]"	,	"転職クエスト２次[完了]"	, "Quest3\\ChangeJob3-3.msg" , "Quest3\\ChangeJob3-4.msg" },
	
	//레벨별 퀘스트
	{	"붯룛묪궻궫귕궸"		,	"붯룛묪궻궫귕궸(뒶뿹)"	, "LevelQuest\\Quest30.Msg" , "LevelQuest\\Quest30a.Msg" },	//14
	{	"The Cave"		,	"The Cave(뒶뿹)" 		, "LevelQuest\\Quest55.Msg" , "LevelQuest\\Quest55a.Msg" },	//15
	{	"The Cave"		,	"The Cave(뒶뿹)"		, "LevelQuest\\Quest55_2.Msg" , "LevelQuest\\Quest55_2a.Msg" }, //16
	{	"ミケレとの友情"		,	"ミケレとの友情(完了)"	, "LevelQuest\\Quest70.Msg" , "LevelQuest\\Quest70a.Msg" },	//17
	{	"封印されたフューリー"	,	"封印されたフューリー(完了)"	, "LevelQuest\\Quest80.Msg" , "LevelQuest\\Quest80a.Msg" },	//18
	{	"긇깏귺궻쀜"		,	"긇깏귺궻쀜(뒶뿹)" 		, "LevelQuest\\Quest85.Msg" , "LevelQuest\\Quest85a.Msg" },	//19
	{	"깇깋긮깒긞긙"		,	"깇깋긮깒긞긙(뒶뿹)"	, "LevelQuest\\Quest90.Msg" , "LevelQuest\\Quest90a.Msg" },	//20
	
	//보너스 스텟 퀘스트
	{	"돞뜎궻럫뙮"	,	"돞뜎궻럫뙮걁뒶뿹걂" ,	"LevelQuest\\Quest_7State_1.msg" , "LevelQuest\\Quest_7State_end.msg" },	//21
	{	"돞뜎궻럫뙮"	,	"돞뜎궻럫뙮걁뒶뿹걂" ,	"LevelQuest\\Quest_7State_2.msg" , "LevelQuest\\Quest_7State_end.msg" },	//22
	{	"돞뜎궻럫뙮"	,	"돞뜎궻럫뙮걁뒶뿹걂" ,	"LevelQuest\\Quest_7State_3.msg" , "LevelQuest\\Quest_7State_end.msg" },	//23

	{	"볩궢궋럫쀻"	,	"볩궢궋럫쀻걁뒶뿹걂" ,	"LevelQuest\\Quest_10State_1.msg" , "LevelQuest\\Quest_10State_end.msg" },	//24
	{	"볩궢궋럫쀻"	,	"볩궢궋럫쀻걁뒶뿹걂" ,	"LevelQuest\\Quest_10State_2_1.msg" , "LevelQuest\\Quest_10State_end.msg" },//25
	{	"볩궢궋럫쀻"	,	"볩궢궋럫쀻걁뒶뿹걂" ,	"LevelQuest\\Quest_10State_2_2.msg" , "LevelQuest\\Quest_10State_end.msg" },//26
	{	"볩궢궋럫쀻"	,	"볩궢궋럫쀻걁뒶뿹걂" ,	"LevelQuest\\Quest_10State_2_3.msg" , "LevelQuest\\Quest_10State_end.msg" },//27

	//3혖E픸E갋퀘스트
	{	"転職テスト3次[1]"	,	"転職テスト3次（完了）" ,	"Quest4\\ChangeJob4_1.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//28
	{	"転職テスト3次[2]"	,	"転職テスト3次（完了）" ,	"Quest4\\ChangeJob4_2.msg" ,	"Quest4\\ChangeJob4_5.msg" },	//29
	{	"転職テスト3次[3]"	,	"転職テスト3次（完了）" ,	"Quest4\\ChangeJob4_3_1.msg" ,	"Quest4\\ChangeJob4_3_2.msg" },	//30
	{	"転職テスト3次[3]"	,	"転職テスト3次（完了）" ,	"Quest4\\ChangeJob4_3_3.msg" ,	"Quest4\\ChangeJob4_3_4.msg" },	//31
	{	"転職テスト3次[3]"	,	"転職テスト3次（完了）" ,	"Quest4\\ChangeJob4_3_5.msg" ,	"Quest4\\ChangeJob4_3_6.msg" },	//32
	{	"転職テスト3次[4]"	,	"転職テスト3次（完了）" ,	"Quest4\\ChangeJob4_4.msg" ,	"Quest4\\ChangeJob4_5.msg" }	//33

};
*/
char *mgRefuseWhisper = "\203v\203\211\203C\203x\201[\203g\203`\203\203\203b\203g\202\252\213\221\224\333\202\263\202\352\202\334\202\265\202\275";  // プライベートチャットが拒否されました
char *mgWeightOver = "\217\144\227\312\202\360\222\264\211\337\202\265\202\334\202\265\202\275        ";

char *mgYahoo = "\203\204\203b\203z\201`";  // ヤッホ～
char *mgContinueChat = "%s\201F\230b\202\265\211\337\202\254\202\304\220\343\202\252\214\305\202\334\202\301\202\304\202\265\202\334\202\301\202\275\201I\202\244\202\355\201[-_-;";  // %s：話し過ぎて舌が固まってしまった！うわー-_-;
char *mgRecvItem = "   \203A\203C\203e\203\200( %s ) \202\360\216\363\202\257\216\346\202\350\202\334\202\265\202\275  ";  //    アイテム( %s ) を受け取りました  

char *mgItemTimeOut = "\203A\203C\203e\203\200 ( %s ) \216g\227p\212\372\212\324\202\252\211\337\202\254\202\304\217\301\213\216\202\263\202\352\202\334\202\265\202\275";  // アイテム ( %s ) 使用期間が過ぎて消去されました
char *mgSOD_Clear = " \202\250\202\337\202\305\202\306\202\244\202\262\202\264\202\242\202\334\202\267\201\102\217\334\213\340 %dG\202\360\212\154\223\276\202\265\202\334\202\265\202\275 ";

char *mgBlessCrystal_01 = "  \217\242\212\253\202\305\202\253\202\351\214\302\220\224\202\360\222\264\202\246\202\334\202\265\202\275\201\102  ";
char *mgBlessCrystal_02 = "   \217\242\212\253\202\3151\211\361\202\314\202\335\202\305\202\253\202\334\202\267\201\102   ";
char *mgBlessCrystal_03 = "   \203N\203\212\203X\203^\203\213\202\360\216g\227p\202\305\202\253\202\334\202\271\202\361\201B   ";  //    クリスタルを使用できません。   

// Bellatra
char *g_lpBellatraTeamNameText[] = 
{
	"\220\205\202\314\216\216\227\373",
	"\223\171\202\314\216\216\227\373",
	"\225\227\202\314\216\216\227\373",
	"\211\316\202\314\216\216\227\373",
	"\221\276\227\172\202\314\212\324",
	"\214\216\202\314\212\324",
};

char *g_lpBellatraResult_Text1 = "%s \202\311";
char *g_lpBellatraResult_Text2 = "%s \202\306 %s \202\311";
char *g_lpBellatraResult_Text3 = "\216Q\211\301\202\265\202\275\203`\201[\203\200\202\252";  // 参加したチームが
char *g_lpBellatraResult_Text4 = "\217\343\210\312\202\314\223\203\202\326\220\151\202\335\202\334\202\265\202\275";
