char *parkTextVO = "\211\271\220\272\203`\203\203\203b\203g\203I\203v\203V\203\207\203\223";  // 音声チャットオプション
char *parkTextMIC = "\203}\203C\203N";  // マイク
char *parkTextMicON = "On";
char *parkTextMicOFF = "Off";

char *parkTextVol = "\203{\203\212\203\205\201[\203\200 : ";  // ボリューム : 
char *parkTextVolLow = "\222\341";
char *parkTextVolHigh = "\215\202";

char *parkTextVolErr1 = "\203E\203B\203\223\203h\203E\223\340\202\305\203}\203C\203N\202\314";  // ウィンドウ内でマイクの
char *parkTextVolErr2 = "\203{\203\212\203\205\201[\203\200\202\360\222\262\220\337\202\265\202\304\202\255\202\276\202\263\202\242";  // ボリュームを調節してください
